[{"Content": "I just downloaded the app for the first time. I tried three times to register an account through facebook, but Nearify crashed every time. I closed the app, tried with both WiFi and 4G, but nothing. Now the app won't even open without crashing. This is extremely disappointing because the concept initially sounds great.", "Numbers": "1", "Date": "March 19, 2017"}, {"Content": "It won't let me use the app. It keeps crashing. I really was hoping for this app to work and be useful for me. Guess not", "Numbers": "2", "Date": "February 5, 2017"}, {"Content": "Loading loading and loading.. app crashes when you try to choose too many categories. App crashes when you try to guest login.", "Numbers": "3", "Date": "March 10, 2017"}, {"Content": "Just crashing after selecting categories, not even able to login. Very poor first impression. Uninstalling.", "Numbers": "4", "Date": "August 17, 2017"}, {"Content": "Just freezes every time I try to log in", "Numbers": "5", "Date": "January 15, 2018"}, {"Content": "Crashes all the time for not good reason", "Numbers": "6", "Date": "March 13, 2017"}, {"Content": "Crashes at login screen due to fancy login screen graphics.", "Numbers": "7", "Date": "April 29, 2017"}, {"Content": "Wouldn't let me log in, then crashed out when I signed in as a guest.", "Numbers": "8", "Date": "June 26, 2018"}, {"Content": "App crashes This app crashes all the time on Bluestack on my PC to simulate android apps. Otherwise, I love this app.", "Numbers": "9", "Date": "March 28, 2016"}, {"Content": "Problems The design looks great but after i select my categories and login with facebook the app crashes...", "Numbers": "10", "Date": "August 8, 2015"}, {"Content": "Keeps closing It's a good app but every time I use it and try to look up more info about an event, it freezes and then it closes with the message that the app is not responding.", "Numbers": "11", "Date": "March 5, 2015"}, {"Content": "Good app..But.. Good app... But crashes often", "Numbers": "12", "Date": "December 17, 2014"}, {"Content": "Immediately crashes Have no idea if this program is any good. Installed it and it crashes.", "Numbers": "13", "Date": "September 18, 2016"}, {"Content": "Terrible app just crashes constantly", "Numbers": "14", "Date": "March 9, 2017"}]