[{"Content": "Nice interface but unreliable - crashed and lost all changes over last few hours", "Numbers": "1", "Date": "February 13, 2019"}, {"Content": "Keeps crashing, I paid the £5 for this and I can't import images, it crashes as soon as I try. It has permissions. Without this feature, this is a waste of money. Please either refund or fix.", "Numbers": "2", "Date": "June 20, 2018"}, {"Content": "Amazing. Since my pc crashed i needed to do my school project and i didn't find how. Until this appeared and my life was much easier by using a mind map through my phone. ❤❤", "Numbers": "3", "Date": "October 21, 2018"}, {"Content": "Pixel XL 2 works great now while it doesn't save instantly while in the newly created bubble you'll need to exit that bubble to force save it so if it so happens to crash you won't lose anything as it has for me. I write my thoughts and songs in it. This has helped me so much with writing for me seeing bubbles allows my mind to think clearly.", "Numbers": "4", "Date": "April 23, 2018"}, {"Content": "It's greatBUT Small issue with crashing unless exit properly.", "Numbers": "5", "Date": "June 6, 2018"}, {"Content": "Great software, I use it frequently, though the export options are limited due to crashing only Nexus / Pixel Devices I can still export to PDF which allows me to share with others who do not utilize the app", "Numbers": "6", "Date": "October 14, 2017"}, {"Content": "This app is so insanely helpfull. It crashes from time to time but no loss of any entered data", "Numbers": "7", "Date": "February 5, 2017"}, {"Content": "Very good. Not perfect but could be.\nBought it. It is very useful. Still a 5 but 4.5 would be more close to the truth. Occasionally freezes but unlocks after a minute. Some small things are still missing and I feel they really shouldn't be... I wish the following choices were there: Choice of size for the circles, more color choices and what about fonts? Cosmetic, sure but still affects the overall feel.", "Numbers": "8", "Date": "November 14, 2016"}, {"Content": "Store on sd card??\nI just installed this 10 minutes ago and already have 100 elements. This is my kind of app!! But as far as I can tell I am unable to change the storage. I want it on my SD card so if I need to get a new phone or my phone crashes, I wont lose Everything. I have a LG Stylo. Is there a way to change the storage permissions so I can please save to SD card? That happens and I change to 5 stars for sure.", "Numbers": "9", "Date": "August 12, 2016"}, {"Content": "Love it, but frequent crashing... Will use & add a star if problem doesn't persist. Love the functionality in a surprisingly minimal package.", "Numbers": "10", "Date": "May 5, 2016"}, {"Content": "I like it but..\nWhy is there no open files option? Sure,we can export an OPML file, but what use is that if I can't import it back into another device where I'm using this app? Or if my device crashes, when I reinstall it, I should be able to get back my map just the way it was.. after all, that's what cloud storage is for.", "Numbers": "11", "Date": "September 3, 2016"}, {"Content": "Good but unstable Crash on nougat.", "Numbers": "12", "Date": "November 24, 2016"}, {"Content": "Excellent app\nI have always made mind maps on paper to organize papers and presentations. I did get frustrated at times that it wasn't easy to move a concept from one place to another. This app solves that problem. It is user friendly, highly functional, and lets me organize in a way that makes sense to me. I haven't had any crashes or freezes. If I needed to, I would upgrade to the paid version, but so far the free version has had all the functionality that I need.", "Numbers": "13", "Date": "April 10, 2016"}, {"Content": "Performance issues/crashes on marshmellow battery saving mode\n*update: removing welcome mindmap relieved animation hiccups and possibly the crashing problem. ( when i had a whole list of life things to add when i first installed the app ive had 3 runs so far running these animations of accessing node groups and adding nodes multiple times a minute and the 2 runs with battery saving mode on crashed the app within 2 minutes. I finished the majority of my mindmap on later runs without battery saving mode on with no problems; Verizon galaxy s6 - 6.0.1 )", "Numbers": "14", "Date": "April 10, 2016"}, {"Content": "I am experiencing crashes I am not sure what triggered the crash, but It happened while I was navigating the bubbles.", "Numbers": "15", "Date": "March 28, 2016"}, {"Content": "Crashes at over 200 elements Still no fix? Even after I got the premium...", "Numbers": "16", "Date": "December 5, 2015"}, {"Content": "Better than Evernote For the way that my brain functions, this escapes everything that made school difficult for me. The whole interface is beautiful and elegant, and the simplicity is further complimented by actual function. Zero crashes, zero problems, will definitely buy full version soon.", "Numbers": "17", "Date": "October 20, 2015"}, {"Content": "Exactly how I love to think Only things missing are the ability to backup or save worlds in case of phone crash and a name for the lines that links to the planets together. Great app and worth buying. Thank you for this.", "Numbers": "18", "Date": "November 14, 2015"}, {"Content": "Won't recommend Crashes, and needs purchase for unlimited\" elements\"", "Numbers": "19", "Date": "September 21, 2015"}, {"Content": "Great App, w/Bugs.\nThis app is genius, I never pay this much for an app, but it's worth it. Was going well, and then, bugs. While adding items or making changes, things would disappear. Maps, pictures, links. Support ticket in and they are very nice. Quick responses and they are on it! Experianced some crashing, but basically this is in beta. I would love more colors, the ability to highlight/underline portions of text w/in my maps, and add picture backgrounds w/in the \"bubbles\" themselves. 5* when bugs fixed!", "Numbers": "20", "Date": "May 29, 2015"}, {"Content": "Interesting layout Just started playing with it. Drag and drop of elements on my Nexus 7 crashes the app but when restarted, it retains the change. The crashes currently prevent me from purchasing the app. It's stylish but time will tell in regards to the app's full usability.", "Numbers": "21", "Date": "May 16, 2015"}, {"Content": "Installed on 2nd device problem. Full version purchased. Installed on 2nd device but is not acting as paid for version, some fearures still locked. Support link crashes so this is the only way to get a message to Mindly support.", "Numbers": "22", "Date": "December 8, 2016"}, {"Content": "Crash on LG G4 Pitch black screen.", "Numbers": "23", "Date": "March 8, 2016"}]