[{"Content": "Constantly crashes\nHi! I just downloaded the app and like what I could see but after 30/40 seconds using it, it chrashes or restarts itself. My cellphone is quite basic and I'm running 4.1.2 so I don't find the app very useful but I wanted to notify this issue, and I would loke to know what could this trouble come from. Greetings", "Numbers": "1", "Date": "December 14, 2016"}, {"Content": "Really good. It once crashed my phone for some reason and it doesn't tell about cell signal but other than that it is good.", "Numbers": "2", "Date": "December 15, 2015"}, {"Content": "Great app, very insightful. There is a small bug. Whenever a sensor value reaches its maximum value, the displayed value is not updated until it drops below that. For example, my light sensor has a max of 30,000 lx. Whenever I expose my phone to full sunlight, the counter will go to 22,560 and stop there, even though the actual value is 30,000. Sometimes it gets it right and does show 30,000, but it always freezes its \"current\" value whenever the sensor reaches max, which might be before it was updated to that max value.", "Numbers": "3", "Date": "July 17, 2017"}, {"Content": "Sony Xperia Active with Android 4.04. Thanks for a free application with no adds (can be turned off). Good tool but only 3 stars as it crashes on my device when turning the screen on landscape mode. Minor issue: the accelerator graph scale gives the full range of the sensor: in my case this render the graph useless as even a strong acceleration shows little variation on the graph.", "Numbers": "4", "Date": "March 12, 2017"}, {"Content": "Crashes I would like to give it 0 stars if i can because it kept crashing out for no reason.Useless app unless fixed", "Numbers": "5", "Date": "December 7, 2016"}, {"Content": "Compass and magnet test crashed the app each and every time on my asus 173 tablet.", "Numbers": "6", "Date": "February 10, 2017"}, {"Content": "keeps crashing whenever the phone display autorotate.", "Numbers": "7", "Date": "March 26, 2017"}]