[{"Content": "Unreliable, crash every time I open it", "Numbers": "1", "Date": "December 11, 2018"}, {"Content": "Wont Work on Android 9 Crash", "Numbers": "2", "Date": "February 20, 2019"}, {"Content": "When i click on the erase button the app crashes can you please fix it?", "Numbers": "3", "Date": "July 15, 2018"}, {"Content": "This app crashed all the time. Fix it please", "Numbers": "4", "Date": "July 9, 2018"}, {"Content": "Can you fix the bug when you're in layer menu and you're spamming the delete button it crashes when you accidentally click somewhere out of the white box while it's \"playing\" the animation? And please add that you can use effects on images/text, for example blur, negative colors, fish eye, hue, brightness, pixelizate, etc. and add that images you import will have their original resolution instead of resolution of the part of screen where the image is. And sorry for my english :D", "Numbers": "5", "Date": "January 7, 2018"}, {"Content": "About the best graphics app I ever used. I have a feedback that it kept crashing but I discovered the reason to be that it was because my phone upgraded to Android 8.0. They we're quick to update it and it's working perfectly now. Kudos!", "Numbers": "6", "Date": "December 8, 2017"}, {"Content": "Hi Guy's, I used Pixel lab on the same android box for a number of years, But as from today it keeps crashing, Tried a fresh install still the same ?? Any idea's why.", "Numbers": "7", "Date": "May 3, 2018"}, {"Content": "Cant use the app Not working properly Just crashed crashed everytime Application is good but cant use it n make any logo or name", "Numbers": "8", "Date": "December 7, 2017"}, {"Content": "It crashes every 2 seconds", "Numbers": "9", "Date": "December 3, 2017"}, {"Content": "BEST APP FOR WRITING THINGS! There is all junk on the market when compared with this app. Even the best PC apps crash dealing with Asian languages, but PixelLab not only support all those languages (unlike any other) but also features easy addition of manual fonts.", "Numbers": "10", "Date": "October 22, 2017"}, {"Content": "Very fun app Works well with Google photos, keep, hangouts. Can use my photos from Google photos cloud even. Nice to make stickers, just trying to import them into Gboard somehow. The only real problem I'm having is the app keeps crashing, especially when using 3D. Uninstalled app then installed, only crashing a little now. Using Nexus 6P on OREO. someone else in reviews had same prob. Is there a paid version with no ads? Ads may be the problems.", "Numbers": "11", "Date": "September 29, 2017"}, {"Content": "What I think? Hmm let's think about that.. I think I would like an app that doesn't crash after putting so much time and effort into a picture just for your app to crash at the end. And to add insult to injury. They will not respond when asking for help..AT ALL!!", "Numbers": "12", "Date": "December 22, 2017"}, {"Content": "Please fix this everytime I open it crash", "Numbers": "13", "Date": "October 26, 2017"}, {"Content": "crash it,for an older version.", "Numbers": "14", "Date": "October 15, 2017"}, {"Content": "I've loved this to use for my channel. I find it very useful but just one feedback. It crashes alot & sometimes I loose work.. So please fix this. Thanks. 👍", "Numbers": "15", "Date": "May 1, 2017"}, {"Content": "That app is absolutely essential for making my videos. I use it for my video's thumbnail and I've gotten hundreds of compliments from my friends and all of my subscribers love this app. Use it for thumbnails and use it to make eventful pics. I love this app and I assure you you will as well. I'd also like to add it's never crashed on me.", "Numbers": "16", "Date": "April 6, 2017"}, {"Content": "Keeps crashing Crashes every time", "Numbers": "17", "Date": "January 29, 2017"}, {"Content": "It keeps crashing every 5-10 seconds...", "Numbers": "18", "Date": "January 3, 2017"}, {"Content": "I DOWNLOAD THIS FOR COOL INTRO BUT Its a little Lag And crash But its ok ☺", "Numbers": "19", "Date": "August 1, 2016"}, {"Content": "Keeps crashing. Would of been fantastic app This app would get 5 stars if it stopped crashing on me. I have lost my work 5 times now. So frustrating. Needs a save option so if app does crash you still have your work saved. Its a shame", "Numbers": "20", "Date": "September 8, 2017"}, {"Content": "KEEPS CRASHING The app keeps crashing and it deletes everything I've done and I have to start it all over again.", "Numbers": "21", "Date": "November 1, 2017"}, {"Content": "App crashes continuously App crashes continuously.... can't use... on my LENOVO K3 note.... Marsh mellow.... please fix urgently...", "Numbers": "22", "Date": "August 12, 2016"}, {"Content": "Crashed!! Crashed on My Galaxy S4 . When I try to add wallpaper and edit the text, it crashed.. :v please fix this.", "Numbers": "23", "Date": "April 21, 2018"}, {"Content": "keeps crashing uninstalled", "Numbers": "24", "Date": "June 26, 2016"}, {"Content": "It's REALLY good. But the new update brought a HUGE bug that can't let me do anything I want. The bug is that the erase button doesn't work and if you click it it will crash the app pls fix this but before I would have given it 5/5", "Numbers": "25", "Date": "January 31, 2016"}, {"Content": "Terrible. Cant do jack all and crashes every 5 seconds", "Numbers": "26", "Date": "December 21, 2015"}, {"Content": "Crash On android 9.0 pie", "Numbers": "27", "Date": "March 21, 2017"}, {"Content": "Always crashing", "Numbers": "28", "Date": "June 16, 2018"}]