[{"Content": "the app is crashing constantly, showing \"connection timed out\" every time being launched. Please, fix it asap.", "Numbers": "1", "Date": "January 26, 2019"}, {"Content": "crashing constantly after the update it says \"Connection time out\" everything I open the app.", "Numbers": "2", "Date": "January 26, 2019"}, {"Content": "too slow. No, not the letters. The system, the app itself. Too slow to update. Too slow to load. It's the only app on my phone that loads for five minutes then crashes. So yes, SLOWLY describes this app well", "Numbers": "3", "Date": "January 4, 2019"}, {"Content": "hey, the app is lovely. but it's crashing down every now and then. please fix the issue.", "Numbers": "4", "Date": "January 18, 2019"}, {"Content": "App crashed while I was opening my user and my username got locked as \"in use\"", "Numbers": "5", "Date": "December 23, 2018"}, {"Content": "it's a very nice app but it often crashes when opening it and i have to restart it", "Numbers": "6", "Date": "January 7, 2019"}, {"Content": "So many crashes, 2 from 3 attempt.", "Numbers": "7", "Date": "November 29, 2018"}, {"Content": "For the past few days that I've been using this app, I absolutely love it! I also really like the idea and concept of this app, and I even think that the execution was done pretty well. There have been a few crashes here and there, but that hasn't affected my overall experience that much. A fun idea that would be cool is to be able to use a variety of stamps instead of just a select few, or be able to customize a letter with small stickers or decorations, but they don't need to add those features. What would be useful is if the organizing aspect of the friends list was tweaked up a bit. Instead of a list, it would be nice to have an overview of the friends and letters that you've sent instead of having just one list full of names. I've gotten a ton of letters in the past few days and it's a bit of a hassle sorting through one list by scrolling to the side. It would be nice to have a separate list of letters so that I can keep track of what I've received, what I've sent and what I haven't replied to yet.", "Numbers": "8", "Date": "October 30, 2018"}, {"Content": "After the first major maintenance update, everything just went away with it. Had quite bugs from it-- crashing after a few moments or hangs.", "Numbers": "9", "Date": "November 3, 2018"}, {"Content": "It sometimes crashes... But things get alright after several times of restart", "Numbers": "10", "Date": "November 10, 2018"}, {"Content": "This app needs and update immediately. App crash in between, it doesn't respond. It says no interest connection/error in connection. I had to reinstall in about 3 times this week and still facing the issue. This moment I can't even log in, I don't know what's taking so long. My internet connection is super fine, got full connectivity of network, reinstalled the app but again no response. Stuck on same thing, no response. There's nothing I can do. Resolve this asap", "Numbers": "11", "Date": "October 16, 2018"}, {"Content": "I was really excited to try this app but it kept crashing on the first set up page so I couldn't make an account :( i deleted then redownloaded the app hoping to try again but it said all of the nicknames I chose (all of which I had tried to choose and were available in my first attempts to make an account) were taken by another user. It's a cute concept - I just wish I could participate", "Numbers": "12", "Date": "October 16, 2018"}, {"Content": "It keeps crashing and says I am an invalid user. I really enjoy this app so please have these bugs fixed.", "Numbers": "13", "Date": "October 16, 2018"}, {"Content": "Every time I open the menu to try to find a new pal, it immediately crashes.", "Numbers": "14", "Date": "October 15, 2018"}, {"Content": "Nice concept, but I cannot actually use the app since it crashes on launch. (Huawei P8 Lite)", "Numbers": "15", "Date": "October 16, 2018"}, {"Content": "This app is GREAT! It's the best for meaningful conversations with strangers across the sea. The fact that it simulates snail mail in an era of instant chats is even better. I completely love it! My only problem is that it crashes a lot. Please fix it if you can huhu", "Numbers": "16", "Date": "September 18, 2018"}, {"Content": "It's a great idea, and up until now that idea worked for me. What i have a problem with is the software. The app always takes to minutes on startup, during which it's basically not responding. After that it works fluent most of the time, but sometimes it randomly decides to get super laggy for a moment. Not to forget that it crashed once and almost bricked my phone.", "Numbers": "17", "Date": "September 18, 2018"}, {"Content": "So, i love this app and i really love the concept. There is nothing bad i can say about the general idea but i cant give it 5 stars cose the app doesnt work properly. Sometimes it doesn't send the letter, instead just stays there trying and it freezes. Also, scrolling is sometimes very laggy, and navigating through the app bugged sometimes. Guys, keep working on it, i think you have a good thing going on :)", "Numbers": "18", "Date": "September 13, 2018"}, {"Content": "Wonderful concept and we'll laid out easy to use interface. App does crash on launch sometimes, so that is something that can be addressed. Overall it's definitely a fun app!", "Numbers": "19", "Date": "September 26, 2018"}, {"Content": "Why does this app keeps on crashing everytime I open it? The previous was stable.", "Numbers": "20", "Date": "September 19, 2018"}, {"Content": "Excellent app. The only thing is when I get a notification from the app and want to open the app through opening the notification, the app freezes on the loading screen", "Numbers": "21", "Date": "September 5, 2018"}, {"Content": "I would've given it a perfect score had it not been crashing so frequently.. I mean... there's someone out there waiting for a response and the app won't open. Other than That, it's a great way to connect to people outside of your social bubble", "Numbers": "22", "Date": "September 17, 2018"}, {"Content": "Nice app but very fragile. Get crashed almost everytime I try to login.", "Numbers": "23", "Date": "September 19, 2018"}, {"Content": "App is really nice concept. It sometimes freezes but I think they will fix it soon. Please add more colors to the app.", "Numbers": "24", "Date": "September 12, 2018"}, {"Content": "Crash when manual select location", "Numbers": "25", "Date": "September 12, 2018"}, {"Content": "Well the design is awesome and concept is very cool. It makes you think really hard before sending a message since it takes so long to arrive. I've been experiencing freezes when reopening the app from recent apps page (from RAM) so I have to manually kill it every time. Also, it says there are no new messages arriving, but they show up on Pen Friends activity. Otherwise, Good job.", "Numbers": "26", "Date": "August 16, 2018"}, {"Content": "Such a great concept, I got way more meaningful conversations on this than I ever had on something like Tinder where people often answer with two words, probably due to the fact that messaging here takes (artificial) time. One star down simply for the fact that reloading the app from RAM always freezes the thing, and it's very annoying to shut down/relaunch.", "Numbers": "27", "Date": "August 26, 2018"}, {"Content": "So far so good, doesn't crash much, and if it does I just restart it! It's faster than snail mail, but slower than email. Great for meeting pen pals, I hope that more people from around the world will join! If you do, please BE PATIENT. That's the point of this app. to make connections slowly over time as you would with a real pen pal.", "Numbers": "28", "Date": "August 20, 2018"}, {"Content": "It is a good app nice design and profile options, but that's it it focuses on distant pen pals but makes receiving a letter very long 15hrs to much realism might as well post real letters out two .would like to be able to make own stamps from uploading pictures the app crashes a lot and works slowly you can't delete account only deactivate that's just silly . I do prefer daily postcard app", "Numbers": "29", "Date": "August 29, 2018"}, {"Content": "Love the idea of this app! But it will crash sometimes. Hope it can be fixed.", "Numbers": "30", "Date": "August 18, 2018"}, {"Content": "It's quite buggy at times. Copying some text from somewhere else and pasting it in a draft crashes the app consistently. Also, trying to edit the draft crashes the app regularly. Please have a look at it. Also, loading time can be quite bad sometimes, even on a high end phone. Beautiful interface, though.", "Numbers": "31", "Date": "August 15, 2018"}, {"Content": "This app has a nice concept, but the app often crashes when writing long letter. Also the app won't send me notifications, even I set it to on in the settings.", "Numbers": "32", "Date": "August 13, 2018"}, {"Content": "App crashes.", "Numbers": "33", "Date": "August 14, 2018"}, {"Content": "Crashed everytime i opened it. So, bye2 apps.", "Numbers": "34", "Date": "September 22, 2018"}, {"Content": "Made an account, but suddenly there were repeat crashes. Later, it popped up as if I asked for it, with a message saying no internet connection. \"Slowly\" indeed. Make your program take care of it's own cache purging, and include error handling for slow internet connections. These are basic programming standards.", "Numbers": "35", "Date": "August 4, 2018"}, {"Content": "The app crashed while I was writing a letter and I lost the draft... I like but man this effort. And also it was quite laggy, and Im quite sure it's not my phone to blame...", "Numbers": "36", "Date": "July 31, 2018"}, {"Content": "I love this app, but I just left the tab to look up a word and when I came back, my letter was gone because the app crashed. Usually this isn't a problem. It's become routine for me to close and reopen the app each time I use it. But this time I was heartbroken because the word I was looking up was in another language. It's a long, painful process to translate things into a language I'm not familiar with and it's mentally exhausting. I lost everything I had carefully, deliberately translated. The people on this app are amazing. The setup is fantastic. The concept is genius. The bugs and crashes need to stop.", "Numbers": "37", "Date": "August 3, 2018"}, {"Content": "It's an awesome concept! The only thing is that I can't actually find a pen pal. I click Auto-Match and the app crashes. I hope you guys fix it.", "Numbers": "38", "Date": "July 31, 2018"}, {"Content": "Great app great concept But the app always crashed and says system error Now I have to reinstall it Please make it reliable", "Numbers": "39", "Date": "August 3, 2018"}, {"Content": "Great concept! I just wish it wouldn't crash so much. I literally can't login to the app anymore with getting a \"System Error\" Toast message.", "Numbers": "40", "Date": "August 3, 2018"}, {"Content": "It keeps crashing no matter what I do.", "Numbers": "41", "Date": "August 1, 2018"}, {"Content": "No users found and when I try the auto match feature, the app just crashes. Oneplus 5T", "Numbers": "42", "Date": "July 31, 2018"}, {"Content": "It's a great concept matched with terrible execution. Fix the constant bugs and crashing and I'd give it 5 stars.", "Numbers": "43", "Date": "July 27, 2018"}, {"Content": "The update is making it crash! I'm losing time with my friends and they might unfriend me for this!", "Numbers": "44", "Date": "July 26, 2018"}, {"Content": "Horrible..kept crashing.", "Numbers": "45", "Date": "July 26, 2018"}, {"Content": "keep on hving crash....", "Numbers": "46", "Date": "July 26, 2018"}, {"Content": "This is a splendid app, received and sent letters to authentic people around the world. Has some bugs, sometimes crashes while typing but can be resumed back! Hopefully this will be fixed in upcoming versions.", "Numbers": "47", "Date": "July 29, 2018"}, {"Content": "I love the concept of this app. Write to random strangers and befriend with them is an interesting experience. However, this app is really unstable as it crashes fairly easily when I want to add words in the middle of my letter.", "Numbers": "48", "Date": "July 29, 2018"}, {"Content": "I'm sure is is a superb app, as many reviews tell me, but when I try to open the app, it crashes every time. I'm using the Huawei p10 lite. Can one of the devs reply to me and tell me how to fix this issue, because I seriously want to try out your app, it looks amazing.", "Numbers": "49", "Date": "September 16, 2018"}, {"Content": "App keeps crashing and won't load up on a Huawei P10 Lite, dual sim with android 8.0 and emui 8.0.", "Numbers": "50", "Date": "September 6, 2018"}]