[{"Content": "unusable with new android update. widget crashes immediately, wont let me log in to app, due to \"invalid credentials.\"", "Numbers": "1", "Date": "February 25, 2019"}, {"Content": "Good app but Everytime that I open a picture inside a task, the app crash and I need to restart it", "Numbers": "2", "Date": "March 27, 2018"}, {"Content": "Crash for every new task", "Numbers": "3", "Date": "December 10, 2017"}, {"Content": "Pros: app works, does not crash Cons: hard to navigate and sort, not practical for use with mobile", "Numbers": "4", "Date": "February 20, 2017"}, {"Content": "App crashes every time I click on a link. Please fix and I will update my review. Galaxy s6", "Numbers": "5", "Date": "January 22, 2017"}, {"Content": "Great tool, sometimes hampered by agonizingly slow speed. Edit: 2 stars, crashes whenever I open up a board project", "Numbers": "6", "Date": "November 29, 2016"}, {"Content": "Crashes As soon as I started trying to add projects and tasks, repeatedly crashed again and again at the same points. Useless. Galaxy s7 edge", "Numbers": "7", "Date": "November 16, 2016"}, {"Content": "Crash when attach file It's going to crash when I attach a file. I'll give 5 stars if this issue is fixed. My device : Xiaomi Redmi Note 2. Thanks.", "Numbers": "8", "Date": "October 12, 2016"}, {"Content": "Cannot log in App freezes when trying to log in with Google. When trying to manually log in using gmail address, it tells me I am using wrong password. Entirely useless to me in its current form.", "Numbers": "9", "Date": "August 10, 2016"}, {"Content": "Impossible to log in First run crashed. Now infinite loop on sign up/login process.", "Numbers": "10", "Date": "November 28, 2015"}, {"Content": "Better after update They fixed the crashing problem at login, so much better. Still very basic, though, and I agree that the colors are kinda nasty. How about theme choice (for online, too)?", "Numbers": "11", "Date": "October 29, 2015"}, {"Content": "Can't even log in I signed up for asana via the web portal using my company's gmail account. However, the app always crashes whenever I try to log in. I can't sign up for new account as well", "Numbers": "12", "Date": "October 26, 2015"}, {"Content": "Frustrating Crashes when I edit the task's due date.", "Numbers": "13", "Date": "June 7, 2015"}, {"Content": "Keeps crashing On S4 and the app keeps crashing. Frustrating.", "Numbers": "14", "Date": "June 6, 2015"}, {"Content": "Adding tasks crashes app Anytime I add a task and try to assign a project it crashes", "Numbers": "15", "Date": "May 31, 2015"}, {"Content": "Keep crashing, and there's no way to add project in the app.", "Numbers": "16", "Date": "May 7, 2015"}, {"Content": "Crashing! App closes immediately upon opening. Not a good update :(", "Numbers": "17", "Date": "April 28, 2015"}, {"Content": "Nothing but crash \"Unfortunately Asana has stopped working\". Stopped? It never even starts. FAIL!", "Numbers": "18", "Date": "April 19, 2015"}, {"Content": "Keeps crashing", "Numbers": "19", "Date": "April 7, 2015"}, {"Content": "Really slow Painfully slow and unresponsive. Crashes over and over again", "Numbers": "20", "Date": "February 23, 2015"}, {"Content": "Always crash. Illegalstateexception", "Numbers": "21", "Date": "January 21, 2015"}, {"Content": "Horribly slow and buggy Notifications are handy when wanting to quickly view tasks and other people's post. However the experience is extremely buggy and slow. Commenting is especially bad and 95% of the time the app freezes whenever I tap the comment button.", "Numbers": "22", "Date": "August 6, 2014"}, {"Content": "used to work.. Now it just crashes Used to use it. now it just crashes. using an android alternative. Still have it installed just waiting for an update that fixes it. Waiting for morethan 3 months...", "Numbers": "23", "Date": "April 24, 2014"}, {"Content": "Crashing often As of this moment only 2stars. Great design, UI, intuitive...all in all it would be awesome if it wouldn't crash every minute or two. Please fix it. I'm using Galaxy Tab 10.1", "Numbers": "24", "Date": "May 4, 2014"}, {"Content": "Great Asana, bad app Really need a lot of fixing on apps. crashes upon opening most of the first time. Requires a lot of re-launching app. Many things dont work on the app like the project overview/status and making sub task for the 1st time, yet the app so heavy it lags all the time", "Numbers": "25", "Date": "December 11, 2014"}, {"Content": "App is totally opposite of web The Web is amazing but the app is slow, and keep crashing", "Numbers": "26", "Date": "December 6, 2014"}, {"Content": "Slow and freezes.", "Numbers": "27", "Date": "March 10, 2014"}, {"Content": "Does not work It crashes immediately after the start. I have never got it working.", "Numbers": "28", "Date": "January 1, 2014"}, {"Content": "App is slow and needs work! Web site is great but app is terrible. App is slow and crashes when going to different projects. Please fix bugs!", "Numbers": "29", "Date": "December 14, 2013"}, {"Content": "UPDATED REVIEW: Freezes at the \"Updating to the latest version\" screen After downloading I logged in via Google and the screen displayed \"Updating to the latest version\" however it never went beyond that screen. I uninstalled and reinstalled several times but I could not move beyond that screen. In all my years using mobile apps this is the first one that has never worked. Very sad considering I truly like the web software. Lack of a useful mobile app will keep me from upgrading to a paid version of Asana. Update: I thought it only fair to come back and update my rating. For now I have moved my rating from 1 star to 3 stars. After uninstalling and reinstalling several times and then rebooting my phone several times. The apps eventually moved past the \"Updating to the latest version\" screen, back to asking me to login with my Google ID. I would highly recommend when you install for the first time that you login and wait for several minutes for the app to figure out what it needs to do. Otherwise, you may get stuck like I did. The install and updating of the app was extremely slow. When you see the three little blue dots, do nothing, let the app think. BTW... this was all over WiFi not cellular data. My phone is a Samsung Galaxy III.", "Numbers": "30", "Date": "January 4, 2014"}, {"Content": "Won't install on Nexus 5 Crashes right away. Use the mobile website instead.", "Numbers": "31", "Date": "January 4, 2014"}, {"Content": "Love Asana, but latest version is constantly crashing on my S4... wish I could roll back to previous version", "Numbers": "32", "Date": "July 18, 2013"}, {"Content": "Force closed on samsung galaxy tab 8.9 The application suddenly crashes aftr signing in..", "Numbers": "33", "Date": "July 6, 2013"}, {"Content": "Freezes, slow Not the best interface, had a hard time to even add comment", "Numbers": "34", "Date": "June 28, 2013"}, {"Content": "Doesn't even load\nHaving used the desktop browser version for over 6 months( which is a fantastic product) decided to give the android app a try. Very disappointed!! Everytime I try running the app get 'Getting latest version' and then app crashes out. I have sufficient memory and every other app functions fine. Very disappointed:-(", "Numbers": "35", "Date": "June 17, 2013"}, {"Content": "Crashing... This is a good tool but this update force closes while updating the tasks from the cloud.", "Numbers": "36", "Date": "June 14, 2013"}, {"Content": "Crashes frequency, very slow. I love Asana in the browser because of how quickly I can create, date, and assign tasks, which is the opposite of this app. Looking forward towards a good version.", "Numbers": "37", "Date": "May 2, 2013"}, {"Content": "Still buggy So happy to have an Asana mobile app, but frustrated that it keeps crashing on my Droid Incredible. Has done so three times in first fifteen minutes of use, and requires me to re-login after each crash.", "Numbers": "38", "Date": "March 7, 2013"}, {"Content": "Slow and buggy Good there is an app. Awful speed and it freezes when \"updating to the latest version on Droid Razr Maxx.\" Have had to uninstall and reinstall twice.", "Numbers": "39", "Date": "March 12, 2013"}, {"Content": "Laggy, crashes all the time The app is pretty slow and crashes like that's what it was designed to do. When it works, it's ok at best.", "Numbers": "40", "Date": "March 19, 2013"}, {"Content": "Crashes like a bug Squishy one, too. Guess 'cause it's full of 'em... Not a productivity tool quite yet.", "Numbers": "41", "Date": "March 3, 2013"}, {"Content": "Unstable Unfortunately crashes too often", "Numbers": "42", "Date": "April 17, 2013"}, {"Content": "Severe issues-could not open app or sign in The app did not recognise my password (that works on desktop) and made my phone crash.", "Numbers": "43", "Date": "July 3, 2016"}, {"Content": "Too bad I actually expect a better app. This version is too low, easy to crash", "Numbers": "44", "Date": "March 2, 2013"}, {"Content": "Better than the mobile site Could be better. Random crashes now and then.", "Numbers": "45", "Date": "March 23, 2013"}, {"Content": "SERIOUS CARELESSNESS !!! How can u launch an app with bugs !! The app crashes as soon as it launches !!!", "Numbers": "46", "Date": "June 14, 2013"}, {"Content": "It crashes i cant even access into it", "Numbers": "47", "Date": "November 5, 2014"}]