[{"Content": "Was so excited to have this app to help keep track of my sons sugars. However, when I first installed we didn't even get a chance to pair it to his tester before it crashed. Had to uninstall and reinstall. After second install we were able to get it to pair with his tester this morning and now the app has crashed yet again. I am very torn with this app.", "Numbers": "1", "Date": "October 5, 2018"}, {"Content": "The app was working great until it was upgraded. Now it keeps crashing. I get mySugr has stopped, each time I attempt to launch it.", "Numbers": "2", "Date": "October 3, 2018"}, {"Content": "Very easy to use and understand and never crashes", "Numbers": "3", "Date": "July 6, 2018"}, {"Content": "For about a week, it's been crashing.", "Numbers": "4", "Date": "February 25, 2018"}, {"Content": "Loved this app but now since update it keeps crashing even before it opens 😠😠😠 will change rating if fixed. If not fixed asap will uninstall!!!", "Numbers": "5", "Date": "February 20, 2018"}, {"Content": "Easy to use, great overviews, doesn't crash", "Numbers": "6", "Date": "September 24, 2017"}, {"Content": "I used this App to track low blood sugar crashes due to an insulinoma. very helpful and easy to export for the doc.", "Numbers": "7", "Date": "April 19, 2017"}, {"Content": "Easy, intuitive, visual, fun Great app. Never crashes. Very fast to log entries. Got my A1C down from 14.5 (actual) when I was hospitalized to 6.0 (estimated) and still dropping. The app helps me pay attention and reinforces good behavior.", "Numbers": "8", "Date": "December 26, 2015"}, {"Content": "Brilliant\nBut for one thing. My mobile crashed and everything had to be backed up and put back to factory setting. Now however hard I have tried, I can't get my PRO status back again, even though it says date of next monthly payment, when I attempted to reinstall the software. Otherwise the best diabetic logbook, ever", "Numbers": "9", "Date": "October 21, 2015"}, {"Content": "Great resource. My phone crashed and I was very happy to find out my data was saved with my login ID.", "Numbers": "10", "Date": "November 13, 2018"}]