[{"Content": "I loved this app when it first launched and paid for the additional extras. I'm so disappointed at this latest version, it crashes each time that I open it. I have read similar responses from other users and see the developers have advised that the issue has been fixed...this doesn't seem to be the case for me.", "Numbers": "1", "Date": "November 6, 2018"}, {"Content": "Now crashes.... I would love to see a filter for items like carbs/fat/protein per serving, so I don't have to sort through as much.", "Numbers": "2", "Date": "November 8, 2018"}, {"Content": "App was amazing, not I can't get more than 5 seconds on it before it crashes.... Please fix and I will go back to 5 stars where this app belongs!", "Numbers": "3", "Date": "November 5, 2018"}, {"Content": "App crashes immediately after latest update", "Numbers": "4", "Date": "October 29, 2018"}, {"Content": "I love this app and it has been huge in helping me lose almost 50 pounds this year. However with the latest update, I can no longer access the app as it crashes immediately upon launch.", "Numbers": "5", "Date": "October 28, 2018"}, {"Content": "Keeps crashing I don't know why", "Numbers": "6", "Date": "October 28, 2018"}, {"Content": "App looks good. But constantly crashing whenever clicking on any option from the main menu. Will update my review if gets fixed", "Numbers": "7", "Date": "October 25, 2018"}, {"Content": "App crashes after any menu selection", "Numbers": "8", "Date": "October 15, 2018"}, {"Content": "Crashes on upgrade. Spams ads.", "Numbers": "9", "Date": "February 14, 2018"}, {"Content": "Great app all round, good recipes for a variety of needs. Would be awesome for people who haven't got a lot of time to cook/prep if a section on total time taken is added in the description. Something like: Time taken: Prep time: 30 minutes Cook time: 20 minutes Freeze time: 20 minutes", "Numbers": "10", "Date": "April 24, 2017"}, {"Content": "Love the app just two feature request: 1, Please could you include an image of each ingredient for the shopping list section in the app. To save time searching the Internet for what the ingredient looks like. 2, Could you provide an alternative link to watch your cooking videos on YouTube. Can you make it that we can watch Your video on any mobile browser app instead of relying solely on the YouTube app which crashes often.", "Numbers": "11", "Date": "January 1, 2018"}, {"Content": "App constantly crashes", "Numbers": "12", "Date": "October 30, 2018"}]