[{"Content": "If it weren't for the severe resource hangs and constant crashes it would be awesome.", "Numbers": "1", "Date": "September 12, 2018"}, {"Content": "I used Feedr for many, many years, but left it for this one. However a couple of annoying things, when all articles are marked read I can't access my news sources anymore. Please, make them visible and accessible at all times, even when all articles are marked read. Also, when entering a date as to when to delete old articles, the date resets itself to today. It crashes a lot. Still, great news reader. I particularly love the in app all text option.", "Numbers": "2", "Date": "December 29, 2017"}, {"Content": "Nice interface, helpful shortcut gestures, and good article view, but unfortunately it crashes fairly often. No feedly sync, sadly", "Numbers": "3", "Date": "September 25, 2017"}, {"Content": "Bye, Feedly. Inoreader's free version is far more stable, flexible, and customizable. No more esoteric nerd tweaking to organize feeds the way you want them. The internal browser doesn't crash. You can read the whole article in the app, and skip the spam gauntlet most sites make you slog through. Keep up the great work. Wishlist: Spritz.", "Numbers": "4", "Date": "March 23, 2017"}, {"Content": "Sadly Inoreader sucks much more since the last few updates. For example, often the app semi-crashes so that articles only get marked if I click on one. Also, sometimes annoying ads for the expensive paid version.", "Numbers": "5", "Date": "February 21, 2017"}, {"Content": "Much improved, now freezes instead of crashes Handles navigation of embedded links much better. After about 20 minutes of reading, ability to load new stories and follow embedded links fails. App has to be reset to continue, because even though in-app navigation still works it won't load content to read.", "Numbers": "6", "Date": "April 28, 2016"}, {"Content": "From bad to worse\nThis app has been so unusable for the last several months that I've been looking at other readers. Now it's refreshing articles every 10 seconds so I can't even get through one paragraph before it flips back to the beginning of the article. Total fail! Now in addition to the constant freezes and restarts and \"no connection\" messages, it doesn't even let me read one article.", "Numbers": "7", "Date": "December 17, 2015"}, {"Content": "Crash finally fixed :) Nexus 7 just got the 6.01 update and no more crashes. Very happy with that.", "Numbers": "8", "Date": "December 15, 2015"}, {"Content": "Constantly crashes when trying to add feeds.", "Numbers": "9", "Date": "November 27, 2015"}, {"Content": "Good RSS feed reader Like the new GUI update and seems lot better and snappy. Also on Asus tf300t it crashes on first run sometimes.", "Numbers": "10", "Date": "November 25, 2015"}, {"Content": "Too expensive for what you get\nSlow jerky scrolling, switching to another app reloads inoreader when you get back to it and forgets the article you were reading, annoying flashing ads, crashes too often, and very expensive at $14,99 per year. I can understand your desire to make a profit, but a recurring subscription is just asking too much. FeedMe is a lot better application.", "Numbers": "11", "Date": "November 17, 2015"}, {"Content": "Meh It has so much potential, but it is just so frustrating. Scrolling is NOT smooth, when you get to the end of the preloaded articles it sort of jumps past an article and freezes to load more. Other times it is just unresponsive.", "Numbers": "12", "Date": "August 2, 2015"}, {"Content": "Completely unstable It crashes more than a 1970s Oldsmobile at a demolition derby.", "Numbers": "13", "Date": "November 19, 2015"}, {"Content": "Used to be awesome New version crashes all the time. I'm looking for an alternative now.", "Numbers": "14", "Date": "September 6, 2015"}, {"Content": "Great app Replaced feedly with this app that does not crash at every turn", "Numbers": "15", "Date": "October 17, 2015"}, {"Content": "I wish the app had some of the features that the browser based system had. One I miss is having feed specific preferences. I have some feeds I want to have as Oldest First, and other as Newest First. In the App it changes all feeds as a global change, which is frustrating. Also, I have noticed an issue where if scanning through some image heavy feeds (i.e. 500px) causes the app to crash with relative consistency. Otherwise things work well and syncs very quickly. I'd like to see some integration with Orbot for the security minded, but well done as is for now.", "Numbers": "16", "Date": "June 25, 2015"}, {"Content": "Constantly crashes last two updates. Upd: Repaired in June. Hurraaa!", "Numbers": "17", "Date": "June 17, 2015"}, {"Content": "Crashs a lot", "Numbers": "18", "Date": "June 13, 2015"}, {"Content": "App keeps crashing Mostly at exit but also at random times. The latest updates still crash... alot... Love the Inoreader service, the app, not so much. I now use News+ and their Inoreader plugin.", "Numbers": "19", "Date": "June 5, 2015"}, {"Content": "Crashes constantly Freeze and crash then have to show all articles to find the one I was reading.", "Numbers": "20", "Date": "May 10, 2015"}, {"Content": "Very unstable, crashes every 2 minutes", "Numbers": "21", "Date": "April 14, 2015"}, {"Content": "Clean & simple UI, no issues I never have problems with the Android version of this app. There are some quirks to using it (it took me a long time to figure out how to mark a post Unread) but no bugs or crashes that I have seen.", "Numbers": "22", "Date": "January 14, 2015"}, {"Content": "With each new update... ...it gets a little buggier. Now it crashes about 1/3 of the time on my phone when I scroll. Recommendation: make swiping optional. Maybe that will fix this bug. Otherwise, I like it! : )", "Numbers": "23", "Date": "December 14, 2014"}, {"Content": "Terrible on Nexus 9 The app crashes when it's already running in memory. After restarting it it works again. Until you try to restart it.", "Numbers": "24", "Date": "November 12, 2014"}, {"Content": "I love the way it works But it crashes constantly.", "Numbers": "25", "Date": "October 10, 2014"}, {"Content": "Has potential Love the look in the new update! The short time I played with it I didn't notice any crashes like the previous version had. Just upgraded to 5 stars...", "Numbers": "26", "Date": "September 27, 2014"}, {"Content": "Way better I can read all articles without it crashing, but still goes back to subscription list instead of article list. Annoying but better than it was. Gave 3 stars back.", "Numbers": "27", "Date": "August 7, 2014"}, {"Content": "Crashes Very Frequently On my Motorola Xoom, this crashes a lot. Crashes trying to switch to Show Updated. Some feeds just can't be viewed.", "Numbers": "28", "Date": "August 2, 2014"}, {"Content": "Good, but a little buggy Crashes and freezes now and then, but overall I like it and it compares well to the Feedly app. I swap between the two for variety.", "Numbers": "29", "Date": "March 20, 2015"}, {"Content": "Crashes chrome every time Whole interface is nice but coming from greader it's slow when you scroll down, and it's crashing chrome when opening link every time. Cyanogenmod 10.1, samsung s2", "Numbers": "30", "Date": "December 18, 2014"}, {"Content": "Crash I installed, selected some topics and then it just says Loading and nothing happens. I gave it 15minutes. I tried restarting, same problem.", "Numbers": "31", "Date": "August 18, 2014"}]