[{"Content": "Too slow and crashes too often", "Numbers": "1", "Date": "February 11, 2019"}, {"Content": "Crashes when trying to open, share or download image files. Useless as a result.", "Numbers": "2", "Date": "October 29, 2018"}, {"Content": "LOVE this tool on desktop, but it rarely works on mobile. I have a Samsung Note9 and the app crashes 4 out of every 5 times I try to use it. As someone who works remotely and travels for work (making me reliant on apps to stay on top of my workload when I can't get to my laptop), I hate that Airtable doesn't work well enough to be useful. I'm the one who pitched the tool to my employer, who eagerly adopted it, and yet now I can't get it to work... 😔", "Numbers": "3", "Date": "September 20, 2018"}, {"Content": "App rarely works and crashes A LOT. Which is a shame because their web version is great but sometimes I can't be at my laptop all the time. I need something mobile and fast and this isn't it.", "Numbers": "4", "Date": "October 12, 2018"}, {"Content": "Love the PC version but the app doesn't work. So if you think you'll be untethered using it, think again. It freezes up and won't move to the next cell. Why subscribe to a service thst keeps you chained to a desk.", "Numbers": "5", "Date": "September 28, 2018"}, {"Content": "Can't use it, won't load and sometimes it crashes. Haven't been able to use a single bit of what it's meant for.", "Numbers": "6", "Date": "October 14, 2018"}, {"Content": "App continues to crash and won't allow anything to be done.", "Numbers": "7", "Date": "October 15, 2018"}, {"Content": "Crashing everytime", "Numbers": "8", "Date": "December 2, 2018"}, {"Content": "App crashes if you try to download any media. Otherwise, everything is good.", "Numbers": "9", "Date": "August 4, 2018"}, {"Content": "Keep crashing on opening notification", "Numbers": "10", "Date": "August 4, 2018"}, {"Content": "Keeps crashing. So it is really very not useful.", "Numbers": "11", "Date": "July 2, 2018"}, {"Content": "Great app if it would stop crashing!", "Numbers": "12", "Date": "July 12, 2018"}, {"Content": "Crash all the time", "Numbers": "13", "Date": "January 18, 2018"}, {"Content": "I don't know what to say this app just keeps crashing I asked a few other people and they complain the same", "Numbers": "14", "Date": "May 26, 2017"}, {"Content": "Keeps on crashing", "Numbers": "15", "Date": "June 21, 2017"}, {"Content": "Crashes when I follow an airtable link from a Gmail message...And half the time just crashes regardless. Shoddy piece of work!", "Numbers": "16", "Date": "March 25, 2017"}, {"Content": "Great way to store data from phones Sadly, it crashes every time I resume the app. Offline mode would be awesome.", "Numbers": "17", "Date": "December 22, 2016"}]