[{"Content": "Good app but need few improvements. music stops after playing for some time also continuously plays music even earphone is removed while listening. crashes if internet connection is not available. there should be buttons to start n stop music in app.", "Numbers": "1", "Date": "January 8, 2019"}, {"Content": "The app crashes alot. Its already been like 4 days and now the app doesn't even opens. Still giving it a 3 star since the experience was good. Please do something about it.", "Numbers": "2", "Date": "January 6, 2019"}, {"Content": "Installed it a couple of days back and opened it right after. Worked great and loved it. But couldnt open the app anymore..keeps crashing...uninstalled it, restsrted my phone and installed it again. Now it wont even finish installing, i get an error message. Pitty", "Numbers": "3", "Date": "January 9, 2019"}, {"Content": "it keeps on crashing I haven't use your app not even a single time. you need to do more work in that app so that is easy to use", "Numbers": "4", "Date": "December 30, 2018"}, {"Content": "Whenever i try to open this app it crashes immediately. Using on my Onplus 5.", "Numbers": "5", "Date": "December 20, 2018"}, {"Content": "the app keeps crashing.....havent been abke to use it even once....pls fix this bug soon.", "Numbers": "6", "Date": "December 30, 2018"}, {"Content": "Minimal Dark UI love it ... 0ne thing i hate about this app is that After couple minutes it just crash on my xiaomi redmi note 4X..", "Numbers": "7", "Date": "January 1, 2019"}, {"Content": "Fantastic App in terms of the content. But it keeps crashing. I can use this once after installation. Using a oneplus 3T", "Numbers": "8", "Date": "December 28, 2018"}, {"Content": "it is good but sometimes it crashes and dosent open", "Numbers": "9", "Date": "December 26, 2018"}, {"Content": "the app crashes every time. Doesnt even get picked up to report for MI crash", "Numbers": "10", "Date": "January 2, 2019"}, {"Content": "crashing when open the application..", "Numbers": "11", "Date": "January 2, 2019"}, {"Content": "Man this app is crashkng down! gota soon fix this up!", "Numbers": "12", "Date": "December 21, 2018"}, {"Content": "crashes immediately", "Numbers": "13", "Date": "December 22, 2018"}]