[{"Content": "STILL ISSUE FROM ANDROID. SINCE UPDATE NOT ABLE TO UPLOAD DOCUMENTS. PHOTOS WORK. BUT .PDF DOESNT WANT TO UPLOAD.... New update: can't upload documents from android. Can't log tickets in android (app freezes and closes). Please update as this is annoying for a \"pro\" user .", "Numbers": "1", "Date": "September 10, 2018"}, {"Content": "This app keeps crashing. Whilst I love the tool on my computer, I also really need to use this on my phone. I've been trying to use it over the course of a few weeks to see if it improves. It seems to have worsened. Please fix this. Otherwise I will have to find another tool to use.", "Numbers": "2", "Date": "July 17, 2017"}, {"Content": "Great app, but freezes on me a lot. No indication of data sync apart from freezing.", "Numbers": "3", "Date": "July 7, 2017"}, {"Content": "The app is is still crashing..", "Numbers": "4", "Date": "August 2, 2017"}, {"Content": "Great app but it crashes very often! Hope it is fixed soon.", "Numbers": "5", "Date": "July 30, 2017"}, {"Content": "I use this app for work everyday, but every 2 out of 5 times it becomes unresponsive and crashes. And when making changes (like renaming, adding notes and checklists, or moving to another column) it doesn't sync properly; more often than not the app refuses to update the change, and I have to make the change again. Or, if I try to change it again it crashes. The only thing going for it is the nice interface and that we use the desktop version a lot, which is a lot better than Trello. Would be ace if it synced properly and didnt crash so often. A few features are missing, like being able to refresh, and filters.", "Numbers": "6", "Date": "June 4, 2017"}, {"Content": "I like this app a lot. The only reason that makes me give this app only one star is that the android app doesn't sync at all! The android app is also not stable because it crashes often. Please get the android app fixed!", "Numbers": "7", "Date": "May 17, 2017"}, {"Content": "Nice app and works fine with web and desktop version. 4 starts because current versions crashes sometimes.", "Numbers": "8", "Date": "January 26, 2017"}, {"Content": "MUCH Improved!\nThe web version had been a favorite but I had abandon it due to the poor android app. This new app is MUCH improved. I would like to see notifications for tasks when they reach the due date/time. Also, a dark theme when in project view would be nice. I did have one freeze up, but I haven't been able to replicate it. This app may be my Trello replacement.", "Numbers": "9", "Date": "December 25, 2016"}, {"Content": "Missing/broken features App crashes while trying to open attachments and URLs in task notes cannot be clicked on.", "Numbers": "10", "Date": "January 10, 2017"}]