[{"Content": "Just installed the app and it is user friendly; very easy to use. The only issue that I have with the app so far is that everytime that I try to change the notification settings the app crashes. I've tried restarting my phone and I have re-installed the app a few times, buy it keeeps on crashing. Please help.", "Numbers": "1", "Date": "July 2, 2018"}, {"Content": "It's helped me stay on track with habits I want to cultivate. I'm really data driven and thrive on external validation, so I like seeing graphs and the calendar fill up with my successful days. It works well for me. The app itself is good too. It hasn't crashed or done anything unexpected in the week I've used ii find logging mt. The only thing I wish I could do is go back and change what makes a day successful.", "Numbers": "2", "Date": "August 9, 2018"}, {"Content": "I am a very big fan of this app! However, I am having trouble login into my account. I was using my account on iPhone, but now I am on Android. The app crashes everytime I login with my account.", "Numbers": "3", "Date": "November 4, 2018"}, {"Content": "Dont pay for this! Changed from 5 to 1. App crashes if you try to log off. No support. they totally ignore you even if you've paid for upgraded app.", "Numbers": "4", "Date": "September 24, 2018"}, {"Content": "After accidentally clearing theapps data in my applications manager, it crashes everytime I try logging back into the app. If I just continue without registering or logging in it works fine. Crashes when I try to log in. Absolutely 5 stars once resolved. UPDATE... so I've done everything suggested multiple times. When I log in I see \"log in successful\" then it crashes. Everytime I try to open after that it crashes. Weird thing is, it's logged in because I still get the notifications I", "Numbers": "5", "Date": "October 8, 2018"}, {"Content": "Helps out with meeting my daily goals. Very easy and simple to use. Reason for 4 stars is because the app keeps crashing even after reinstall.", "Numbers": "6", "Date": "February 2, 2019"}, {"Content": "I paid $10 for the full feature set but this app crashes 10-20x per day. I just use it for the widgets and it still crashes over and over and over. Super annoying.", "Numbers": "7", "Date": "September 27, 2018"}, {"Content": "It's crashing everytime I try to tap on 'reminder'. Thank you it's really nice but the reminder part is the most important part for me.", "Numbers": "8", "Date": "October 22, 2018"}, {"Content": "This looked great, but all it does is crash. As in just logging into the app makes it crash.", "Numbers": "9", "Date": "October 28, 2018"}, {"Content": "I keep getting a popup that habbitbull has stopped working. idk why it was even open in the first place but it is constantly annoying me. and i don't even see any of actual issues that the crash is causing besides the annoying popup. I've sent feedback a few times but no response", "Numbers": "10", "Date": "January 5, 2019"}, {"Content": "Works OK on Galaxy note 8 but constant crash notifications. Can't even log on to the tablet version let alone sync accounts. In the end all data lost and so am I.", "Numbers": "11", "Date": "January 30, 2019"}, {"Content": "Seems pretty awesome so far. The widgets don't seem to be as smooth and freezes from time to time but aside from that, the app itself is great for habits", "Numbers": "12", "Date": "October 23, 2018"}, {"Content": "Update On Sep 25th 2018: This app notifies if you miss on notating which is very useful. ….….….….….….….….….….….…. I am using the paid version of this app and I found it very useful. This app has never crashed yet. The paid version of this app is very affordable. It's a very user-friendly app.", "Numbers": "13", "Date": "October 31, 2018"}, {"Content": "This app is crashing whenever I try to mark as task completed on a particular date.", "Numbers": "14", "Date": "October 17, 2018"}, {"Content": "Crashes on sign in on my Pixel 2 XL", "Numbers": "15", "Date": "December 17, 2018"}, {"Content": "it seems useful, but it crashes on my phone 3 - 15 times a day.", "Numbers": "16", "Date": "December 6, 2018"}, {"Content": "Crashes continuously", "Numbers": "17", "Date": "December 28, 2018"}, {"Content": "After the recent update, the app keeps crashing and doesn't sign me in. I had so much I tracked over the past 5 months and it's all gone now. It's a completely unreliable app.", "Numbers": "18", "Date": "May 2, 2018"}, {"Content": "It was great until it crashed and told me my account doesn't exist. Lost a couple months of data. Created a new account and same thing happened, can't connect and support doesn't respond.", "Numbers": "19", "Date": "June 3, 2018"}, {"Content": "Purchased an app that won't even open! It crashes as soon as it launches. Waste of money.", "Numbers": "20", "Date": "June 28, 2018"}, {"Content": "The app crashes and closes when trying to sync. I have the platinum plan", "Numbers": "21", "Date": "May 29, 2018"}, {"Content": "It keeps on crashing! I can't update the habits per day.", "Numbers": "22", "Date": "May 25, 2018"}, {"Content": "App is great, but it crashes on month view and when trying to edit habit on my Xiaomi Redmi Note 4", "Numbers": "23", "Date": "April 28, 2018"}, {"Content": "I had the free version of this app and it worked great for the first month and then it crashed every other time. I tried to stay with it, but got so frustrated I stopped. A new update says they fixed this issue, so it might work for others. It is easy to use and affective, it was just too simple. Not enough help with accountability and the like. For simple habits I would recommend but habits that are more complicated thus might not be affective...", "Numbers": "24", "Date": "March 26, 2018"}, {"Content": "I got a message that says \"premium expired\" and I lost all of the premium features I paid for. I can't buy it again because it freezes when I try. Seems like others are having this problem too. It's a great app though, I'll go up to five stars when this gets fixed. Update: still no response two months later. Tons of people paid money and never got what they paid for. Dev hasn't addressed a single one of these comments. Very unprofessional.", "Numbers": "25", "Date": "March 16, 2018"}, {"Content": "DOES NOT WORK ATER PAYING TO UPGRADE. Worked great, so I spent $5 to upgrade and now it won't work. Says it's setting up account for 5 min the crashes. I contacted the developers and no response.", "Numbers": "26", "Date": "April 2, 2018"}, {"Content": "I'm honestly disappointed, I was really looking forward to using this app. Sadly it freezes after the \"tap to dive in\" screen everytime and nothing happens, even if I leave it to configure for hours.", "Numbers": "27", "Date": "March 19, 2018"}, {"Content": "Used to work. But now it will not open. Crashes!", "Numbers": "28", "Date": "March 18, 2018"}, {"Content": "Freezes on setting up account page!", "Numbers": "29", "Date": "March 27, 2018"}, {"Content": "I say no account, I confirm no account, it tries to make an account and crashes.", "Numbers": "30", "Date": "March 6, 2018"}, {"Content": "Won't stop crashing!", "Numbers": "31", "Date": "March 26, 2018"}, {"Content": "Good app. Did what I need. However on free version you're limited to five habits. I tried to buy premium, but it crashed every time I clicked Get Premium. Uninstalled.", "Numbers": "32", "Date": "January 21, 2018"}, {"Content": "it use to be my favorite app, but now it doesnt work :/ i have a galaxy note 5.. before i had premium, and now it doesn't let me use premium features, and if i try to \"get premium\" the App crashes and closes", "Numbers": "33", "Date": "February 1, 2018"}, {"Content": "Seems like a really good app. I'm attempting to get premium but it crashes everyone I try.", "Numbers": "34", "Date": "January 28, 2018"}, {"Content": "Crashing EVERY TIME I try to open the app. Takes 3 to 6 tries before it opens. And developer is nonresponsive.", "Numbers": "35", "Date": "January 27, 2018"}, {"Content": "This app crashes often on Samsung Note 4", "Numbers": "36", "Date": "January 26, 2018"}, {"Content": "Recent update (rollback) hasn't fixed issues with this app. Clicking \"Get Premium\" freezes the app on a black screen for five minutes (not kidding) followed by a screen telling me how great Premium is. Newsflash: I have already (foolishly?) purchased Premium. Would just like the app to work please.", "Numbers": "37", "Date": "February 2, 2018"}, {"Content": "It looks like it would be great but couldn't use it because it didn't pass the sign in page. Keeps timing out and crashes.", "Numbers": "38", "Date": "January 15, 2018"}, {"Content": "Can't sign in using any method. Keeps crashing. Uninstalled and reinstalled. Purchased Premium. Reinstalled. No longer shows up as Premium. I used to love this app but literally can't use it anymore.", "Numbers": "39", "Date": "January 8, 2018"}, {"Content": "[Can't sync any longer, have to upgrade to premium first, but app still freezes when I try to do so. As soon as this works, please make a rebate at least.] Edit: App data has to be deleted to restore old behavior!", "Numbers": "40", "Date": "January 10, 2018"}, {"Content": "App crashes if I try to get premium.", "Numbers": "41", "Date": "January 18, 2018"}, {"Content": "Wonder app indeed. My only issue is it won't let me get the premium version. When I click 'get premium' the app freezes on a black screen. It's not often I get premium anything but this app right here is a diamond. Could you maybe help me out with this freezing issue I'm having? Thanks.", "Numbers": "42", "Date": "January 9, 2018"}, {"Content": "I'm a premium user. Everytime I log in with my account it crashes the app. Could you check it out please? Very infuriating. The app was nice by itself", "Numbers": "43", "Date": "November 2, 2017"}, {"Content": "I bought a premium version today, and I tried to sync my account, but the app crashed. I tried to logout from my profile, also causing the app to crash", "Numbers": "44", "Date": "December 11, 2017"}, {"Content": "When trying to share awards or achievements, it crashes. And you can't get back to the achievements you have.", "Numbers": "45", "Date": "December 13, 2017"}, {"Content": "Good UI, great functionality, but crashes every once and a while, but the crashes do not result in a loss of data.", "Numbers": "46", "Date": "September 27, 2017"}, {"Content": "It keeps crashing and not working when I tap the habit to mark it as done.", "Numbers": "47", "Date": "June 25, 2017"}, {"Content": "It's a decent enough app, but it tends to crash a lot despite being so simple.", "Numbers": "48", "Date": "June 25, 2017"}, {"Content": "I love this app. It does everything I need it to and more. But the last couple of deys the quotes have been malfunctioning. I like a quote and it starts loading the next, but then it freezes up and won't give me the next one. Please fix this!", "Numbers": "49", "Date": "May 29, 2017"}, {"Content": "Problems with Android update. I'm a premium user. The app itself seems great. Attractive, easy to use. But with the recent update it will crash whenever I export a file. Reinstalling the app meant I l lost the premium. That was reinstated after contacting customer service. However, they won't respond to my questions about the crashing. If you don't need to export, this is a good app. If you do, you this one will just crash. Don't expect customer service to get back to you.", "Numbers": "50", "Date": "June 21, 2017"}, {"Content": "Worked well until I bought the premium version. Since then contantly crashes and no response at all from support. A refund would be nice but I'm not holding my breath.", "Numbers": "51", "Date": "June 1, 2017"}, {"Content": "UPDATE APRIL 2017: I still can't export my data :( i want to export it as a record of how far i got last year, and then start fresh goals with the app. However the app freezes and force closes as soon as i press the export button. This has been happening for months now. I've used this app since 2014 and purchased premium and it's helped me kick a nasty addiction... i owe a lot to the app but now can't use it :( please sort it devs!! Original review: I use it daily and it gives me a nice visual guide for tracking how I'm doing.", "Numbers": "52", "Date": "March 12, 2017"}, {"Content": "it user to crash when ı add new habit. but ı solve this problem by changing telephone language to english arkadaşlar yeni alışkanlık eklerken telefon dilini ingilizce yaparsanız cökmüyor", "Numbers": "53", "Date": "May 20, 2017"}, {"Content": "Keeps crashing when I open the app and try to do anything.", "Numbers": "54", "Date": "April 1, 2017"}, {"Content": "I'm trying to use the app but there is a bug - I can't enter to Settings, the app crashes. ( My smartphone is Meizu M1 Note.", "Numbers": "55", "Date": "February 20, 2017"}, {"Content": "Regularly crashes on my Motorola Droid Z.", "Numbers": "56", "Date": "April 15, 2017"}, {"Content": "the only issue is when the app freezes on startup", "Numbers": "57", "Date": "April 6, 2017"}, {"Content": "Crashes constantly, unusable.", "Numbers": "58", "Date": "March 22, 2017"}, {"Content": "won't stop crashing even after installing again I cant open the app anymore since I cleared all the data. Please fix it. I have been waiting about a month - update I tried to install the app again every time I log in it starts crashing - update it has been a year I won't even try again I want a refund.", "Numbers": "59", "Date": "April 4, 2017"}, {"Content": "Improvement everywhere I used to be a lazy fu*k, this app is just awesome! Well designed, works well never crashed and a lot of options, great!", "Numbers": "60", "Date": "May 18, 2017"}, {"Content": "Crashes when I try to click \"Get Premium\" I like the app but there is a bug when trying to upgrade. Screen goes black and app hangs.", "Numbers": "61", "Date": "January 9, 2017"}, {"Content": "Would give 5..but..\n..i had to delete and then get the app again because it kept crashing. When i logged into my account, i had to recreate my habits again and check off the days i did it right, AGAIN. Plz do not let this happen again. I love this app because it is helping me 100% so far, but if it keeps crashing.. i hope that i find another app that works just as well.", "Numbers": "62", "Date": "January 8, 2017"}, {"Content": "Platinum has major bug, 5 Stars again when fixed I recently bought premium/platinum and since then it crashes every few minutes and thus has become nearly unusable. Please fix as soon as possible for this is the first time in my life I regret buying premium because it made everything worse than better :&lt;", "Numbers": "63", "Date": "September 16, 2016"}, {"Content": "Used to be great Crashes every other time I open the app. Will change to 5 stars once this gets fixed.", "Numbers": "64", "Date": "September 12, 2016"}, {"Content": "Doesn't work any more Every time I mark habit done on a day the app crashes :(", "Numbers": "65", "Date": "August 29, 2016"}, {"Content": "Good, but half the time the app just loads a black screen or crashes, and I have to restart my phone so it works", "Numbers": "66", "Date": "August 20, 2016"}, {"Content": "Love this app! Easy to use, has not crashed once, and I love the interactive features with users who create similar habit-forming goals. Great app!", "Numbers": "67", "Date": "August 20, 2016"}, {"Content": "Widget crashes The app is great...but the widget was why I bought this. Fix the widget, it crashes at least once a day and I have to remove it and reapply. Half the time that doesn't even work. Would give more stars if I didn't spend money to get a widget and it actually worked....", "Numbers": "68", "Date": "July 18, 2016"}, {"Content": "Nice Design but Buggy\nThe setup for tracking is very good. I like that things can be Yes/No or by amounts (did at least so many). But the app is very buggy. Crashes a lot, reminder notifications break consistently, and the widget will often lock up. Feedback to the developer has got responses so right now I'm holding out hope that it will improve.", "Numbers": "69", "Date": "April 8, 2016"}, {"Content": "Awesome The designs are clear and minimal, and friendly to use. It even has a thriving community of inspiring users. I am using this on a Nexus tab...and they have fixed the crash issues", "Numbers": "70", "Date": "November 13, 2015"}, {"Content": "Handy little app\nI have the full version. This is a good motivational tool with a clean but detailed interface. I have not encountered any bugs or crashes. The widget is handy for some things, although for goals that have large numbers (say, 45 minutes of exercise) it's cumbersome to hit the up button over and over so I just use the app interface instead.", "Numbers": "71", "Date": "March 16, 2016"}, {"Content": "Requires a unique log in. Gives you the option to skip it except it's a lie, just takes you to login screen with that option removed. Dick. Just as well it crashes on load now. Edit: cache got corrupted somehow in my first run. Cleared cache, it worked. Updated review: it's alright. Not the leader of the pack in this type of app. Other similar apps let you try more of the features before hitting the paywall though, so this can't be a full review.", "Numbers": "72", "Date": "November 12, 2015"}, {"Content": "Great but glitches a bit This app is great for sticking to My habits and I love that there are others who have similar goals. But sometimes it will stick and crash. Still love it though.", "Numbers": "73", "Date": "November 7, 2015"}, {"Content": "Flawless The layout is simple, the color coding helps tremendously, the app never crashes or anything of the sort. The forum is extremely helpful, and the app looks very put together. Best free app in my opinion, has shown me the power of simply DOING things and making sure I do them every day.", "Numbers": "74", "Date": "February 1, 2016"}, {"Content": "Good concept but awful app I've had this app on two phones now because I really like the concept behind it but it regularly crashes and freezes on both.", "Numbers": "75", "Date": "April 10, 2016"}, {"Content": "Crash The app is crashing every single time I open it. Worked perfectly fine before", "Numbers": "76", "Date": "February 3, 2016"}, {"Content": "Good when it works Freezes constantly, won't load often. Good app but frustrating.", "Numbers": "77", "Date": "May 6, 2016"}, {"Content": "Too buggy The app crashed when it was supposed to notify me of something and doesn't seem to have tried since then. There are also bugs with multiple days marked unsuccessful.", "Numbers": "78", "Date": "March 20, 2016"}, {"Content": "Best , nearly I lowered the rating cuz having two reminders for the same habit is not working it crashes the app and doesn't display the second reminder in the notifications", "Numbers": "79", "Date": "May 23, 2016"}, {"Content": "Bought for sync feature, now crashes Bought to sync between devices. After bying and hitting sync, app crashed and now crashes on start. Would refund if I knew how to refund IAP..", "Numbers": "80", "Date": "December 26, 2015"}, {"Content": "Pretty useful But keeps on crashing sometimes", "Numbers": "81", "Date": "February 4, 2016"}, {"Content": "Motivational Overall this is a great app. It's easy to use and I like the reminders. The app has never crashed across multiple phone platforms.", "Numbers": "82", "Date": "January 10, 2016"}, {"Content": "crash it crash everytime I'm trying open setting", "Numbers": "83", "Date": "January 7, 2016"}, {"Content": "Great App Works exactly as described. Great interface, easy to use, no crashes. Download it today and start changing your habits!", "Numbers": "84", "Date": "May 19, 2016"}, {"Content": "App keeps crashing after signing in.", "Numbers": "85", "Date": "December 24, 2015"}, {"Content": "Crashes when I want to go to the settings... Uninstalling...", "Numbers": "86", "Date": "January 12, 2016"}, {"Content": "Keeps crashing on marshmallow.", "Numbers": "87", "Date": "February 10, 2016"}, {"Content": "Works, doesn't crash, free version has features", "Numbers": "88", "Date": "January 22, 2016"}, {"Content": "Best Goal tracking app with the Best UX & UI\nI tried many goal tracking apps and this one has the best UX,which makes me want to keep using the app and committing to new goals.Just fyi: this is THE ONLY app for which I'm writing a review and THE ONLY app for which i paid and I don't regret a single penny.And it's funny reminders not to forget certain task are just awesome!It also has wonderful forum where I get inspired for new goals. sometimes the app crashes but it's quite minor", "Numbers": "89", "Date": "March 27, 2016"}, {"Content": "It was a nice idea... but the app crashes the instant it loads. And apparently, the developers don't concern themselves with petty things like complete app failure. Don't waste time or space on this garbage app.", "Numbers": "90", "Date": "January 5, 2016"}, {"Content": "Good app but has limitations I like the app but I constantly deal with freezing and crash screens. And the 5 habit limit is annoying. The reminders and tracker are good though and I like the little titles the app has to remind me.", "Numbers": "91", "Date": "April 13, 2016"}, {"Content": "Good app to form habits I have only been using this app a week, but I enjoy it, it's reminders, and tracking to help me be better and it is like a competition with myself not to miss a day in order to achieve my goal. Good so far. No app/ crash issues.", "Numbers": "92", "Date": "March 3, 2016"}, {"Content": "Was good when it worked. HabitBull is crashing every minute or so, with popup \"HabitBull has stopped working\". Rebooting phone did not fix.", "Numbers": "93", "Date": "April 19, 2016"}, {"Content": "I had cleared the data before on the app. But now when I try to login the app keeps crashing. I had paid for the app and now I want a refund. I emailed you guys and I still haven't gotten my refund.", "Numbers": "94", "Date": "July 16, 2015"}, {"Content": "Rooted phone, no problem Samsung Galaxy S5, towelroot, adblock, on kitkat. Never had a problem with HabitBull crashing.", "Numbers": "95", "Date": "September 3, 2015"}, {"Content": "Crashes instantly Won't stay open long enough to do anything. It force closes before you can mark one day for a single habit.", "Numbers": "96", "Date": "October 13, 2015"}, {"Content": "The widgets crash all the time but great app", "Numbers": "97", "Date": "October 27, 2015"}, {"Content": "Better than originally thought\nYes/No tracking with notes is fine, though not ideal. Tracking with numbers, which could have been ideal, is crippled by the formula used. It also likes crashing and not responding when I switch to it from another app. Can't have correct streak target for habits begun before using app. Maybe it was designed for phones, but couldn't new habit set up be done on one page?", "Numbers": "98", "Date": "July 27, 2015"}, {"Content": "A few Wrinkles left\nThe back-end crashed, so sync isn't working after a re-install. Leaving the 3 stars up until I see that all my data is still safe. 4 stars until I can re-order my habits without freeze and disabling the messages actually stops them from being displayed. Still the best habit tracker out there by a long shot.", "Numbers": "99", "Date": "May 27, 2015"}, {"Content": "Very useful but could still use improvement. The widget and notification bar tiles freeze sometimes which makes the app freeze. Its weird :S", "Numbers": "100", "Date": "May 27, 2015"}, {"Content": "Works fine, would be better with improvements Works quite well so far. Two things that could be improved 1. Sync could cause crash sometimes, still not sure what kind of scenario would cause this though. 2. Would be good if we can set weekly goal. For example, study for 20 pomodoros within a week, no matter how many each day.", "Numbers": "101", "Date": "April 18, 2015"}, {"Content": "Really glad I downloaded it I've been trying to track habits for a while and as silly as it seems, just seeing a circle that says you've made it through a day, really helps. Solid app too, never crashes and is easy to navigate.", "Numbers": "102", "Date": "April 7, 2015"}, {"Content": "Love this! I've been using this on a Samsung Galaxy for over 4 months. Works great, doesn't crash, doesn't overuse power. Great for motivation and helping me stay on track with new habits. :)", "Numbers": "103", "Date": "April 26, 2015"}, {"Content": "Great tool I use our daily to help improve my life. So far no bugs or crashes on my GS5.", "Numbers": "104", "Date": "May 8, 2015"}, {"Content": "The app crashes when it is moved to background.", "Numbers": "105", "Date": "March 8, 2015"}, {"Content": "Unresponsive After setting up my prospective habit, I touched the date to register the number of minutes exercise I'd done but it did not respond. Does it freeze often? Seems frozen.", "Numbers": "106", "Date": "March 8, 2015"}, {"Content": "Despite updates can't log in App crashes and or refuses to log into Facebook or by email. Thus can't continue on other devices. App now stuck on log in screen then crashes trying to log in or create account.", "Numbers": "107", "Date": "March 16, 2015"}, {"Content": "Mines keep crashing before I can even use it.", "Numbers": "108", "Date": "March 26, 2015"}, {"Content": "Constant crashing on the note 4 I really wanted to use this app but it constantly crashes on my note 4", "Numbers": "109", "Date": "March 1, 2015"}, {"Content": "Unworkable Crash on startup. SGS3 , MIUI rom", "Numbers": "110", "Date": "February 24, 2015"}, {"Content": "Great App, but... Using Android 2.2.2 on a Motorola Triumph, after making about 10 habits to track the app consistently crashes when attempting to scroll down. Please fix! This app is wonderful, and it's a shame that this blocks my usage!", "Numbers": "111", "Date": "October 3, 2014"}, {"Content": "Has great potential but it kept crashing when I clicked the monthly view or the weekly view. Also reinstalled the app, and when I created my first habit it crashed again.", "Numbers": "112", "Date": "May 22, 2014"}, {"Content": "All the cutesy self-help nonsense crashes the app. Habitica might seem cluttered, but it's a hell of a lot more fun.", "Numbers": "113", "Date": "May 22, 2014"}, {"Content": "Worked for about a day and then just crashed repeatedly so have uninstalled. Disappointed as looked really good", "Numbers": "114", "Date": "May 16, 2014"}]