[{"Content": "The widget for countdowns has been acting up recently. It gets hung up and will freeze until you open the app again. Then it'll work for awhile, and then freeze again after a time.", "Numbers": "1", "Date": "January 31, 2019"}, {"Content": "Added an event successfully and the countdown started working as expected. However, whenever I try to add additional events the app immediately crashes. Will be uninstalling.", "Numbers": "2", "Date": "February 14, 2019"}, {"Content": "app works fine, but the home screen widgets don't auto update. they freeze on a time. disappointing", "Numbers": "3", "Date": "February 5, 2019"}, {"Content": "Widget freezes sometimes until you open the app itself (jumped from 55 to 39 days...)", "Numbers": "4", "Date": "February 14, 2019"}, {"Content": "It crash", "Numbers": "5", "Date": "February 7, 2019"}, {"Content": "Crashes", "Numbers": "6", "Date": "February 13, 2019"}, {"Content": "Nice looking but in have two issues. First, it doesn't appear to handle DST changes when tracking an event that is an specific hour over half a year away. I contacted the developer, but no response. Second, it constantly crashes on my Google Pixel 3 XL.", "Numbers": "7", "Date": "January 13, 2019"}, {"Content": "Crashes when opened", "Numbers": "8", "Date": "December 29, 2018"}, {"Content": "Crashes. I re-installed and it crashes randomly.", "Numbers": "9", "Date": "December 22, 2018"}, {"Content": "Great app for creating multiple countdowns. The online gallery has a good selection of background images. The app does sometime crash when creating new countdowns hence 4 stars instead of 5.", "Numbers": "10", "Date": "December 20, 2018"}, {"Content": "Loved it...but my phone recently updated to Pie...the widget now freezes occasionally and I have to click on it & apply changes again to get the new countdown...causes a lot of confusion...please fix. :)", "Numbers": "11", "Date": "December 17, 2018"}, {"Content": "Good app. Kept crashing", "Numbers": "12", "Date": "November 8, 2018"}, {"Content": "Crashes", "Numbers": "13", "Date": "October 21, 2018"}, {"Content": "Easy to use, doesn't crash phone and is great all around. Only downfall is that the time doesn't adjust when daylight savings ends (which isn't a problem for all). Other than that, I love it.", "Numbers": "14", "Date": "September 9, 2018"}, {"Content": "Great app and so helpful but I have a bug on my Huawei y6|| and that is when I wanna choose a picture from the gallery the window crash ..only the window not the app tho It make it harder to choose a picture .. but it's a good app that didn't bother me to keep using it .. good job", "Numbers": "15", "Date": "March 13, 2018"}, {"Content": "Time Counter In Widget Sometime Freeze..Need To Open The App To Make It Move Again..", "Numbers": "16", "Date": "June 30, 2018"}, {"Content": "The app keeps crashing, literally can't get past the first page. Useless.", "Numbers": "17", "Date": "July 28, 2018"}, {"Content": "Unusable, can't access the online background gallery, it crashes every time.", "Numbers": "18", "Date": "October 12, 2017"}, {"Content": "easy and seamless. very occasional crashes.", "Numbers": "19", "Date": "November 15, 2017"}, {"Content": "Does exactly what it says it does. Doesn't crash. My standards are low. It's free. Try it.", "Numbers": "20", "Date": "December 13, 2016"}, {"Content": "Pretty Good\nWould like to see more typefaces and while it occasionally & unexpectedly quits, it's a solid app and I have no issue supporting the developer with a buck. Pretty sure app programmer is working on the quiting issues as the program has sent multiple crash reports to him. Be interesting to see what new features come out in the future as the guy seems to have his head on straight. Buy It! You've wasted a buck already just reading my comments!", "Numbers": "21", "Date": "October 4, 2016"}, {"Content": "Love this app. It looks so beautiful too. *** However *** it crashes far too ofetn - it's crashed over half a dozen times in last couple of hours - can you sort this ?", "Numbers": "22", "Date": "April 5, 2016"}, {"Content": "Ok Was okay when working but then kept crashing...", "Numbers": "23", "Date": "July 17, 2016"}, {"Content": "Problem Widget not working! It just shows a freeze time!", "Numbers": "24", "Date": "September 30, 2015"}, {"Content": "The app is easy to use and nice to look at, but somehow the countdown freezes/doesn't update in real time, and only when I click on the widget on my phone (desktop screen) will it refresh and show the actual days left to an event. Not sure if I have to pay first before it updates correctly. All in all, 2 stars.", "Numbers": "25", "Date": "March 24, 2018"}, {"Content": "for the first time I had my phone freeze because of the download of this app. I love the way it looks & the ease of use but the constant add pop ups & the freezing issue I had to uninstall. Bummer!", "Numbers": "26", "Date": "February 20, 2019"}, {"Content": "Downloaded it and it repeatedly crashed two seconds into opening it. I tried reinstalling it but it immediately crashes.", "Numbers": "27", "Date": "January 17, 2019"}, {"Content": "Downloaded app, but everytime i try to open it -it keeps crashing. uninstalled it right away.", "Numbers": "28", "Date": "January 14, 2019"}, {"Content": "Unusable. Just installed and crashed every time I opened it.", "Numbers": "29", "Date": "January 6, 2019"}, {"Content": "app currently just crashes when i try to launch it 😭💔", "Numbers": "30", "Date": "January 25, 2019"}, {"Content": "entire system crashes upon opening app.", "Numbers": "31", "Date": "January 27, 2017"}, {"Content": "crashes every 2 seconds", "Numbers": "32", "Date": "February 2, 2019"}]