[{"Content": "The app really helped me get into meditation with the calming content and little incentives (streaks etc). However, lately it keeps crashing during the session which is heavily disruptive for my meditation! Also I feel that some sessions move too fast or that there isn't enough guidance, please consider labelling them according to their difficulty/experience needed.", "Numbers": "1", "Date": "February 25, 2019"}, {"Content": "I love this app. Really helps me relax and stay focused. Unfortunately as of late the app crashes very often. If there is some technical glitch, please resolve the issue. Thanks Sanjay", "Numbers": "2", "Date": "February 23, 2019"}, {"Content": "i used an app for few months, i like it a lot l. it great way to start mindfulness.I cancel my subscription as this app is crashing and switch off during a session so you don't how much time you mediate during specific session, technical issues. Beside that except finding focus it's all the same.", "Numbers": "3", "Date": "February 20, 2019"}, {"Content": "I really like the guided meditations but the app is really not working very well. Meditations just stop/crash out of nowhere and there's no way to restart where you left off. Also recently a phone call came through while I was in a session and there doesn't seem to be a way to block notifications while the sessions are playing. Not exactly a calming experience!", "Numbers": "4", "Date": "February 13, 2019"}, {"Content": "Do the free sessions, but don't subscribe. Get the Waking Up app instead. So many frequent issues: It freezes, it sometimes refuses to download (even when your internet is working fine), it will even trick you by continuing its timer even though the guiding voice has abandoned you. It's especially frustrating because the sessions have long periods of complete silence, so it takes awhile to know if something's wrong.", "Numbers": "5", "Date": "February 14, 2019"}, {"Content": "The app frequently crashes and overall feels a little clunky. I've been using the paid version for about a month and there have already been a few times when a mediation stops on me which is especially frustrating during a silent spot because you're while you're trying to focus and meditate you have to wonder if the app crapped out. It becomes the source of distracting thoughts you're trying to prevent. I stream audio through other music and podcast apps without issue. Not worth the $$$", "Numbers": "6", "Date": "February 8, 2019"}, {"Content": "Now a paid-up member, enjoying some of the swathes of new material (you'll never get through it in a year). Some bugs remain. Progress is sometimes slow to update. Navigation on the app is not organised identically to the browser, which is strange. Biggest issue at the moment however is crashing on the app, when one of those silences just starts to stretch to eternity, cracking open an eye to see the app has closed... not good. Hopefully these important improvements will be implemented soon and my score will reflect that. After sales service is individualised and good.", "Numbers": "7", "Date": "February 14, 2019"}, {"Content": "great app, but sometimes it crashes and i can't use it for days! is it my phone problem?", "Numbers": "8", "Date": "February 9, 2019"}, {"Content": "session keeps crashing, stopping midway. please fix", "Numbers": "9", "Date": "January 28, 2019"}, {"Content": "Love the app, the content, the concept. Only issue is that it's slightly buggy on my Android - every now and then a meditation will either irretrievably freeze or the sound will stop (while the timer keeps going). I've contacted support about this and they advise to uninstall and reinstall the app. I have a weekly routine of doing this now, which is not ideal. I've paid for the app (which I think on balance is good value) and I like it, so I'll keep it, but this is a real frustration!", "Numbers": "10", "Date": "January 29, 2019"}, {"Content": "Really like this app but can be unreliable. Recently the daily meditation would just hang and freeze, mid-meditation. Restarting sometimes fixes it but then it has happened again, unpredictably. Now when I go to use this app I feel incredibly anxious as I don't know if the mediation is still going or it's just frozen again. I keep forcing myself to use it though as this has cost me money....", "Numbers": "11", "Date": "January 31, 2019"}, {"Content": "sometimes it just disconnected in the middle of the session. happened too frequently recently Even after reinstalling it doesnt work. Still freezes into a session. Regret paying for yearly subscription. Don't fall for the same mistake.", "Numbers": "12", "Date": "February 2, 2019"}, {"Content": "Good content, but the app could use some optimisation. Especially regarding downloading packs. I've just had something \"queued\" to download all night, but it only started downloading on the train the next morning. It's laggy, it forgets what is downloaded and what is downloading, and is generally unreliable. Update: it gets worse! I gave up trying to download courses, and streamed them instead. I'm now stuck on a session that plays 20 secs of the intro and then crashes. Ironic frustration.", "Numbers": "13", "Date": "January 17, 2019"}, {"Content": "Love it when it works, but regularly crashes or silently closes mid-meditation on both my Pixel XL and OnePlus 6T. This unfortunately makes it unusable - just when you shouldn't be thinking, you have legitimate cause to wonder if it's crashed. Hope they can fix this. As it stands, a simple MP3 player with the recorded files would be better.", "Numbers": "14", "Date": "January 12, 2019"}, {"Content": "its an okay apo but keeps crashing on me. Said i had signed uo for a subscription when and took money from my account when i hadn't. To manu bugs. Dont use.", "Numbers": "15", "Date": "December 21, 2018"}, {"Content": "Keeps crashing on S8, can't continue past session 3, and can't skip it Update: problem solved", "Numbers": "16", "Date": "January 26, 2019"}, {"Content": "Perfect. Unlike the other app I got. Barely any bugs and I still don't understand why people add in membership. It's a waste of money. So remove bugs and the membership this app well be on the 5-star chart! And I can tell the coding was done perfectly. And all of the animation is so smooth. My friend is a good animator and she even said this is better then she'd ever get. The voice is relaxing. If I were to compare this to the other app I had gotten I were to say this is much better. Less bugs and glitching. And it didn't crash at all. It helps a lot. I hope this app gets a lot of 5 star reviews. And gets on the top 3 best apps. And if they were to fix the huge lag when you first enter the app that would be awesome! Plus, it's a review of what people think, so. Am I the only person with a huge lag when I enter the game?", "Numbers": "17", "Date": "December 25, 2018"}, {"Content": "Love the exercises. They really are amazing. Here's the issue - really bad crash problems. It crashes in the middle on a 15min session and I have to restart it. It really isn't a good UX honestly. And when your eyes are closed and since the guide pauses in between, you wouldnt even know it crashed. Please fix this.", "Numbers": "18", "Date": "January 24, 2019"}, {"Content": "I'm not saying that the new update is bad. Instead keep the library the way it is and separate the singles library and videos like the old version. This is one tip I can give all of you and test all the packs work properly and make sure the app doesn't crash. Thank you", "Numbers": "19", "Date": "January 19, 2019"}, {"Content": "bugs, bugs, bugs. Since two weeks ago, all the meditation programs are cut off in less than 2 or 3 mins. The app freezes and interrupts the flow of meditation. i already paid annual fee as a subscriber and I'm not happy with the service.", "Numbers": "20", "Date": "December 13, 2018"}, {"Content": "Nice content when works. But the app freezes a lot, meditations do not load, sessions get stuck and do not continue. I'm on the verge of abandoning the app because of these technical problems even though I still have 9 months of subscription to go.", "Numbers": "21", "Date": "December 14, 2018"}, {"Content": "Good app, but it's starting to crash frequently, especially the headspace daily meditation. Would be great if this is fixed. I'm currently on a Xiaomi Redmi Note 4 running Android 7", "Numbers": "22", "Date": "December 14, 2018"}, {"Content": "Some of the sessions crashes in the middle and some of the supporting videos do not play at all. Apart from this, I have gained a lot from this app and am thankful to its developers", "Numbers": "23", "Date": "December 12, 2018"}, {"Content": "Why does the app continually crash midway through a session, this is proturbing to the listener , and is a hassle to restart the exercise. Please give me direct feedback regarding this issue and how it can be fixed. As a paying customer, this is not acceptable.", "Numbers": "24", "Date": "December 21, 2018"}, {"Content": "Apart from occasional crashes, this app is life-changing. I highly recommend the subscription. It takes a few months to really start seeing change in yourself.", "Numbers": "25", "Date": "December 13, 2018"}, {"Content": "Content is good and helpful. The app keep crashing midway through a session on a regular basis. That started after subscribing. All the free content were working fine.", "Numbers": "26", "Date": "December 14, 2018"}, {"Content": "The app freezes very frequently. Almost everytime I play the recordings, I have to face the issue of the app freezing.", "Numbers": "27", "Date": "December 17, 2018"}, {"Content": "I loved doing the free 10 day basics course. I'd absolutely buy the subscription except there are so many reviews with y'all saying the meditations crash halfway through if they are over 10mins??! That's hugely disruptive and seems like a massive issue since the point is to get into a nice meditative state and you know...meditate? Lol And i hear it keeps screwing up lesson counters and goals?? Plus y'all are asking $12+ a month?? That is WAY too much to be asking for an app, especially one that doesnt work fully yet. Once you figure out the glitches and make your meditations actually play all the way through for people, I will reconsider subscribing because ive really loved the 10day basics course and i love the idea behind the app. Time to find a new FREE meditation app until then :)", "Numbers": "28", "Date": "December 15, 2018"}, {"Content": "It would be great to add an ability to download sleepcasts. And sometimes the app freezes :(", "Numbers": "29", "Date": "December 14, 2018"}, {"Content": "App keeps crashing after latest update (especially when trying to use sleep meditations). Only shows a blank black screen. Disappointing - especially since this is paid for! Edit: The apps works much better now after reinstalling everything.", "Numbers": "30", "Date": "November 17, 2018"}, {"Content": "Edit: the app keeps crashing and not loading. Uninstall and reinstall isn't working to fix it 🙁 Headspace is a godsend. Recommend the subscription for sure. The most recent update is so good!!! Thanks for constantly improving the service, making it more and more value for money.", "Numbers": "31", "Date": "December 5, 2018"}, {"Content": "I really like the meditation program and guide voice, but application is very unstable on my device. I have decent mobile phone with really good WiFi connection, despite of that fetching courses and videos tooks around 45sec, when fetching, application completely freezes and nothing is happening. Application startup time is also not acceptable for me. Content is great but application is clumsy. Fix it please and it will be the best on the market.", "Numbers": "32", "Date": "December 17, 2018"}, {"Content": "I love this app and have been using.iy for almost a year. Sadly I went to use it tonight and the latest update has killed it. I just get a black screen when I try to run any of the sessions and then it crashes. So disappointed. Please fix it! All fixed- thank you for such a quick response! Great customer service. I find the new menu system much slower and more difficult to find what I want, which is why I haven't given 5 stars.", "Numbers": "33", "Date": "December 11, 2018"}, {"Content": "The new interface has made it even more hard to find my any stuff. Also the app is constantly crashing after the new updates... Became a lot slow also... Pls try to fix it...", "Numbers": "34", "Date": "February 8, 2019"}, {"Content": "I like the new design, it's more organized. Looks like the crashes have been fixed in the latest update.", "Numbers": "35", "Date": "November 30, 2018"}, {"Content": "Reinstalling the app fixes the problem of the new version of the app crashing when accessing a course. Thanks CS team!", "Numbers": "36", "Date": "November 19, 2018"}, {"Content": "Kept crashing on my Xperia XZ Premium even when I wasn't using it. When I did try to use it, it crashed so much that I couldn't use it.", "Numbers": "37", "Date": "November 26, 2018"}, {"Content": "Crashes, forgets auth, makes it hard to get back to where you were, more frustration than meditation.", "Numbers": "38", "Date": "November 27, 2018"}, {"Content": "Slow to load. Crashed multiple times. Never got to start anything. Lol. Uninstalling", "Numbers": "39", "Date": "December 8, 2018"}, {"Content": "The app used to be great but recently it keeps crashing on my Pixel XL (Android 9). I can't even open it.", "Numbers": "40", "Date": "November 18, 2018"}, {"Content": "My app is crashing. Unabke to open the app. Pls hel0", "Numbers": "41", "Date": "December 8, 2018"}, {"Content": "Doesnt work anymore. Crashes on opening.", "Numbers": "42", "Date": "December 7, 2018"}, {"Content": "It is great... It's so relaxing that I ended up in 10 minutes instead of 5 lol... Great app... Despite the crashings at the start. Great app!", "Numbers": "43", "Date": "December 2, 2018"}, {"Content": "Like the meditations. App occassionally freezes", "Numbers": "44", "Date": "December 14, 2018"}, {"Content": "App crashes after opening it :(", "Numbers": "45", "Date": "December 9, 2018"}, {"Content": "Giving 4 star as I don't like the new design. Not been able to find the exercises I've been practicing. I do 2 exercises at one sitting but once I complete the first one which is self esteem I couldn't find the 2nd one (coping with craving) as I don't know in which section it belongs. You guys should add a search buttom to find any exercise by it's name. Another extreme issue is that App is getting crashed when I repeat the exercise. I've completed self esteem but when I click in any day of this course It gets crashed. Mine is Naughat version. It's very frustrating. Pls resolve it ASAP.", "Numbers": "46", "Date": "November 11, 2018"}, {"Content": "Navigating to Downloads in Settings crashes the app. Library is a failed feature. Time to move on. Courses are obscured behind many levels of interaction and painfully slow animations, plus downloaded singles can't be accessed while offline 🤯 The update adds further clutter to each screen, while solving none of the actual problems.", "Numbers": "47", "Date": "November 10, 2018"}, {"Content": "Would give five stars, but it has a crashing issue on the newest update!! Really disappointed because I love this app, but the new update doesn't let me meditate at all. The screen goes black and it crashes. Please fix!! UPDATE: I read some other reviews, and some said to just uninstall and reinstall, so I did. Working now!!! Only issue now is just that I'm a college student, in the process of finding another job, and it's so expensive to subscribe. Do you guys have a student discount or something? Thank you!!", "Numbers": "48", "Date": "December 12, 2018"}, {"Content": "I did love headspace, then they updated the app. Now it crashes Every time I try open the the kids meditations. Not very relaxing at all, now quite stressful to meditate with my daughter.", "Numbers": "49", "Date": "November 13, 2018"}, {"Content": "Latest update just crashes! Come on Headspace, it was an amazing app before this. Everyone working hard to reach their goals is going to be disappointed if this blip resets the goal streak!", "Numbers": "50", "Date": "November 10, 2018"}, {"Content": "Great app. It has become my daily treat. I've been having some issues after it was updated as crashes while listening. I would also add the option to resume the audio at any point as when you've been meditating for 15 minutes and it crashes, I don't want to listen again the 15 minutes I've already did.", "Numbers": "51", "Date": "November 16, 2018"}, {"Content": "Awesome up till now. Now the app crashes and I can't even use it. Very disappointing for a paid service. Hopefully this is fixed asap", "Numbers": "52", "Date": "November 15, 2018"}, {"Content": "Just downloaded this the other day and got to day three of the basics course. Sat down to use the app this evening after an update earlier today and now it keeps locking up and crashing. When I finally got it to start the session I asked for ten minutes and got three. Basically it's now unusable and not helping me to meditate.", "Numbers": "53", "Date": "November 19, 2018"}, {"Content": "I really liked the recent update but it freezes a lot while before never froze so I hope you fix that as soon as possible. Still love the app but nowadays it freezes a lot and I can't open those meditations. :(", "Numbers": "54", "Date": "November 12, 2018"}, {"Content": "I loved this app. But the newest update prevents me from being able to use it. I keep getting a black screen which leads to the app crashing on me. Please address!!", "Numbers": "55", "Date": "November 17, 2018"}, {"Content": "The content is amazing but the app is buggy The screen freezes and crashes all the time and the downloads often download only a part of the whole practice. You can't download it again, either. Frustrating, and ironic considering that meditation itself helps to give you perspective and calm. Maybe its just their way of testing you... However, considering i paid $77 for a year, i would really expect a far, far better experience. This is what I pay for Netflix!!", "Numbers": "56", "Date": "November 14, 2018"}, {"Content": "Loved it but ever since last update, it will freeze my phone every time I try to pick single short sessions to meditate with", "Numbers": "57", "Date": "November 11, 2018"}, {"Content": "Used to be very solid, the content is still great but frequent app stalling and crashes stymie an otherwise great idea, after 2-3 app crashes per day it will load....", "Numbers": "58", "Date": "November 13, 2018"}, {"Content": "It was amazing until the recent update but now it just crashes and won't load a single meditation, pointless!", "Numbers": "59", "Date": "November 11, 2018"}, {"Content": "I have used this app for years and love it. Since the latest update, it consistently crashes. Please provide a fix soon", "Numbers": "60", "Date": "November 17, 2018"}, {"Content": "Had the same issue as others with the latest update... app kept crashing and freezing. Uninstalled amd reinstalled, now works perfectly fine. I'm a happy user, have been subscribed since the start of the year. I like the new layout, easy to navigate and separates categories to make it easier to find what you're looking for as they continue to expand the content available. One thing I will say is that I don't love the voices of the newer guided sleepcasts... find them kinda creepy and unsettling lol To everyone upset about the new update not working: come on guys, app developers are only human, give them a chance to fix it! The app still deserves a high rating, only complaint is that it's very expensive. I can understand that a lot of people work very hard to bring us the huge variety of content and to make it as user-friendly as possible (keep up the good work 😊), however paying monthly = $240/year. Given that the app has over a million users and there are generally hundreds of thousands of people using it at any given time, i find it hard to believe that the subscription fee can't be reduced. Would be happy with $10-12 per month.", "Numbers": "61", "Date": "November 20, 2018"}, {"Content": "The new update crashes before starting any session. Never experienced before. I use this app daily", "Numbers": "62", "Date": "November 18, 2018"}, {"Content": "Got, paid for the subscription and not it's started crashing can't use and money wasted!", "Numbers": "63", "Date": "February 21, 2019"}, {"Content": "The new app crashes as soon as I try to play a meditation.", "Numbers": "64", "Date": "November 11, 2018"}, {"Content": "Uninstall first before updating, otherwise keep crashing all the Time", "Numbers": "65", "Date": "November 15, 2018"}, {"Content": "This rating would've been 5 star, however ever since the most recent update the app continuously crashes and doesn't complete the entire session (showing stats, the after message, etc.) Once rectified I'll bump this up to 5. I have a samsung s9", "Numbers": "66", "Date": "November 16, 2018"}, {"Content": "It's a good app, but with the recent update it's impossible to view your downloads without crashing the app", "Numbers": "67", "Date": "November 11, 2018"}, {"Content": "I've been using Headspace for about a year now, and it's really changed my life and my relationship to anxiety. I cannot recommend it more. I do hope they fix the bug that's been crashing the app when a meditation finishes though. That's gotten annoying.", "Numbers": "68", "Date": "November 19, 2018"}, {"Content": "This app is disaster for me. The app was crashing frequently, so I uninstalled and reinstalled the app but now it is not taking password and Everytime I try it says \"something went wrong\". Even I am not able to reset my password. 1edit- As suggested, I have written the issues to the mentioned mail id. I hope the issue will be resolved by sincerity the reply is made to the comment.", "Numbers": "69", "Date": "November 12, 2018"}, {"Content": "I'm done with this app. Have been using it for 2 years and experiencing technical issues on and off. Sessions crash, app won't start and progress doesn't get tracked (sometimes 5 times the same sequence). Now the app won't even start on my device anymore. Considering it's a paid premium I must stay I'm totally disappointed.", "Numbers": "70", "Date": "November 12, 2018"}, {"Content": "Alright. The experience is awesome. The packs are awesome. It's a bit expensive but you know what, it feels super premium and I really want to keep using it. The app UI is also perfect. But, and it's a big damn but, the app is so incredibly unstable that it sends me into fits of rage 2 secs after meditating. Hyperbole aside, the app crashes a lot. It can't seem to handle any sort of input where things have to change too much, like playing a session, or adding a pack to my packs, or changing the length of a session. Crashes instantly. Then I have to wait and start the app again. I hope you guys fix this. Headspace is awesome and I hope to keep using it.", "Numbers": "71", "Date": "November 15, 2018"}, {"Content": "My app keeps crashing. I have unloaded it and downloaded it multiple times as this was the advice given. I really enjoyed the first 5 sessions that ran smoothly and hope there is an update soon to fix the problem.", "Numbers": "72", "Date": "November 18, 2018"}, {"Content": "Crashes instantly for the past few days. I have a paid account - which is quite expensive. The lack of attention to this and other problems is concerning. I have had issues with crashes in the past too.", "Numbers": "73", "Date": "November 14, 2018"}, {"Content": "Meditations keep crashing. Fix it and it's worth five stars. Useless at the moment.", "Numbers": "74", "Date": "November 10, 2018"}, {"Content": "This app keeps crashing on me. Overall the UI/UX is amazing but after going through a free screens the app freezes and crashes.", "Numbers": "75", "Date": "November 12, 2018"}, {"Content": "Was fantastic until the latest update. Now I can't even open the app on my phone, it just keeps crashing and forcing close eveytime I do.", "Numbers": "76", "Date": "November 12, 2018"}, {"Content": "The content is excellent but the app is very buggy... Sometime it crashes on its own.", "Numbers": "77", "Date": "November 12, 2018"}, {"Content": "One of my favorite apps to use when it works. Nothing worse than trying to get into a calm space and having the app crash.", "Numbers": "78", "Date": "November 17, 2018"}, {"Content": "After the new update, can even open the app, it just keep crashing", "Numbers": "79", "Date": "November 15, 2018"}, {"Content": "Keeps on crashing on Redmi Note 4. To slow in downloading the lessons.", "Numbers": "80", "Date": "November 13, 2018"}, {"Content": "Keeps crashing each time.", "Numbers": "81", "Date": "November 21, 2018"}, {"Content": "Constantly crashing", "Numbers": "82", "Date": "November 9, 2018"}, {"Content": "Crashes incessantly", "Numbers": "83", "Date": "November 9, 2018"}, {"Content": "Amazing app. Use it daily and recommend to all. BUT please help! It keeps crashing part way though exercises recently? No other apps do this in my phone and it ruins the sessions... Not knowing if its running or crashed without warning, I miss the end of the mediation because the app has crashed! Thanks.", "Numbers": "84", "Date": "November 4, 2018"}, {"Content": "I really liked this app when I first used it, so much so that I purchased a subscription, which was not cheap. From the moment I spent my money, things went downhill. For the first week of my subscription, I couldn't access anything. Customer service was less than helpful. Since then, have had issues with meditations crashing, not working, or going silent after a few minutes. Customer service's response has been just reinstall the app. I wouldn't recommend you spend money on this unless you're up for a hassle.", "Numbers": "85", "Date": "October 26, 2018"}, {"Content": "Great content. A little expensive. Recently keeps crashing mid way through session. I'm not sure if the session is still going or it has crashed. Please fix.", "Numbers": "86", "Date": "November 19, 2018"}, {"Content": "Crashes after every single meditation. Won't let you install the new updated version. Garbage.", "Numbers": "87", "Date": "November 1, 2018"}, {"Content": "I love the app but it keep on crashing while playing the audio , need to close the app and reopen once again. Please fix this", "Numbers": "88", "Date": "November 9, 2018"}, {"Content": "It keeps hanging and crashing, please fix it.", "Numbers": "89", "Date": "November 6, 2018"}, {"Content": "I love the headspace content itself but the app is terrible. It crashes about 5 times a day when I try to use it and considering I'm trying to use it to relax, especially if I'm having a panic attack it just makes it worse if it keeps crashing. I feel the price is too high considering its just recordings, when services like Netflix and Spotify are the same price or cheaper sometimes for much more content", "Numbers": "90", "Date": "November 7, 2018"}, {"Content": "Great app when it works, it's crashed for me several times over the past 6 months, in spite of always installing the latest version.", "Numbers": "91", "Date": "October 27, 2018"}, {"Content": "I was trying to get a new oack and the app crashed. In fact, it crashes every single time i try to get a new pack no matter what it is. I was really looking forward to using this app but really?", "Numbers": "92", "Date": "November 6, 2018"}, {"Content": "I love this app and the concept but it does have a few bugs: 1. Stops playing session half way thru although still appears as \"playing\" in the notification bar. Once you click on it, the app crashes. 2. Downloads are not accessible offline, they just do no play. 3. Progress stops being tracked and a message appears that an error occured. Please look at fixing these few things, for those of us that do pay the subscription fee we expect the app to be maintened and basic functionality to be available. Thanks", "Numbers": "93", "Date": "November 13, 2018"}, {"Content": "I start to like it now. I often fell asleep while meditating tho. But I feel relax so I guess it's a good thing. Plus I like that I can avail monthly subscription with reasonable price, unlike in calm, that I have to go annual bcoz monthly is relatively expensive (like 3 mos of it equals one year). If only headspace can have the bg sound like in Calm bcoz that's nice. And if there will be no crashing. Bcoz if I accidentally clicked on sth and the downloading stop, then it will keep crashing at that point idk how to fix that. Anyway, it'll be 5 star if not for the crashing.", "Numbers": "94", "Date": "October 23, 2018"}, {"Content": "The service is great, but the app repeatedly hangs, crashes, freezes and overall works only when it wishes. It's honestly very frustrating to have an app that tries to get you to use it every day but doesn't actually work every day.", "Numbers": "95", "Date": "October 21, 2018"}, {"Content": "There are many bugs to be fixed such as app is crashing many time in between which is real frustrating for moment", "Numbers": "96", "Date": "October 12, 2018"}, {"Content": "It's a good concept. BUT WHY DOES THE APP KEEP CRASHING?", "Numbers": "97", "Date": "October 14, 2018"}, {"Content": "The app is good but now I cannot hear the 3rd basic recording because when the 2nd one finishes it crashes and does not unlock the 3rd one", "Numbers": "98", "Date": "October 11, 2018"}, {"Content": "Love it but the app keeps crashing Durning the meditation", "Numbers": "99", "Date": "October 10, 2018"}, {"Content": "Really enjoyed the first 10 basics sessions but I can't believe you have to pay £10 a month after that. I don't mind paying for useful content but that's asking a bit too much. Also it constantly crashes and the guy has an unusual cadence with his speech.", "Numbers": "100", "Date": "October 18, 2018"}, {"Content": "The app has crashed quite a few times now during an exercise, in the quiet parts. I guess its ok in that I get extra time to relax... But I also get a bit anxious wondering if it's crashed or not and it kinda kills the experience. The plus side though is that this app has changed my life, I couldn't recommend it enough.", "Numbers": "101", "Date": "October 2, 2018"}, {"Content": "Unfortunately the app crashes during the launch logo or after tapping the log in / sign up buttons. I heard it's a great apo so I am not giving it a star because of that.", "Numbers": "102", "Date": "September 23, 2018"}, {"Content": "Really cute animations and a good idea but it keeps crashing. I downloaded it for use while I'm traveling and three times it won't operate due to crash. Very disappointing.", "Numbers": "103", "Date": "September 26, 2018"}, {"Content": "It really helps me in daily life. But the frequent, mid session crashes makes the meditation a little longer than I plan for.", "Numbers": "104", "Date": "September 21, 2018"}, {"Content": "I like the app but it crashes everytime I try to check my usage history after clicking on my name. This is the second time I have reported the issue along with sending system logs. I use Samsung Galaxy C9 Pro having android OS 7.1.1. Can you help in fixing this?", "Numbers": "105", "Date": "September 19, 2018"}, {"Content": "Love the app, but sometimes it crashes during meditation. Leaving you there for an indefinite amount of time.", "Numbers": "106", "Date": "October 15, 2018"}, {"Content": "Great content, but app recently buggy. For developers... Bug 1: Crashes on trying to open my profile via rightmost button on bottom-of-screen option bar. Bug 2: Using everyday headspace, it will sometimes play 3-minute session even if I've scrolled down to, say, the 10-minute one (which shows up as having been downloaded). (Phone is Huawei P10, Android version 7.0.)", "Numbers": "107", "Date": "November 13, 2018"}, {"Content": "Freat app apart from crashes in the account menu which makes it hard to keep updated and on track with your run streak. 4/5 for that reason.", "Numbers": "108", "Date": "September 20, 2018"}, {"Content": "It doesn't work anymore, audio vanish after 2 3 minutes and and crashes every other second and support option doesn't take to webpage, is there anyone looking at complaints ???", "Numbers": "109", "Date": "October 4, 2018"}, {"Content": "I like the app but it has a tendency to crash and just...stop... during the quiet part of the meditation. So you just keep going. It's actually quite difficult - and a bit stressful - to focus when you're constantly wondering if the guided meditation is gone.", "Numbers": "110", "Date": "September 27, 2018"}, {"Content": "I love the app ever since I first subscribed, it's the best meditation app I tried, but in the past few days I literally can't even open it, it starts loading and crashes immediately or let's me start a meditation and then crashes. I feel like I'm wasting my money as in this form the app is literally useless.", "Numbers": "111", "Date": "October 6, 2018"}, {"Content": "When I first got the app it was really good and it helped me to understand and get a sort of routine to my meditation but over the past couple weeks or so the app has been crashing getting stuck at like 4 mins. I was advised to use the mobile browser site and that just crashes on me also... It makes it very difficult to meditate because your mind wonders whether or not the app or session is working. I've found my self setting a personal timer in the background then skipping through the session to get it logged once my timer has gone off. I don't want to stop using headspace but at the minute it's more of a hindrance than anything else which is unfortunate as it started so well for me. If the app or mobile browser is working for you then great you won't be disappointed but if your like me then you might have to find an alternative.", "Numbers": "112", "Date": "October 7, 2018"}, {"Content": "App keeps crashing on Huawei P20 Pro. Also doesn't play when the screen is locked", "Numbers": "113", "Date": "September 29, 2018"}, {"Content": "It is awesome. But it stays crashed please fix that bug?", "Numbers": "114", "Date": "October 1, 2018"}, {"Content": "Great for a while, but now it seems to be buggy. Constantly doesn't save progress forcing me to redo session when mid way into a pack or simply freezes. I paid for a premium product Headspace-- I expect this to be sorted out quickly.", "Numbers": "115", "Date": "September 11, 2018"}, {"Content": "It's good, it changes my behaviour with my own life. But it still has some bugs, like crashes when downloading or the download never complete because it doesn't start. Season 7 from distractions is crashing all the time", "Numbers": "116", "Date": "September 17, 2018"}, {"Content": "Good concept ruined by an unstable interface and frequent crashes. Disappointing.", "Numbers": "117", "Date": "September 24, 2018"}, {"Content": "I absolutely love the Headspace content and animation. However, it's very buggy. The app freezes often when I start a session, and when I change my time length, it reverts back to the previous selection. In other words if I change from 15 mins to 20 mins, I'll get a 15 mins session and the next time I meditate it'll play a 20 mins session. And occasionally when Headspace freezes, my session won't be recorded. I am using an LG G4 which is running Android 6.0.", "Numbers": "118", "Date": "September 1, 2018"}, {"Content": "I really like the product, but the app is glitchy. It doesn't download the contents for offline use (as advertised) and freezes a lot.", "Numbers": "119", "Date": "August 29, 2018"}, {"Content": "Used to love it. Now it's crashing all the time. Tried uninstalling and reinstalling and it is still crashing. Please fix it.", "Numbers": "120", "Date": "September 5, 2018"}, {"Content": "Great app but often freezes ;(", "Numbers": "121", "Date": "September 2, 2018"}, {"Content": "The app keeps crashing halfway through a meditation. And when I'm doing a pack, it continually doesn't register that I've already listened to one part, so I end up listening to say, part 2 three times to the end before part 3 becomes available. The meditations are good but considering the cost, I expect the app to actually work.", "Numbers": "122", "Date": "August 27, 2018"}, {"Content": "The app simply freezes whenever I try to start my 6th beginner session. I was loving it, but I can't use it. What a pity.", "Numbers": "123", "Date": "August 21, 2018"}, {"Content": "Paid for a year subscription but it won't let me actually do any meditations. Just freezes on the gets to the \"downloading\" section and stops.", "Numbers": "124", "Date": "August 12, 2018"}, {"Content": "It crashes before each meditation session! Please fix this. My phone is okay so it has to be the app.", "Numbers": "125", "Date": "August 23, 2018"}, {"Content": "I love this app, yes you do have to pay a subscription if you want to have unlimited use of all its resources but what a lot of resources there are and as far as I'm concerned its money well spent. I even tried lots of meditation and relaxation techniques over the past 15 years particularly in relation to pain management, even self hypnosis to try to get a handle on the life changing neuro pain condition I was left with after a motorway car crash; some helped at times but the Headspace pain pack not only helps during flare ups (the SOS pain single is a great extra aid) but on an everyday basis. Nothing before has moved my pain into the background and for that alone I couldn't recommend it more but I've also had success with the sleep pack and singles, the waking up ones, kindness/self compassion and grief as well as working through the three basics packs which are fantastic. If you're not sure, give it a go...you won't regret it!", "Numbers": "126", "Date": "August 13, 2018"}, {"Content": "The sound and illustrations on the app keep crashing.", "Numbers": "127", "Date": "August 12, 2018"}, {"Content": "There are some great aspects to the way Andy explains meditation principles. I find the variety to be limited, as most of the packs use only a couple of strategies. I also find the app a little buggy as it crashes midrecording regularly and, because there are long silences, I often have to check and see if the meditation is still running, which isn't conducive of fully immersing myself into meditation. I've found other apps much better. The caveat is I have been meditating for over a decade and am looking for an app to help me get back into a consistent practice, so it might just not be the right fit for me.", "Numbers": "128", "Date": "July 25, 2018"}, {"Content": "there were a lot of bugs. the videos wouldnt play, the app itself would freeze or the guided meditations just suddenly had no sound. hopefully, these are temporary things because other than the errors, everything else was super helpful but the bugs just really ruined the experience", "Numbers": "129", "Date": "July 30, 2018"}, {"Content": "Keep crashing in every session in my phone (vivo v5s)", "Numbers": "130", "Date": "July 14, 2018"}, {"Content": "Amazing app. I've suffered from a lot of stressful life events over the last 10 years, long term illness and death of a parent, serious car crash, death of 2 very close friends, house move, major surgery, it goes on.... These have led to an autoimmune disease that is now having a long term physical impact on my body, causing chronic pain, and ultimately my mind. I have been doing the pain meditation for 10 days and can really feel a difference, not only in how I respond to the pain (which hasn't gone), but also in how I respond to stressful/irritating situations in general. I am able to ignore things that would normally irk me. I would recommend this app to anyone who is struggling, whatever the cause of that struggle may be.", "Numbers": "131", "Date": "September 4, 2018"}, {"Content": "The app is good in concept and usefulness but it crashes on my phone after every session that it runs... Come on this is the basic functionality, you can't get that wrong....Please update the fix.", "Numbers": "132", "Date": "July 20, 2018"}, {"Content": "Usually love headspace but ever since I upgraded my phone the app keeps crashing. I've uninstalled and reinstalled and still nothing. Please fix!", "Numbers": "133", "Date": "July 18, 2018"}, {"Content": "Crashes frequently on launch", "Numbers": "134", "Date": "June 17, 2018"}, {"Content": "I really like this app. I was into meditation before, but never stuck to it regularly. Then comes along this app as a sponsor of my favorite Podcast (JennaJulien) and I had to try it to support them! I love the guys voice, super easy to follow and I love the notifications or alarms you can set. Just when I feel down or dragged by the day, all of a sudden the alarm comes on (usually an hour or two before work ends) and I take a 10-15 min break and feel MUCH better and motivated. BUT THE APP KEEPS CRASHING, please fix soon!", "Numbers": "135", "Date": "July 5, 2018"}, {"Content": "This app is great. I'm not one who would usually be open to meditation, but I thought I'd give it a go. On day 5 so far, and I'm really enjoying it. My issues with this app are very similar to the issues others are experiencing. It's crashed a few times, but not a great deal. My main issue is the pricing. Only two options? Monthly and annually? I like it, but I don't know if its worth $150 and $20 a month is also very steep. $100 a year seems much more reasonable, and there should be a quarterly option at say $45.", "Numbers": "136", "Date": "June 30, 2018"}, {"Content": "The meditation has got stuck half way through twice now (I have used it 3 times) not sure if it is related to my screen turning off or something. Nollf that is what other people are referring to as a crash. Either way it cannot be restarted and you have to start it again. Not very meditative! Also was surprised how expensive the paid version was!", "Numbers": "137", "Date": "July 10, 2018"}, {"Content": "Love the app! But once I finished the 10 day free trial it keeps crashing and that's a lot of money to put down if it won't work. Fix it, offer a monthly or per pack option and I'll be back.", "Numbers": "138", "Date": "June 17, 2018"}, {"Content": "Got the app a few days ago and I'm really enjoying learning the basics of meditation, it's a breath of fresh air and I like the simplicity of headspace. Unfortunately, similar to many others I am experiencing nonstop crashing with the app. Was on the fence about subscribing but after reading reviews I'm seeing that nothing is being done to resolve this issue and for an already overpriced app I will not be subscribing and don't think others should until the bugs are fixed and the subscription fee is reduced drastically!", "Numbers": "139", "Date": "June 17, 2018"}, {"Content": "The app crashes an awful lot on my brand new htc phone. I can't open a notification without the app crashing over and over again. Occasionally lessons will be interrupted or cut short by the app crashing. Otherwise I've found it to be a very useful app. Good introduction to meditation with a lovely voice coach.", "Numbers": "140", "Date": "June 19, 2018"}, {"Content": "The app has a good variety of packs, although they are repetitive by making you start each one at the beginning without giving you a chance to say you're experienced at meditating. I mean really, do the full basics pack and then start pain management and it wants to reteach me the body scan and focused breathing? I was expecting something more... advanced I guess. The reason for the low rating is since the app updated it keeps crashing after 30 seconds of being open. And for the price I'm paying monthly, that's just unacceptable.", "Numbers": "141", "Date": "June 17, 2018"}, {"Content": "This is a really good app and in my case I found it just at the right time when is got a critical point of stress and anxiety levels. After a couple of days I was called than I've been in years. After a few weeks I feel like a new man and thus had become part of my daily regimen and translates so well into the rest of my day. EDIT: App has become very unstable, crashing more often than not, can take 5 or 6 tries before getting a meditation without it crashing.", "Numbers": "142", "Date": "July 3, 2018"}, {"Content": "This app was perfect for me before it started crashing constantly. After I completed my first 10 basic lessons the app constantly crashes! I believe the subscription is outrageously priced and should be cut in half if not more. Not many people are going to pay $13 a month or $100 a year especially for the people on the fence about meditation", "Numbers": "143", "Date": "June 25, 2018"}, {"Content": "I enjoy the guided sessions. They're great if you're a beginner to meditation. Can't enjoy them while the app keeps crashing a few seconds after opening it though, specially a day after I paid to get premium. Unacceptable.", "Numbers": "144", "Date": "June 21, 2018"}, {"Content": "This app will not stop crashing. Sometimes I can actually make it to the meditation, sometimes it crashes as soon as it opens. I can't scroll to see any of the other options without it crashing! So frustrating!!!", "Numbers": "145", "Date": "June 25, 2018"}, {"Content": "This was a great app until it wasn't. Just signed up. Every time I finish a meditation it CRASHES and any effects it was supposed to bring...gone. Terrible. I want to love this app. Needs fixing.", "Numbers": "146", "Date": "June 26, 2018"}, {"Content": "Great app, love it. The last update crashes a lot for me though, and usually on the main start screen. The meditation part works great anyway, nice work.", "Numbers": "147", "Date": "June 18, 2018"}, {"Content": "Awesome app, my meditation game is coming back into focus... But the app keeps crashing lately... Not cool in the middle of a meditation.", "Numbers": "148", "Date": "June 17, 2018"}, {"Content": "Paid for a subscription and it crashes non-stop. Tried uninstall/reboot/reinstall and still the same. Emailed as suggested but no response.", "Numbers": "149", "Date": "June 23, 2018"}, {"Content": "Great sessions. unfortunately the app crashes after every run.", "Numbers": "150", "Date": "June 17, 2018"}, {"Content": "Crashes all the time on my note 8 even after reinstall.", "Numbers": "151", "Date": "June 20, 2018"}, {"Content": "Great app, subscription is too expensive tho, playback freezes when app is minimized", "Numbers": "152", "Date": "July 6, 2018"}, {"Content": "It just crashes all the time", "Numbers": "153", "Date": "June 22, 2017"}, {"Content": "Frequent crashes.", "Numbers": "154", "Date": "July 8, 2018"}, {"Content": "App crashes repeatedly. You often see a \"Fetching subscriptions\" error, leaving no choice but to reinstall it. Which I did multiple times. But incredibly annoying. I liked it otherwise and might reinstall it at a later time when they release a more stable build.", "Numbers": "155", "Date": "June 13, 2018"}, {"Content": "This app doesn't respond. It crashes. It is also slow in loading sessions. Instead of calming one down, this app is becoming a pain in the ass before every meditation session.", "Numbers": "156", "Date": "June 28, 2018"}, {"Content": "Love the idea and used to be great but the new version is very slow and buggy especially trying to download things it often crashes/ fails even though full signal - frustrating!", "Numbers": "157", "Date": "June 29, 2018"}, {"Content": "The app crashes every time I use it, after a while I open my phone and its just gone!", "Numbers": "158", "Date": "July 8, 2018"}, {"Content": "love this app, but it keeps crashing half way through 10 minute meditations. please fix this", "Numbers": "159", "Date": "June 20, 2018"}, {"Content": "It's not opening. Getting crashed every time I'm opening it. Even not able to sign in😠", "Numbers": "160", "Date": "June 27, 2018"}, {"Content": "Apps crashesh I'm pro user pls improve app", "Numbers": "161", "Date": "June 21, 2018"}, {"Content": "The app has a simple and effective interface and guides very well. One negative though is that the app shuts / crashes sometimes while you meditate so you might not realize about this at all until you open your eyes yourself. This also breaks your streak and consistency. Hope headspace fixes this glitch as the app is great to use otherwise.", "Numbers": "162", "Date": "June 7, 2018"}, {"Content": "I've been using Headspace Pro for about 2 months and the experience has been worth every penny! Although I've had some problems with the app earlier and it still crashes when I switch from other tabs to the Home tab, it has been an incredible tool for me (I wonder if the team has been receiving the crash reports that I send everytime from the popup.) For the people who have been complaining about the cost involved - I got a year's subscription for roughly 900 INR (~14 USD) which is nice and affordable for me. Keep up the work team! :)", "Numbers": "163", "Date": "June 7, 2018"}, {"Content": "The app is great but it crashes too much to even finish one meditation. Headspace team said they'll look into it with zero follow up after that. Great work guys", "Numbers": "164", "Date": "June 6, 2018"}, {"Content": "Headspace is amazing. The app is not. The app keeps crashing in the middle of my sessions and its pretty frustrating. Custumer service told me that the android vers of the app has been reported to havr bugs and that theyre working on it. That meanwhile i can use their page instead.", "Numbers": "165", "Date": "June 9, 2018"}, {"Content": "Its has been the best meditation I have done but today this app keeps closing quiting and I have to keep uninstalling and reinstalling cause it crashes before gets a chance to open that why only gave 3 stars", "Numbers": "166", "Date": "June 23, 2018"}, {"Content": "Crashes very often, videos don't play, slow to load the sessions, huge bugs, truly needs improvements", "Numbers": "167", "Date": "June 8, 2018"}, {"Content": "Really loved this app for Day one, but now it won't let me load day two and it crashes a lot when I try to load my personal section, and it won't let me do day two of meditation", "Numbers": "168", "Date": "June 9, 2018"}, {"Content": "Really disappointed with the app. It crashes as soon as I open it. It's really annoying and i have to use the website to most of the time", "Numbers": "169", "Date": "June 10, 2018"}, {"Content": "Just installed and it crashed . 😑", "Numbers": "170", "Date": "May 22, 2018"}, {"Content": "Crashed", "Numbers": "171", "Date": "May 28, 2018"}, {"Content": "What is going on? When ever I try to make an account the app just freeze on \"Creating your account\" icon. Nothing happens. I re-downloaded and reinstalled the app and Now it says my email already have a headspace account and then it again freeze on \"Creating your account\"... What should I do? Plz help", "Numbers": "172", "Date": "May 24, 2018"}, {"Content": "I loved this app until it started crashing and going blank, waiting on a reply from customer service as I haven't been able to use it for a few day's now 😔 hope it gets sorted soon or I'm going to have cancel my subscription 😔 update : since my last rant the app has got worse and I had to cancel my subscription 😔 still nothing is working on the app so going to have to delete the app, very disappointed didn't even get my money's worth this month as nothing worked 👎", "Numbers": "173", "Date": "May 30, 2018"}, {"Content": "Used to be perfect. Since app updates app is slow and buggy. Downloads for offline use crash the app. Headspace tried to add too many features. Simple was best", "Numbers": "174", "Date": "May 28, 2018"}, {"Content": "I like the content but the app is barely usable on my s6 edge. Lots of non headspace crashes in the ui", "Numbers": "175", "Date": "May 25, 2018"}, {"Content": "Great app. Would be five star if it didn't randomly crash during mediation. End up sitting there for an extra 10 minutes before you realise the app died again.", "Numbers": "176", "Date": "June 1, 2018"}, {"Content": "Love the meditation sessions and, for me, they are really helping, however it crashes everytime after I've downloaded sessions to listen to offline. Have sent feedback and hoping they will fix this seeing as I've paid subscription....", "Numbers": "177", "Date": "May 26, 2018"}, {"Content": "The app is wonderful, but it crashes every time I load an audio, so I need to re open it", "Numbers": "178", "Date": "May 29, 2018"}, {"Content": "Would be better if it didn't crash so damn much. Mostly mad because i paid for a year long subscription A.D. its sub par. Would also like to know what \"bug\" got deleted. I updated the app and now it shows me cool features i could use but then it disappeares. So much for fixing that \"bug\" guys.", "Numbers": "179", "Date": "May 9, 2018"}, {"Content": "It is great, but the app crashes when a video stops playing. And sometimes it crashes before a video starts playing. Probably it happens when you have a low internet connection.", "Numbers": "180", "Date": "May 6, 2018"}, {"Content": "Great App - was having difficulty with app crashing and not allowing me to vary the time for meditating but latest update has fixed it, thanks.", "Numbers": "181", "Date": "May 11, 2018"}, {"Content": "Very good, but these last 3 days the app crash everytime I meditate, pleas3 fix it, thanks", "Numbers": "182", "Date": "May 8, 2018"}, {"Content": "I was riding out the trails that come with the app to see if maybe I can put a price on something I can do on my own. But after 8 days and an update, I can no longer do any meditation sessions. The app crashes immediately after I try to start one of the sessions. And I tried a bunch of the different free ones and without fail it crashes. Now it's just an app taking up space on my phone. Will update if anything changes. Which I'm hoping for.", "Numbers": "183", "Date": "May 22, 2018"}, {"Content": "app is unusable after new update. crashes every time it goes to load an exercise, and the duration picker just goes to the longest one on it's own for some reason and doesn't let you pick one yourself. back to 5 stars once fixed", "Numbers": "184", "Date": "May 13, 2018"}, {"Content": "I really like the app, but sometimes the app shuts down during a meditation. This is quite annoying since I never know whether there is a long silence or that the app has crashed edit: disabled battery optimization for the app, which seems to work! Overall best app for meditation I encountered!", "Numbers": "185", "Date": "May 15, 2018"}, {"Content": "2/28/18 App crashes every time I try to open a meditation. 3/2/18 Support was quick and fixed the issue, I love this app, been using it for almost a year and I'll continue to use it. The sleep mediation is my favorite.", "Numbers": "186", "Date": "May 29, 2018"}, {"Content": "I really like this app, but unfortunately since last update it is impossible to start any exercise. It scrolls down to the longest duration and crashes. Hope you'll fix it soon. Thanks again.", "Numbers": "187", "Date": "May 14, 2018"}, {"Content": "Lost my run streak! I've just updated it which I hope fixes the crashing. I lost my 70+ streak because it crashed and I didn't realise it hadn't recorded the session 😑", "Numbers": "188", "Date": "May 4, 2018"}, {"Content": "I was enjoying it for some time but now I can't open any meditation sessions without the app crashing... Cancelling my subscription ☹️", "Numbers": "189", "Date": "May 6, 2018"}, {"Content": "What happens when a subscription app that focuses on mindfulness continually crashes preventing the pursuit of mindfulness by swapping it for mind numbing frustrating?", "Numbers": "190", "Date": "May 4, 2018"}, {"Content": "App is continuously crashing, can't start even from basics, had too much expectations from the app, but everything just ruined in a moment.", "Numbers": "191", "Date": "May 4, 2018"}, {"Content": "The new update is crashing the app everytime just before the lesson starts", "Numbers": "192", "Date": "May 3, 2018"}, {"Content": "So I have loved the app, but since the last update it crashed the second I try to start a meditation.", "Numbers": "193", "Date": "October 29, 2018"}, {"Content": "Its a very great app and it helps me a lot but it crashed when I needed it the most :/ (Reference not intended)", "Numbers": "194", "Date": "October 2, 2018"}, {"Content": "Liked the app till it started crashing all the time. Not able to move forward.", "Numbers": "195", "Date": "April 21, 2018"}, {"Content": "Crashes everytime I try to do a new day", "Numbers": "196", "Date": "April 26, 2018"}, {"Content": "Thank you for fixing the crashing problem !", "Numbers": "197", "Date": "May 3, 2018"}, {"Content": "App crashes on my phone on the first sessions", "Numbers": "198", "Date": "April 21, 2018"}, {"Content": "App keeps crashing. Can do longer start any audio.", "Numbers": "199", "Date": "April 22, 2018"}, {"Content": "constant crashing, can't use it", "Numbers": "200", "Date": "April 22, 2018"}, {"Content": "Amazing but crashes", "Numbers": "201", "Date": "April 19, 2018"}, {"Content": "The idea is nice and it helps you relax. But the app is so broken. Most of the time it just freezes. Refuses to play videos and tells you to try again later and it's been doing that for 2 weeks. You can't change the length of the tracks because thr option is just broken. Fix the app please.", "Numbers": "202", "Date": "May 1, 2018"}, {"Content": "Crashes on my redmi note 4 . Please improve stability .", "Numbers": "203", "Date": "April 9, 2018"}, {"Content": "Love this app and have been using for ages however later updates are buggy. Now it crashes continuously, if I reinstall it works for a few days then dies again. However when working it is amazing and if the crashing gets fixed will definitely renew my subscription.", "Numbers": "204", "Date": "April 4, 2018"}, {"Content": "When the app actually works, it's great. But it never, ever works for me before crashing multiple times. I have a modern Android phone with the newest OS, and I've uninstalled and reinstalled multiple times. I want to subscribe, but I hate preceding each meditation session with intense frustration with the app.", "Numbers": "205", "Date": "April 12, 2018"}, {"Content": "I love this app, paid for the year. Yesterday it crashed breaking my streak and now it won't work. I uninstalled yesterday, reinstalling it. But still won't download the packs. So I can't use. Either fix or refund me!", "Numbers": "206", "Date": "April 9, 2018"}, {"Content": "I would like to share my personal experience with this app. I started out like many of you doing one or two 10 minute lessons a day, I quickly progressed and my meditations became deeper and deeper. One day during the silence of a guided meditation the app must have crashed. I was stuck in a deep trance without the voice to bring me back for what felt like only a few minutes, the next thing I remember I wake up in the year 2049 with total spiritual enlightenment and the knowledge of time travel. After spreading my wisdom and fixing the evils of the future I decided I must return to the year 2018 to write this review. 10/10 recommend this app", "Numbers": "207", "Date": "April 12, 2018"}, {"Content": "Better if it stops crashing or stopping on my HTC M7. I got to almost a month of constant daily meditation and today it's dialled me back to 1 day. I guess eventually that won't matter to me, it will bother people new to it though, trying to track progress. Otherwise, it's working for me.", "Numbers": "208", "Date": "April 6, 2018"}, {"Content": "Crashes every time in the middle of pro sessions. Emailed support and they told me to use the browser which does work, but that renders this App useless. Its been this way for months now. Other apps manage to play audio, so why can't Headspace?", "Numbers": "209", "Date": "April 5, 2018"}, {"Content": "The app keeps crashing (closes or stops playing) during the sessions whenever a notification comes in other apps.", "Numbers": "210", "Date": "April 10, 2018"}, {"Content": "I loved the app, but having re-installing (twice) it keeps crashing during a session :(", "Numbers": "211", "Date": "July 3, 2018"}, {"Content": "I used this app before and really enjoyed it however on my galaxy s8 it crashes whenever I touch anything in the app", "Numbers": "212", "Date": "April 17, 2018"}, {"Content": "Just keeps crashing when trying to sign up.", "Numbers": "213", "Date": "March 27, 2018"}, {"Content": "Great basis to start meditation with a lovely voice and cute cartoons to capture themes. Not 5 stars as it seems to have developed a bug as a promot re. change the meditation duration opens up then freezes and I have to reload the app...", "Numbers": "214", "Date": "March 20, 2018"}, {"Content": "Good app but it crashes frequently during sessions and the whole point of continuously focusing is lost, this is really annoying, please fix this.", "Numbers": "215", "Date": "March 23, 2018"}, {"Content": "The app keeps crashing even before getting to starting page!!!!", "Numbers": "216", "Date": "March 27, 2018"}, {"Content": "Crashes in MI phone help", "Numbers": "217", "Date": "March 19, 2018"}, {"Content": "I am a paid subscriber and I am reaching out to you again. Hope this gets read: The app crashes everytime, when I try to download my second pack for offline use. Then the app then keeps on crashing everytime i try to start it. The only solution is to uninstall the app and install it again which is not a solution because when i try to download the second pack again, the cycle keeps repeating. Technical team, please get this fixed om priority.", "Numbers": "218", "Date": "March 14, 2018"}, {"Content": "Headspace is amazing. The app works amazingly on iOS. On Android? It's almost impossible to use. It crashes, freezes and take down the phone with it. It's almost a burden to use it. I'm sure there'll a version that'll work better but that's not now.", "Numbers": "219", "Date": "March 16, 2018"}, {"Content": "I love how easy this is to use and have suggested people download it. It has started to freeze lately. Nothing will work on the entire page. I'm still going to keep trying though because I love out so much.", "Numbers": "220", "Date": "March 17, 2018"}, {"Content": "App is crashing multiple times. Please do fix it as it breaks the concentration while meditating. Otherwise a great way for meditation!", "Numbers": "221", "Date": "March 19, 2018"}, {"Content": "I can't recommend this to anyone I know. It's not exactly nice to use thanks to being told on every single screen what I CAN'T have. I also despise seeing \"downloading\" on every screen. This is the opposite of what I want. I would greatly prefer instead to pick themes and have them download automatically so I don't need a connection when I do listen to them. I want a clear indication of when a recording is over. I don't want the screen to time out and lock while I'm watching. Either on or off. I don't want a million buttons and tiny miniscule little arrows and X's to tap on to navigate. The voice is plenty soothing and nice but the app isn't. It's just awkward and cluttered. You probably think it's easy because it's in categories but that's just clutter because it's burying things under layers upon layers. I went my recordings ready to go immediately, then my optional stuff beneath it. No hassle. I have no trouble paying for things but I will not be buying some subscription to an app that holds 25 carrots in front of me promising them to be so healthy and good for me then saying \"but you can't have them.\" (I also had the app crash 3 times already 😐)", "Numbers": "222", "Date": "March 17, 2018"}, {"Content": "Sometimes the meditations freeze, resulting in the opposite of the intended effect.", "Numbers": "223", "Date": "March 9, 2018"}, {"Content": "Meditations are perfect, app itself crashes every time I try to open it so I can't access those great meditations. Could stand to lower the price a bit too", "Numbers": "224", "Date": "March 4, 2018"}, {"Content": "Crashes immediately after starting. Nexus 6P running Android 8.", "Numbers": "225", "Date": "February 27, 2018"}, {"Content": "Love the app. Only problem is that when i click on to go to my profile (down right) the app crashes.", "Numbers": "226", "Date": "February 20, 2018"}, {"Content": "Great app. However frequently crashing, doesn't start once all the sessions are downloaded for offline use.", "Numbers": "227", "Date": "February 10, 2018"}, {"Content": "App crashes a lot and often has problem logging in which for a relaxation app, is a shame!", "Numbers": "228", "Date": "February 15, 2018"}, {"Content": "App crashes too often.", "Numbers": "229", "Date": "February 16, 2018"}, {"Content": "While the idea behind it is great I find this app to be super buggy. Pretty much everyday I have to struggle for several minutes to get it to work. The sessions won't load, it gets stuck and I have to restart it frequently. Very often it just crashes, this has happened to me while meditating so there was no way to know. Headspace you need to address this things, for me it's close to being unusable.", "Numbers": "230", "Date": "February 14, 2018"}, {"Content": "The contents is just amazing and life changing. But! The app is becoming more buggy. These problems was here since the day 0, but now I have to redo a day again because it did not save progress several times a month. Of course strike is reset too, which is very disappointing. Also today the app is paused because a message arrived in telegram, and never resumed... I resumed it automatically after I realized that I'm sitting way too long. And still, the session did not get to the end because app crashed. Is it also part of training? To help me to control my anger? Please fix it already.", "Numbers": "231", "Date": "February 19, 2018"}, {"Content": "The app seems very good but suddenly it stopped working and now it crashes when I try to open it. The few sessions I did manage though were enjoyable", "Numbers": "232", "Date": "February 13, 2018"}, {"Content": "Trying a month subscription. I tried a few meditations and they were okay. Then I decided to download a couple of packs and do some offline. The app doesn't start anymore, crashes every time.", "Numbers": "233", "Date": "February 16, 2018"}, {"Content": "After an app update this no longer opens on my OnePlus One. It crashes before even loading. Have to put my subscription on hold until this is fixed.", "Numbers": "234", "Date": "February 16, 2018"}, {"Content": "It keeps crashing", "Numbers": "235", "Date": "January 28, 2018"}, {"Content": "It's a good app. The meditations are great. My biggest problem is that the app will crash part way through a session. It gets annoying then trying to figure out how far along you were into it and getting back into the meditation.", "Numbers": "236", "Date": "January 31, 2018"}, {"Content": "Horrible app. I logged in with Facebook, then the app crashed and when i tried to do it again(cause without logging in you cant continue ) it promted me with\"user already exists,please try another \" . Please fix your code.", "Numbers": "237", "Date": "February 3, 2018"}, {"Content": "I had a nice experience using this app, i have even subscribed to it, but a month ago, abruptly the new packs were added without any update done by me, and i discovered an option for downloading the sessions offline ,so i did that, the next day, the app crashed. I reported 100s of times. I mailed to headspace. I have been receiving their replies but its been almost a month, the app has not been fixed and it is utterly frustrating since i am not able to keep up with my meditation. I don't think my problem is so major that they should take so much time for this🤐😥😥", "Numbers": "238", "Date": "January 18, 2018"}, {"Content": "App keeps on crashing. Unable to use it. Please help.", "Numbers": "239", "Date": "January 13, 2018"}, {"Content": "The older version was more user friendly and quick. This one is a mess, very difficult to find what you're looking for and it crashes all the time.", "Numbers": "240", "Date": "January 9, 2018"}, {"Content": "Unfortunately I signed up for the free sessions but on day 2 the email I got directed me to install the app which has kept crashing. Day 1 was good so I'm disappointed it's not working.", "Numbers": "241", "Date": "January 22, 2018"}]