[{"Content": "Why does always crash whenever i tried to open it. Please do something about it.. Because i needed this application as a reference for my project.. Thank you..", "Numbers": "1", "Date": "February 22, 2019"}, {"Content": "Great app. Airnow.gov was crashing and this app stayed current. Clean design", "Numbers": "2", "Date": "January 19, 2019"}, {"Content": "Good app but the widget keeps crashing on my android", "Numbers": "3", "Date": "December 30, 2018"}, {"Content": "Great app but does crash occasionally", "Numbers": "4", "Date": "August 20, 2018"}, {"Content": "Frequently crashed during load the slow responsive air earth which I'd rather show a 2D earth for faster display. Lack of notification. Wish to show AQHI value in widget optionally. Wish to add widgets for more than one place. A week history data are expected additionally. Air figures displayed on map are very slowly, and those figures are frequently hidden away so inconveniently. Finally uninstalled.", "Numbers": "5", "Date": "May 2, 2018"}, {"Content": "The widget doesn't show current conditions unless I go into the app and manually refresh it. Crashes often.", "Numbers": "6", "Date": "May 22, 2018"}, {"Content": "Useful to have when it works. Crashed a few times on my pixel. Why is the by hour chart so messed up?", "Numbers": "7", "Date": "January 1, 2018"}, {"Content": "I have downloaded twice and the app refuses to open, but instead crashes.", "Numbers": "8", "Date": "December 27, 2017"}, {"Content": "Freezes phone when attempting to add new location", "Numbers": "9", "Date": "December 15, 2017"}, {"Content": "Crashes ,slow to respond", "Numbers": "10", "Date": "December 8, 2017"}, {"Content": "Seems to do what it is designed to do with no bugs or crashing.", "Numbers": "11", "Date": "December 6, 2017"}, {"Content": "Fantastic app. Never crashes. Very useful for Kuwait.", "Numbers": "12", "Date": "December 23, 2017"}, {"Content": "Great...needs improvements for crashings.", "Numbers": "13", "Date": "December 17, 2017"}, {"Content": "Crashed on opening on the first few attempts. Eventually opened but unable to see any data even after db update. Useless.", "Numbers": "14", "Date": "December 13, 2017"}, {"Content": "Crash after first fresh install. HTC 10 @ Nougat", "Numbers": "15", "Date": "December 13, 2017"}, {"Content": "Crashing, suspicious updater included\nApp have an ability to download additional packages (updates). Installation has been prevented because I have disabled unknown installation sources in my phone. Apart from that, app is crashing, and my \"nearest station\" status is blank, showing nothing - disabled stations should be filtered and next nearest one should be offered.", "Numbers": "16", "Date": "October 30, 2017"}, {"Content": "Freeze my old phone. Will reinstall on my device since it is very usefull im my city.", "Numbers": "17", "Date": "November 24, 2017"}, {"Content": "application is not supporting 4 x 2 widget in my Note 8 The widget crashes every time", "Numbers": "18", "Date": "November 12, 2017"}, {"Content": "Crashes everytime I click on world map", "Numbers": "19", "Date": "August 27, 2017"}]