[{"Content": "Gapless playback does not work on my note 8 - there is a noticable gap. It was not like this before On a Nexus 6P, using the exact same files. Gapless playback only seems to work when using Bluetooth. Also, tag editor seems to be broken, either crashes when changing album art or refuses to start.", "Numbers": "1", "Date": "October 20, 2018"}, {"Content": "since the new Samsung software update this app has been extremely buggy. It won't let me shuffle my music and is constantly crashing until I close out the app and open it again. it used to be my favorite music player but if they do not fix these issues soon then it will be a big problem", "Numbers": "2", "Date": "February 19, 2019"}, {"Content": "Used to be good. The only reason I chose it was because of the blacklisting feature. But now it won't scan music without crashing. Guess I'll have to find another app since it hasn't been updated in months.", "Numbers": "3", "Date": "December 15, 2018"}, {"Content": "Crashes constantly on Samsung Galaxy S9 with Android P Please add .m4a support. Also there's a bug where if you use the tag editor and change the genre of a song, it doesn't remove the song from the previous genre.", "Numbers": "4", "Date": "February 22, 2019"}, {"Content": "Great app, is one of the best player I've seen or maybe the best, but when I want to change the cover of an album it crashes, please fix it.", "Numbers": "5", "Date": "October 15, 2018"}, {"Content": "theres a bug where it keeps crashing when you try to save a song to a playlist", "Numbers": "6", "Date": "February 26, 2019"}, {"Content": "Crashes when you try to set album art on OP6", "Numbers": "7", "Date": "November 29, 2018"}, {"Content": "Great app except for one thing, the tag editor sucks. Every time you try to use it, it freaking freezes the app and screws something up. Every time you change your name on the song all the names change to that name and I have to do it all over again and changing these back to what I wanted in the first place. I hope they fix this problem because I'm getting fed up with this app and I'm going to erase it all together because you don't know how many times I've redone it over and over. I must have wasted about 1,000 hours on this app and I'm not going to do it anymore.", "Numbers": "8", "Date": "July 22, 2018"}, {"Content": "Beautiful yet recently it's been crashing alot, especially when I try to view an artist. If it was more stable it would be perfect 👌 👌 👌 Edit: fixed", "Numbers": "9", "Date": "July 14, 2018"}, {"Content": "Crash when adding images ia persistent and not remediated", "Numbers": "10", "Date": "July 2, 2018"}, {"Content": "IT'S THE BEST BEST BEST BEST APP I HAVE EVER USED. I ALMOST TRIED ALL THE MUSIC PLAYER APPS BUT THEY ARE TRASH. WHEN THERE IS A CRASH YOU ALWAYS FIX IT. THANKS FOT THIS AMAZING SERVICE.", "Numbers": "11", "Date": "June 27, 2018"}, {"Content": "This was the best app. I loved it. But after 26th update it is not at all opening. Ur crashes everytime. Pls fix it", "Numbers": "12", "Date": "June 27, 2018"}, {"Content": "Well, before the actualization it work okay, but now the app don't let me enter and crash", "Numbers": "13", "Date": "June 26, 2018"}, {"Content": "Better than other music player app No random adds No crash issue keep it up", "Numbers": "14", "Date": "June 8, 2018"}, {"Content": "A great music player for stock users. No crashes as such. Works great! Please change the name of the app...My friends are misreading it.... XD....App name: Mysic", "Numbers": "15", "Date": "February 27, 2018"}, {"Content": "Please check the price for the pro version. I have been using this app since the time I bought a new phone, which is more than a year. But I am disappointed with the pricing. And it keeps on crashing when i try to set favorites. Otherwise it's just gorgeous. Keep it up Karim.", "Numbers": "16", "Date": "January 6, 2018"}, {"Content": "Keeps crashing alot on motp g4plus", "Numbers": "17", "Date": "June 28, 2018"}, {"Content": "Frequently crashing! Wasn't the case earlier. Now it consumes a lot of resource while playing, lags as a result, kindly streamline not bloat.", "Numbers": "18", "Date": "October 5, 2017"}, {"Content": "Unfortunately, it is crashing when I turn off the screen.", "Numbers": "19", "Date": "November 25, 2017"}, {"Content": "All in all, an amazing, minimalist music app! My only suggestion is that A. For some reason, the artist art for MGMT is broken and crashes the app. This needs to be fixed as it can cause a lot of problems. And B. Perhaps the addition of a way to sort albums, for example, in artist alphabetical order, instead of album. That way all albums are grouped by artist in the list :)", "Numbers": "20", "Date": "June 26, 2017"}, {"Content": "After using the Google Play Music app since I started using Android, I must say that this is the better app by a long shot. It's functional, clean and does everything that I need it to. After updating to Android 7.0, I haven't noticed any problems with the application. While on 6.0, when the playing queue finished the final song, it would loop and start over and also crash the app so I couldn't pause it. Other than that, I can't recommend this player enough!", "Numbers": "21", "Date": "July 5, 2017"}, {"Content": "Unstable, crashes regularly. Can't find my sd card full of music anymore. Looks good tho.", "Numbers": "22", "Date": "August 10, 2017"}, {"Content": "This app is taking a turn for the worse day by day.... Many times the player crashes when I am in another app.... I have sufficient RAM and storage to run basic things such as scrolling through social media while listening to music.... But that wasn't just it..... Slowly the artist page became glitchy and laggy......to make things even worse.... The app started deleting songs on its own when I started playing it through its native widget..... It doesn't even pull artist images from last. Fm anymore... The app has become completely unusable..... When the update launched it wasn't like this.... But things just started going downhill a week later... Switching to pulsar till major updates hit;( Like seriously how tf can a music player be so resource heavy........ -AnOldDisappointedUser;(", "Numbers": "23", "Date": "August 26, 2017"}, {"Content": "It's way better than other music players. But needs some work on crashing and notification. Thank you.", "Numbers": "24", "Date": "May 13, 2017"}, {"Content": "Failing to load some of my songs and then freezes. Other players can play it. Abandoned project?", "Numbers": "25", "Date": "September 1, 2017"}, {"Content": "Awesome material design UI, but plenty of crashes and bugs with the notification toggle on Android O dev preview 4.", "Numbers": "26", "Date": "August 1, 2017"}, {"Content": "CRASHES on double tap on currently playing music screen - having just downloaded the app and expecting lyrics to show up on double-tap on the expanded currently playing music screen, the app instead crashes. This behavior is same across all other songs. Please look into this! Otherwise looks like a solid app.", "Numbers": "27", "Date": "April 1, 2017"}, {"Content": "Everything works fine except the equalizer. Each time I select equalizer the app is crashing with a notification Music FX stopped Close App", "Numbers": "28", "Date": "October 21, 2017"}, {"Content": "best but now crashes", "Numbers": "29", "Date": "May 15, 2017"}, {"Content": "can't even report a bug\nplaylists are persistently deleted or reset to default—including, shockingly, the favorites. tried to send a bug report through the app to GitHub and it crashed. can't exclude folders, or play certain podcast and song mp3s w/o jumping through hoops. stunningly beautiful, but practically unusable for me now.", "Numbers": "30", "Date": "December 9, 2016"}, {"Content": "Fix the frequent app crash! I just love this music player, from its design to functionality, everything is just perfect. The only problem which I face is that the app crashes on its own frequently. Please fix it!", "Numbers": "31", "Date": "December 4, 2016"}, {"Content": "The app is really good but the problem is when I next the song when in the lock screen it crash. The button gone, I mean the app in the lock screen gone and it automatically play other. Hope you fix it :)", "Numbers": "32", "Date": "February 28, 2017"}, {"Content": "Was very good Loved the app for the longest time, but recently it has been crashing a lot and not able to load new album/artist art", "Numbers": "33", "Date": "December 13, 2016"}, {"Content": "Crashes. It has started to crash once in a while :( I love this app, but it would be much better if there were genre tab.", "Numbers": "34", "Date": "December 8, 2016"}, {"Content": "Crashes a lot. Shuts down on its own all the time", "Numbers": "35", "Date": "December 18, 2016"}, {"Content": "App crashes every time! Please fix it. Please.", "Numbers": "36", "Date": "December 25, 2016"}, {"Content": "this app crash my \"dolby atmos\"", "Numbers": "37", "Date": "February 19, 2017"}, {"Content": "It's good but there's a frequent crashing of this app.", "Numbers": "38", "Date": "January 21, 2017"}, {"Content": "Crashes a lot.", "Numbers": "39", "Date": "January 6, 2017"}, {"Content": "I like the app but it crashes each time I pick up calls and works only after I reboot my phone. When I pause the song before picking up a call, it doesn't crash but it does otherwise. Thanks!", "Numbers": "40", "Date": "November 21, 2016"}, {"Content": "Really nice app, good looks and customization possibilities. Thumbs up! I have a problem, though. The dark theme doesn't work for me. Every time I select it, Phonograph will just crash when I launch it...", "Numbers": "41", "Date": "November 28, 2016"}, {"Content": "Crashing recently Update : gave u 5 star 🌟 but whenever I'm trying to ply tracks over 50 minutes (such as EDM, MASHUPS) long, it's crashing.... Do something...", "Numbers": "42", "Date": "October 17, 2016"}, {"Content": "Crashes sometimes Would be a 5 star review but sometimes after switching to a new song the player crashes.", "Numbers": "43", "Date": "November 17, 2016"}, {"Content": "oh my god crashes i love the design and crap but if you just freakin look at this thing wrong it crashes. fix it.", "Numbers": "44", "Date": "November 19, 2016"}, {"Content": "Great app, but crashes. Crashing very often since the last update. Pretty good app otherwise.", "Numbers": "45", "Date": "September 27, 2016"}, {"Content": "Artists Missing Ever since the update I have artists missing from the artists page. Also, the app crashes when I open the page for some artists.", "Numbers": "46", "Date": "October 8, 2016"}, {"Content": "Crashing It keeps crashing everytime I scroll down or while it's playing in the background. Please fix.", "Numbers": "47", "Date": "November 27, 2016"}, {"Content": "So Beautiful!! Better than shuttle Beautiful UI never crashes it doesn't have a built-in Equalizer though maybe we'll get that in a future update but it's the most beautiful music player in the play store like for real and I don't give a fucc what y'all say", "Numbers": "48", "Date": "August 21, 2016"}, {"Content": "Excellent. Few bugs here and there. The app has a few bugs (the tag editor, the grid animation freezes sometimes) but overall great app. Beautiful UI and the customization is nice.", "Numbers": "49", "Date": "July 10, 2016"}, {"Content": "The best, but it has problems I love it, but it crashes really frecuently. Please fix it", "Numbers": "50", "Date": "December 6, 2016"}, {"Content": "Sometimes it crashes while checking out the songs list", "Numbers": "51", "Date": "September 15, 2016"}, {"Content": "Just a little short of perfect\nAfter trying many music players like Poweramp, player pro, black player, my quest ends here. Clean, simple, organized and easy to use UI. It's got all the feature and nicely stacked. No complicated structure, just a simple menu and your phone/sd card folders are also there. Although i faced two issues. 1) while changing song orders in a playlist, it crashed a no. Of times. 2) Doesn't always work with my car Bluetooth device. (Doesn't follow Next/previous command).", "Numbers": "52", "Date": "May 5, 2016"}, {"Content": "Its crashing. Maybe there are some bugs. Please try to remove them as phonograph is my primary music player. Player suddenly stops in between any random song. I've checked the song. Its completely flawless.", "Numbers": "53", "Date": "May 24, 2016"}, {"Content": "Good, but widget issue Great design, but the homescreen widget is basically useless - slow, gets stuck on songs, crashes, etc.", "Numbers": "54", "Date": "May 3, 2016"}, {"Content": "Worse It's beautiful, yes, but it's useless. The widget doesn't work, the covers don't download automatically, and has a lot of bugs and crashes. Uninstalling.", "Numbers": "55", "Date": "May 16, 2016"}, {"Content": "Best music player out there. It crashes sometimes, but that's rare. Wish it was updated more but it's fine the way it is.", "Numbers": "56", "Date": "May 30, 2016"}, {"Content": "useful\nbest looking and performing player for android, just missing a couple of features such as number of times played, and a blacklist. The interface is beautiful and it has never crashed, works with a separate equalizer app, also the tag editor has helped me better organize my music, and it doesnt seem to use as many resources or eat as much battery as the competition.", "Numbers": "57", "Date": "April 8, 2016"}, {"Content": "Serious bug! Crashes when I try to change the tag everytime! One star extra for amazing UI", "Numbers": "58", "Date": "April 29, 2016"}, {"Content": "Great music player, slightly customizable, functional, beautiful, however it tends to crash on CM13 + Viper4android where other players do not, and cover arts can be slow to load sometimes, still, showing great progress and might increase the score to 5 once these issues are ironed out, keep it up!", "Numbers": "59", "Date": "June 23, 2016"}, {"Content": "The best music player Very light and attractive music player. Loved it . The only drawback is it crashes sometimes and no visualisations are available", "Numbers": "60", "Date": "June 16, 2016"}, {"Content": "Its great but causes my s7 to crash. Not just the app the whole phone", "Numbers": "61", "Date": "May 19, 2016"}, {"Content": "Awesome However, it crashes more often than I'd like it to", "Numbers": "62", "Date": "June 16, 2016"}, {"Content": "Just decided to adopt this my player but... Update.. No Buts..Now working and improved. Great player thanks. (Can you make it cast! :-) ). It now crashes on start since the last update - Moto E on lollipop. Please fix I'd like to use it again and give it another star.", "Numbers": "63", "Date": "March 14, 2016"}, {"Content": "Not so good anymore It used to be good till the last update, now it keeps crashing and I can access the playing queue! Guess I'll have to come back to google play music, too bad", "Numbers": "64", "Date": "March 5, 2016"}, {"Content": "Great! I really like the app, overall a solid music player with excellent design. Crashes are a lot less rare now, they are borderline nonexistent.", "Numbers": "65", "Date": "February 23, 2016"}, {"Content": "Wicked but Can you please fix this: it constantly crashes since the latest update and it doesn't download the artists' images. Thanks!", "Numbers": "66", "Date": "March 5, 2016"}, {"Content": "Artist Crashes everytime I tap on an artist running Android 6.0", "Numbers": "67", "Date": "April 15, 2016"}, {"Content": "Love it but... I love the app but I find it crashes often.", "Numbers": "68", "Date": "March 22, 2016"}, {"Content": "I love phonograph BUT Your app is crash some times. Sometimes it play musics with very loud volume and stop playing without any touched! And when pause a music, i hear a sound that it's not good at all! This problems occurred In headphone.", "Numbers": "69", "Date": "February 19, 2016"}, {"Content": "Keeps crashing I really love the app the material design but it keeps crashing all the time please the app is a five star app please fix fix this and I will surely rate it its deserved 5 stars", "Numbers": "70", "Date": "February 10, 2016"}, {"Content": "Used to work, now keeps crashing", "Numbers": "71", "Date": "February 9, 2016"}, {"Content": "Crashes This App crashed several times on my HTC One M8. Uninstalled.", "Numbers": "72", "Date": "February 8, 2016"}, {"Content": "Great app, sleek design\nReally love the functionality and design of this music player, by far the best material design music player on the market. It would easily be a flat 5 stars, but since the new update I've been crashing occasionally when switching songs or browsing. Not a huge problem, but hopefully the issue is resolved with the next update. Edit: problem resolved with the new update :)", "Numbers": "73", "Date": "January 30, 2016"}, {"Content": "Gorgeous Material Design\nThis music player has the most gorgeous Material Design I've seen yet on android! You can tell the developer spent a lot of time polishing the UI/UX of this app, it really stands out from other music players with its stunning visuals, animations, and attention to detail. My only issue with it is that it is not rock solid stable; I've had a crash here or there, but nothing too bothersome. If you are a Material Design freak, I definitely recommend. The UI/UX feels how Google Play Music should have felt.", "Numbers": "74", "Date": "February 1, 2016"}, {"Content": "Disappointed I'm using this app from a year or so and i had no problem with this but after the last update it's crashing every single time. I'm very disappointed. Going to Uninstall it.", "Numbers": "75", "Date": "January 17, 2016"}, {"Content": "Alright I really like the way it looks and all the editing options but it has a lot of problems like: frequently crashing, large blank gaps in between songs, and also it doesn't automatically put songs with the same album name together.", "Numbers": "76", "Date": "February 1, 2016"}, {"Content": "Since marshmello update on my moto g3, the app crashes when i got to tag editor.", "Numbers": "77", "Date": "January 22, 2016"}, {"Content": "Crashes Nt evn once it wrkd ..........keeps crashing immideatly each time I open ......", "Numbers": "78", "Date": "January 30, 2016"}, {"Content": "Not opening in my one plus 2 ,auto crashes", "Numbers": "79", "Date": "January 13, 2016"}, {"Content": "Prettiest! But on its early stages, this is just excellent!! A couple more performance updates and this is killer. Occasional freezes occur though on my Canvas Elanza 2 EDIT: THE FORCE CLOSES ARE GONE. THIS IS KILLER", "Numbers": "80", "Date": "January 9, 2016"}, {"Content": "Android 4 :( On android 4.1 it crashes pretty often. And sometimes the cover art won't show up.", "Numbers": "81", "Date": "January 11, 2016"}, {"Content": "started crashing after latest update crashes upon opening after last update. please help", "Numbers": "82", "Date": "January 11, 2016"}, {"Content": "Good for the most part I want to love it so much. In terms of looks, features, and performance, it's my favorite music player. I prefer it over Shuttle, even. Recently, though, I can't have it open for longer than a few minutes without it crashing. This is unfortunate, because I really do love this app.", "Numbers": "83", "Date": "January 3, 2016"}, {"Content": "Amazing This is an amazing app, design is bang on. But I do have one small thing. The app tend to crash after you edit a few tags in batch album's since the new update.", "Numbers": "84", "Date": "January 2, 2016"}, {"Content": "Good but needs to be fixed An overall good music player with a nice UI. But between songs there is a 5-10 second delay where the app is completely unresponsive and will sometimes even crash completely. Get on it devs, then you get 5 stars.", "Numbers": "85", "Date": "January 4, 2016"}, {"Content": "Crash For some reason crashes when playing a particular music", "Numbers": "86", "Date": "January 4, 2016"}, {"Content": "Like design, keeps crashing Running lollipop 5.0.1 Galaxy S5 and design is flawlessly beautiful, but crashes especially when starting app from widget. Doesn't crash during songs, just with startup and widget. Also does not work with song intents (starting a certain song from another app).", "Numbers": "87", "Date": "October 6, 2015"}, {"Content": "Incredible, although... It tends to crash randomly, ceasing my music and causing me to reopen. The crashing has zero consistency, so I cant provide much info. It just says \" unfortunately, this app has stopped working and needs to stop\"", "Numbers": "88", "Date": "October 14, 2015"}, {"Content": "Good but needs more The app has a nice view but it's missing things like organizing albums by artists and things like choosing music by genre. Also crashes a lot", "Numbers": "89", "Date": "October 11, 2015"}, {"Content": "Too buggy. Takes too much time to load. Too much gap between songs. No lyrics support. Crashes often. Goes haywire during playback. Not worth keeping, despite the beautiful material UI.", "Numbers": "90", "Date": "November 4, 2015"}, {"Content": "Near perfect, nevertheless the best UI in music player\nThe app is beautiful, there is so much material, so much color, even though id like to see a crossfade feature, and a slideable Queue menu. Also, albums with same names should be merged since it divided songs of the same album and its a but annoying. It's a beautiful music player tho. EDIT: I have been experiencing tons of random crashes on Marshmallow. I'm not gonna remove any stars now, but I'm looking forward to seeing the issue fixed.", "Numbers": "91", "Date": "December 30, 2015"}, {"Content": "Freezes on shuffle Unless screen is unlocked shuffle stops after each song on note 3", "Numbers": "92", "Date": "November 10, 2015"}, {"Content": "Beautifully Simple Great UI customization and layout. It's still in beta as of this review, so it crashes sometimes (at least for me).", "Numbers": "93", "Date": "December 8, 2015"}, {"Content": "Very good but extremely buggy Got 20 crashes in two days... Fix it. Ps: Fix the nested scrolling in albums.", "Numbers": "94", "Date": "September 24, 2015"}, {"Content": "Okay close yet off by a bit The crashes are gone but it's in serious need of an alphabetical side scroll down preferably a transparent one tucked on the right side allowing us to scroll and the letters up out as your finger drags music and album list", "Numbers": "95", "Date": "October 26, 2015"}, {"Content": "Best replacement for stock Google Music Polished UI, doesn't crash like Google Music. I would like the ability to change album art manually (with image files from phone)", "Numbers": "96", "Date": "December 8, 2015"}, {"Content": "Crashes when i try to play a song on my Alcatel Idol 2 running KitKat.", "Numbers": "97", "Date": "December 9, 2015"}, {"Content": "Frequent crashes Otherwise perfect.", "Numbers": "98", "Date": "October 18, 2015"}, {"Content": "Crashed Crashes on startup after update", "Numbers": "99", "Date": "January 23, 2016"}, {"Content": "It crashes.", "Numbers": "100", "Date": "December 5, 2015"}, {"Content": "Issues!\nHey Karim! I really love this player (its my favorite actually), and I've been using it since the beginning. With the few last updates it is extremely crashing and buggy. The song won't play until 5 or 6 seconds of silence and changing to a different song triggers the same issue. It would be awesome if you find the way to fix this as this beauty is my only player. I'm using OnePlus One on Cyanogen 12.1.", "Numbers": "101", "Date": "September 18, 2015"}, {"Content": "Awesome When I scroll down through the side bar sometimes it freezes or lags near the bottom, and Phonograph crashes when editing an albums tags. Overall great", "Numbers": "102", "Date": "September 10, 2015"}, {"Content": "Beautiful app But the app often crash", "Numbers": "103", "Date": "September 15, 2015"}, {"Content": "The best music player for android. Period. It's small and light. Doesn't crashes. Gets updated frequently. Is such an eye candy with that awesome material design implementation. Damn; it's hard to find con for this app... Though I have a a few desires/requests - a refresh button for the media library and more widget designs please!", "Numbers": "104", "Date": "September 3, 2015"}, {"Content": "Fantastic! Best Music Player You Can Find This is a beautifully designed app and the material theme throughout looks great. I cannot fault this app at all. A few people have had crashes and some other issues but I have had none of the kind.", "Numbers": "105", "Date": "August 24, 2015"}, {"Content": "Please fix the Tag Editor Back when i first installed this app i was able to add album art to an mp3 that was not displaying correctly.....NICE!......but only once......then the feature disappeared. Please fix that. Still crashes frequently too while navigating albums.", "Numbers": "106", "Date": "August 24, 2015"}, {"Content": "Problem with tag editor Seems to freeze whenever I try to open it, and even if I do get to access it, changes are not applied. Please consider looking into it; other than that, this is probably the best music player", "Numbers": "107", "Date": "August 23, 2015"}, {"Content": "Beautiful but Broken Fix the crashing!!! Crashes so much it is unusable. Running on a Galaxy s5", "Numbers": "108", "Date": "September 21, 2015"}, {"Content": "I have duplicate songs All songs are doubled! The first one doesn't play, and the other plays. Whenever I delete the non-playing one, the app lags then crashes.", "Numbers": "109", "Date": "July 25, 2015"}, {"Content": "Wonderful but... Sometimes when I'm playing music, it takes a while for the app to play the next song. It crashes occasionally, especially when I'm configuring the settings. I love the interface and the colors though!", "Numbers": "110", "Date": "July 2, 2015"}, {"Content": "Still crashing Please in the next update fix the crashing issue for android jellybean, I can't listen to any music because it crashes when i select it. This never used to happen before D:", "Numbers": "111", "Date": "June 25, 2015"}, {"Content": "Love it but.. It's an awesome music player, with great design. But whenever I use a different app while playing music, it crashes quite often", "Numbers": "112", "Date": "June 18, 2015"}, {"Content": "Crashes", "Numbers": "113", "Date": "June 17, 2015"}, {"Content": "Totally great app App is very good and working very stable. I changed from Shuttle music to this because the app always crashed on my phone. I thankfully for this app because can scrobbling with Wail scrobbler. :) Still the app in progress of development, so I look forward for the future features!", "Numbers": "114", "Date": "May 26, 2015"}, {"Content": "Almost there Galaxy S3. Great design and functionality. Has crashed 3 times within the past 10 mins but I understand it's still in beta. Excited to see this grow and develop further.", "Numbers": "115", "Date": "June 10, 2015"}, {"Content": "Crashes a lot.", "Numbers": "116", "Date": "June 10, 2015"}, {"Content": "Truly Material Got a lovely feel of Material Design ☺. Could've given all stars, if the app doesn't crash at some random intervals. Facing an issue sometimes I am not able to pause the playing song, needs to stop the player.", "Numbers": "117", "Date": "May 21, 2015"}, {"Content": "Great potential\nReally fast and smooth app. Only a couple of things that should be changed, that's what a beta is for, isn't it? 1. The name should be Gramophone. It suits the app better. 2. When I try to use the tag editor after I changed the name of the artist, the app crashes. 3. The app crashes a lot. But the overall performance is great.", "Numbers": "118", "Date": "April 30, 2015"}, {"Content": "Brilliant so far... Getting a few crashes when editing file info/cover art, possibly because I am trying to edit the same track again too quickly? Really like the app, great to use and looks nice :)", "Numbers": "119", "Date": "April 30, 2015"}, {"Content": "Good, but\nA beautiful app, which could possibly be the replacement of PowerAmp, which I'm fed up with, for me. Need some features and fixes: 1. LastFM scrobbling 2. Album art downloading 3. Doesn't recognise some tags 4. Still stops and freezes/fc's on pretty much every song (because of their formats I reckon) 5. Widgets 6. Folders lol) Pretty unusable for now.", "Numbers": "120", "Date": "April 27, 2015"}, {"Content": "OK, first crash, but could be better if it had more features It's pretty good, just wished it had more features, and it crashed on me. But then again, it is a beta version. But it's not the WORST music player I've seen.", "Numbers": "121", "Date": "April 24, 2015"}, {"Content": "Keeps crashing all the time Whatever I do it just crahes", "Numbers": "122", "Date": "April 23, 2015"}, {"Content": "best looking music player to date... some bugs like not showing album art and random crashes...", "Numbers": "123", "Date": "April 17, 2015"}, {"Content": "crashophone !! make it a working app..although nice UI.", "Numbers": "124", "Date": "April 15, 2015"}, {"Content": "Great app but one problem Best app. The problem is that I used an app to add an album cover to one album, when I play the album with the art it crashes. Is there any way to fix this?", "Numbers": "125", "Date": "April 14, 2015"}, {"Content": "It rocks man\nGood material design pleasing to the eyes I think it borrows it's some visuals from Sony Walkman it's fine making a good music player but the concert is that it sometimes crashes I am on 4.4.2 Samsung Galaxy Note 2 it is understood that the app is in beta version also you could try adding equaliser to the player anyways dev we are with you", "Numbers": "126", "Date": "April 14, 2015"}, {"Content": "Looks like a really nice app but it crashes instantly on my oneplus one", "Numbers": "127", "Date": "April 13, 2015"}, {"Content": "Worthy Player but Crashes Every time It installed successfuly but it turns out it crashes every time I launch it what seems to be the problem? I can't rate that high enough unless if you fix the crashing issue.. Thanks!", "Numbers": "128", "Date": "July 17, 2016"}, {"Content": "Crashes :( I'm starting to dislike the player. Not reading ID3 tags accurately, adaptive color - the one that displays the song title and artist in the now playing screen still has no disable option and now the crashes. Has a lot of potential but til issues are fixed I'm not sure if I'll use this.", "Numbers": "129", "Date": "June 13, 2015"}, {"Content": "Absolutely loved this app when I had it installed but I uninstalled it for reasons told below. It caused my high end performance tablet to freeze up and then when your in the app swiping left and right from songs to playlists it lags badly and could use some optimization. Another suggestion I have is develop an in-app equalizer for a better sound experience. Overall, I loved the design of the interface but it still needs improvement.", "Numbers": "130", "Date": "May 2, 2017"}, {"Content": "Very well designed but keeps crashing The app is intuitive and has pretty much all the features I want in a player, but unfortunately keeps crashing on my S4. It's usually when the songs change or when I enter the app from the android drop down.", "Numbers": "131", "Date": "October 17, 2015"}, {"Content": "Nice but it crashes constantly This is the best music player in the playstore!but whenever I change the song it force closes..please fix this ASAP and thanks developer for the great work!", "Numbers": "132", "Date": "August 28, 2015"}, {"Content": "Great, but I love using this, it's one of the most beautiful music players, but whenever I skip a few songs from the lock screen the app crashes and doesn't start again until I reinstall it, so please fix it", "Numbers": "133", "Date": "October 25, 2016"}, {"Content": "Double tapping on album cover of currently playing song window crashes the app. I thought double tap would show lyrics but there seems to be no way to show lyrics.", "Numbers": "134", "Date": "August 12, 2017"}, {"Content": "After recent update it just constantly crashes every time I open it, causing my phone to reboot!? Its ridiculous! Until this is fixed don't download", "Numbers": "135", "Date": "April 8, 2016"}, {"Content": "Very big DEBUG But i liked it, but it's always debug everytime i play random song, or delete song, but i love it, but this app is annoying, but this is awesome app, so smooth, but sometimes it crash", "Numbers": "136", "Date": "September 23, 2015"}, {"Content": "Every time I go to tag editor and try to update an album cover the app crashes.Over and over ,every time.", "Numbers": "137", "Date": "September 22, 2018"}, {"Content": "Could be better. Equalizer randomly crashes., usually when app is launched.", "Numbers": "138", "Date": "June 24, 2018"}, {"Content": "So slow and crashy It crashes so much and he's slow af on my OnePlus One", "Numbers": "139", "Date": "March 19, 2016"}, {"Content": "Loved it But... Crashes aftr using it for a long tym..", "Numbers": "140", "Date": "February 17, 2016"}, {"Content": "Favorite music player but... I love this music player but it crashes after skipping a few songs.", "Numbers": "141", "Date": "October 15, 2015"}, {"Content": "Crashes...no album art fetcher no lyrics option.", "Numbers": "142", "Date": "July 5, 2015"}, {"Content": "Crashing", "Numbers": "143", "Date": "January 26, 2016"}]