[{"Content": "Great app, brilliant way to control your alcohol consumption simply through self-awareness. Now used it for 5 years with great success. Minor glitch: reinstalling after a phone reset, I was unable to reload my backup file (\"permissions denied\") and the app crashed. Discovered this needed fixing in Android/settings/apps/alcodroid/permissions. Now running fine again.", "Numbers": "1", "Date": "December 3, 2018"}, {"Content": "A good app although it does not respond/crash at times", "Numbers": "2", "Date": "April 2, 2018"}, {"Content": "A potentially good alcohol tracker if it didn't crash Crashes every time I add an item. Need a way to partially truncate my 2.5 years of data. Minus 2 stars (Nexus 5X)", "Numbers": "3", "Date": "December 9, 2016"}, {"Content": "Great except lots of ads and crashes often Lots of ads, crashes a lot on a galaxy s7, and 3.49 to remove the ads. Am shopping around for replacement", "Numbers": "4", "Date": "December 16, 2016"}, {"Content": "Useful app. Stellar support Superb app for tracking alcohol consumption and cost. When I had an issue with crashes they responded swiftly with a personal update. Would pay except new version I have won't let me!", "Numbers": "5", "Date": "November 6, 2016"}, {"Content": "Great! Very flexible inputs, a wide range of stats and graphs. And it has reduced my consumption quite a lot just by raising awareness in a fun way. Does crash though if you reopen it after having left it in chart mode.", "Numbers": "6", "Date": "February 9, 2013"}, {"Content": "Simlpe to use and set up options. Never crashed in 3 months. Great little app", "Numbers": "7", "Date": "January 28, 2013"}, {"Content": "Wont work Wont work anymore on my rezound ics. Used to be amazing but now just crashes.", "Numbers": "8", "Date": "September 12, 2012"}, {"Content": "Useful but crashes Crashes on opening when the charts page is open. On my Galaxy S2 running ICS.", "Numbers": "9", "Date": "August 28, 2012"}, {"Content": "Caused my phone to freeze. Had to uninstall", "Numbers": "10", "Date": "October 3, 2011"}]