[{"Content": "nice idea but it crashes whenever i want to make an edit", "Numbers": "1", "Date": "January 21, 2019"}, {"Content": "My plane crashed on an Island and there was a little of my data left so I downloaded this app which really helped me a lot. Thanks!", "Numbers": "2", "Date": "December 3, 2018"}, {"Content": "It is not often that I feel an app is good enough to stop and write a review, however, this app is definitely worth it. I love how it takes so little space, runs brilliantly (never had a crash or delay, with my phone a problem I often experience with other apps), has so much useful information that is well-detailed and has a super friendly user interface, and which is very easy to navigate. It also doesn't have any hidden \"pay to access\" features or nonsense like that, I feel that this app was developed not with money or fame in mind, but with the pure intention to help other people in times of crisis. I hope this app stays around forever, and it would be awesome if this can be listed as one of the \"ten most recommended apps to install\", or comes pre-installed. If I could also have the option of buying this as a book, or being able to download the entire manual's pages to print and pop in my bug-out-bag as well, I would do so in a heartbeat. Love, love, love this app. Thank you so much. This app is worth it, so much that I stopped what I was doing (without a \"Please review this app\" prompt) to write this rather lengthy review, and ran out of space. That's how good this is.", "Numbers": "3", "Date": "July 14, 2018"}, {"Content": "My plane crashed into an island and because of this book I survived. It was later irrelevant because I was actually dead the entire time.", "Numbers": "4", "Date": "February 18, 2018"}, {"Content": "This is THE best survival app. Packed with alot of useful information. Doesn't crash or take up hardly space. 5 stars!", "Numbers": "5", "Date": "September 9, 2017"}, {"Content": "Freezes my note 4 up on start up.", "Numbers": "6", "Date": "February 9, 2018"}, {"Content": "Saved my life after my plane crashed", "Numbers": "7", "Date": "September 20, 2017"}, {"Content": "This is the best survival app, but it crashes if u use the search as of this version.", "Numbers": "8", "Date": "November 16, 2017"}, {"Content": "Very useful app that provides a large amount of info on how to survive mother nature in the case your lost, in a crash or accident, war breaks out, solar flare or zombie apocalypse. Dropped to 4 stars instead of 5 because there needs to be more pictures/illustrations. Can never have to many illustrations when it comes to surviving to save your life & others. Great app overall", "Numbers": "9", "Date": "August 29, 2017"}, {"Content": "This app is amazing. It's small so I can keep it on my phone, but ad free, which is nice. I don't live near any woods so I can't put this into action, but if my plane ever crashes I guess I can survive!", "Numbers": "10", "Date": "July 14, 2018"}, {"Content": "It is good when ou are in a plane crash because you know how to survie and if your phone or gatchets are lowbat you can write it in a book", "Numbers": "11", "Date": "February 23, 2017"}, {"Content": "The app is great so far, but I think it should have a manual on how to survive plane crashes. Also I think the text should be more centered. {margin/padding}", "Numbers": "12", "Date": "April 3, 2017"}, {"Content": "Educationally awesome! Now I know how to survive in a remote environment. Also, I have some issues. When I try to highlight a paragraph, the highlighting things always end up in a blank spacing, causing the app to crash. But what the important thing is people will now know how to survive in an unstable environment just by using their phones from their pockets :D", "Numbers": "13", "Date": "February 25, 2017"}, {"Content": "I think that it's already pretty comprehensive, but a part about natural disasters would be useful, not just situations you might find yourself in after a crash. Also yes zombies would be a great idea.", "Numbers": "14", "Date": "March 6, 2017"}, {"Content": "Crashes when I select text and try to click anywhere else to remove selection. Shield Tablet K1 6.0.1", "Numbers": "15", "Date": "February 15, 2017"}, {"Content": "All is great but sudden app crashes", "Numbers": "16", "Date": "February 19, 2017"}, {"Content": "Stuck in crash loop..", "Numbers": "17", "Date": "February 21, 2017"}, {"Content": "This version crashes (white screen - it never opens) while it works just fine when installed from F-Droid.", "Numbers": "18", "Date": "January 26, 2017"}, {"Content": "Not gonna open the app for about 4 years but ill be real thankful when i dont die after that plane crash.", "Numbers": "19", "Date": "December 27, 2016"}]