[{"Content": "Was nice... Recent update causes it to immediately crash upon opening. Sometimes will stay open on the 2nd attempt, otherwise crashes in the middle of playing a podcast. Note 9.", "Numbers": "1", "Date": "February 13, 2019"}, {"Content": "Used to be great, but now crashes constantly. It might play one podcast, but if you stop it or try to play another one, it quits and won't reopen. You have to reboot the entire phone and then start again! I just uninstalled the app and I am going to use Spotify instead.", "Numbers": "2", "Date": "February 11, 2019"}, {"Content": "Nice simple UI but lots of crashes and freezes.", "Numbers": "3", "Date": "February 3, 2019"}, {"Content": "Fixed now, thank you. Unuseable since the last update - earlier today. App crashes on launch!", "Numbers": "4", "Date": "February 2, 2019"}, {"Content": "Terrible. Crashes on me when I need it and the playlist and subscription section is clunky.", "Numbers": "5", "Date": "February 3, 2019"}, {"Content": "keeps crashing after update", "Numbers": "6", "Date": "January 31, 2019"}, {"Content": "This App crashes a lot and frequently will not play podcasts at all. Needs an easy way to share/recommend episodes. Currently looking for other options.", "Numbers": "7", "Date": "January 2, 2019"}, {"Content": "Crashes my phone and turns it off.Podasts keep playing the same ones over and over unless I manually advance them.It does not auto delete played episodes.", "Numbers": "8", "Date": "January 5, 2019"}, {"Content": "I had high hopes of this app. The previous one I tried didn't work at all. This app found my podcasts - great. It downloaded them for offline use. - great. However it may be using too much RAM. If I run Bluetooth, Google Maps or even have data running in the background, the sound clicks and pops and my phone sometimes crashes and restarts. The only way it will work in my car is via Aux in with everything else turned off. Disappointed.", "Numbers": "9", "Date": "December 13, 2018"}, {"Content": "Works awesome until my screen shuts off and then my phone restarts and freezes until I remove the battery and do a full restart. This is with both streamed and downloaded. Removing app until problem fixed.", "Numbers": "10", "Date": "November 1, 2018"}, {"Content": "Keeps crashing, randomly deletes downloaded episodes, plays adds in the middle of an episode. Plus, annoying and nonintuitive layout and interface", "Numbers": "11", "Date": "November 9, 2018"}, {"Content": "Tons of ads, and they crash the app all the time", "Numbers": "12", "Date": "November 7, 2018"}, {"Content": "App consistently crashes my phone.", "Numbers": "13", "Date": "September 19, 2018"}, {"Content": "Was looking for a Google play replacement bc you cannot search in GP. This app crashes quite a bit, it closes when you pause the podcast for too long, and the layout is annoying. I do like the comments you can leave in sort of review fashion for each podcast.", "Numbers": "14", "Date": "September 6, 2018"}, {"Content": "What a great app, was looking for an app to explore the world of podcasts & this does it all...ads are unobtrusive and content is extensive. Very pleased with this app, especially as, so far, fingers crossed, it hasn't crashed once. Would definitely recommend & a deserved 5 * !!", "Numbers": "15", "Date": "September 9, 2018"}, {"Content": "Reliable so far - no crashes- yay!", "Numbers": "16", "Date": "September 7, 2018"}, {"Content": "Doesn't crash works well", "Numbers": "17", "Date": "August 30, 2018"}, {"Content": "This app has every podcast I'm looking for, is super easy to use, and has yet to crash or give me any issues. It's a great podcast player.", "Numbers": "18", "Date": "August 10, 2018"}, {"Content": "If this is the highest rated Podcast app on Android, I'm going back to Windows Mobile. Continually crashes, terrible UI/UX design. I note the Beta program is full. What feedback are these people giving? This app is VERY poor", "Numbers": "19", "Date": "July 28, 2018"}, {"Content": "Love this app. I tried a few that kept crashing (android), but this one has had no issues. Easy to use, easy downloads, and a ton of selections. Very happy with this app.", "Numbers": "20", "Date": "July 20, 2018"}, {"Content": "It was OK. Occasionally crashed. Often played the wrong episodes despite the cover and title being correct. The ads never bothered me much.", "Numbers": "21", "Date": "July 21, 2018"}, {"Content": "Recent updates seem to have mostly resolved the frequent crashes I had been experiencing. working and closes down. Nice app, just one or two user features away from 5 stars from me!", "Numbers": "22", "Date": "July 16, 2018"}, {"Content": "So buggy. So many ads that freeze. I have no problem using any other app my phone, but this one freezes and lags constantly. Idk if it's the newer updates or whatnot, but I'm moving to another app for podcasts. I'm sick of taking 10 minutes to get to the episode I want.", "Numbers": "23", "Date": "November 4, 2018"}, {"Content": "Great app...no crashes great sound quality..I hardly notice the ads because they are quick", "Numbers": "24", "Date": "July 16, 2018"}, {"Content": "The app is great, but sometimes it crashes and now it won't open at all.", "Numbers": "25", "Date": "May 29, 2018"}, {"Content": "Worked well before the last 2 updates. As others reported, the app wouldn't ope. Now it opens but the ads seem to cause it to freeze. There are times when trying to dismiss the ad, it picks up the swipe and plays what's under it. Then it won't close. Hopefully they'll release a fix soon. This was an app that I would consider pruchasing even though the playlist is out of sorts. Edit: I'm wondering now if the issues affect everyone who has had the free apps for months. Nothing is stated about subscribing for continued support.", "Numbers": "26", "Date": "May 24, 2018"}, {"Content": "1. It crashes after 20 minutes of listening 2. Sorting of podcast stations does not work Update: I bought a new device, nad when I download it on new device, irmt requires to pay the fee to hmbecome ad free! SCAM!", "Numbers": "27", "Date": "May 4, 2018"}, {"Content": "Very laggy, crashes repeatedly.", "Numbers": "28", "Date": "April 25, 2018"}, {"Content": "If you interrupt or replay from a point or touch the play controls while a podcast is playing the phone stutters and freezes and finally shuts down. Also sleep timer and play next features are either fraudulently there or not available. Volume boost is a good feature but disappears in next and needs resetting. Plays offline but only if you don't stop the podcasts while playing.", "Numbers": "29", "Date": "April 24, 2018"}, {"Content": "Won't import opml without crashing so I can't get started. Sent log.", "Numbers": "30", "Date": "April 12, 2018"}, {"Content": "Crashes on opml import", "Numbers": "31", "Date": "April 6, 2018"}, {"Content": "It started crashing when I start it. Emailed Podcast go days ago. Nothing back. So much for a speedy reply. I follow several hundred podcasts. Now will have to start again from scratch on another app. My advice, give this a wide birth. I've heard podcast addict is good. Just jad a look and they actually got back to someone on their playstore page.", "Numbers": "32", "Date": "April 1, 2018"}, {"Content": "Constant crashes, unable to export my subs list as well as download using mobile data. Too many bugs. Switched to podcast addict. Too bad.", "Numbers": "33", "Date": "March 22, 2018"}, {"Content": "The app works great until yesterday when it crashes and can't open.", "Numbers": "34", "Date": "May 29, 2018"}, {"Content": "Was good the first week and now its Not working, keeps crashing continuously.", "Numbers": "35", "Date": "March 9, 2018"}, {"Content": "Keeps crashing", "Numbers": "36", "Date": "March 1, 2018"}, {"Content": "Overall a good app. But they need to test it when you have a poor wifi connection. Sometimes people travel! If you click on a subscribed podcast the app keeps trying to update the list and will hang with poor wifi. If you are downloading and the wifi goes out the app will not immediately continue the download when wifi returns but will wait a long time. It should at least have a button to resume downloading. Also why is there a big trash button but no play button for downloaded podcasts? Why can't you play partially downloaded podcasts if you have lost wifi? It would also be nice to use a button on your bluetooth headset to fast forward through ads on a podcast. Oh yes without wifi the apps' ads freeze the screen. Isn't the whole point of a podcast is to have offline use?", "Numbers": "37", "Date": "February 10, 2018"}, {"Content": "Nice interface, but it weirdly deletes podcasts sometimes, and I'll have podcasts listed in the Downloaded tab that also have the \"download this podcast\" icon and will try to stream upon playing. I've also seen a few crashes while it's playing in the background.", "Numbers": "38", "Date": "February 7, 2018"}, {"Content": "I'd love to try this, but it crashes when I try to import my OPML file. Other players didn't have a problem with the file.", "Numbers": "39", "Date": "February 4, 2018"}, {"Content": "Never worked play and crash or just non responsive. Tune in works great.", "Numbers": "40", "Date": "January 31, 2018"}, {"Content": "The podcasts keep crashing, really annoying. Some podcasts don't work at all.", "Numbers": "41", "Date": "January 31, 2018"}, {"Content": "It crashes down constantly, even after I paid for the premium version.", "Numbers": "42", "Date": "January 26, 2018"}, {"Content": "Was good for a while, now unusable after recent update, freezes the moment it launches and is unrecoverable", "Numbers": "43", "Date": "January 7, 2018"}, {"Content": "Following the latest update, this app has become somewhat unusable. It crashes frequently and lags like hell. Please send another update.", "Numbers": "44", "Date": "January 10, 2018"}, {"Content": "Good design but too many bugs, it freezes all the time and i have to force stop it. It also plays random episodes despite what you have selected for playing next.", "Numbers": "45", "Date": "June 12, 2018"}, {"Content": "Updated and kept crashing on my LG g6.", "Numbers": "46", "Date": "January 9, 2018"}, {"Content": "Why did you update it so it keeps crashing?????? Great job!!", "Numbers": "47", "Date": "January 5, 2018"}, {"Content": "Since update app crashes constantly", "Numbers": "48", "Date": "January 6, 2018"}, {"Content": "Nothing loads crashes for past couple days", "Numbers": "49", "Date": "January 7, 2018"}, {"Content": "The new update just has the app crashing.", "Numbers": "50", "Date": "January 5, 2018"}, {"Content": "new update has app crashing", "Numbers": "51", "Date": "January 5, 2018"}, {"Content": "App would be 5stars if it did not crash and restart so much. I use it because I drive for most of the day and need something to listen to.", "Numbers": "52", "Date": "February 22, 2018"}, {"Content": "Unstable. Crashes on startup about half the time. Find yourself a better choice until/unless they fix this.", "Numbers": "53", "Date": "December 23, 2017"}, {"Content": "Kept crashing my phone. Note 3", "Numbers": "54", "Date": "December 27, 2017"}, {"Content": "So far so good. Doesn't crash like other podcast apps.", "Numbers": "55", "Date": "December 31, 2017"}, {"Content": "Great app. Never had a problem with it crashing. Give it a try.", "Numbers": "56", "Date": "December 28, 2017"}, {"Content": "Doesn't randomly play podcasts at inappropriate times like the other two apps I tried... Crashed on me once so far. Easy to find and add podcasts via search. UI organization is in some ways more helpful than expected and in other ways less helpful than desired. After you press play, podcasts start playing immediately, you don't have to wait for buffering. The same thing happened with jumping to different parts of a podcast. I have never experienced that in another player, it is awesome and is my favorite thing about this app. The adds are not that bothersome at all and can be immediately closed.", "Numbers": "57", "Date": "December 17, 2017"}, {"Content": "crappy. crashes the whole phone while playing. only can stop it if i restart the phone", "Numbers": "58", "Date": "December 18, 2017"}, {"Content": "I'm trying to give this a chance but this app is extremely unstable. Almost every time i open the app and select a podcast it crashes. Then it stops playing half the time when i shut off the screen, which an audio app shouldn't need the screen on to work. It also crashes when i try to delete podcasts. And some podcasts that i delete are never actually removed from the app. Add to all that, the UI isn't simple or clear at all.", "Numbers": "59", "Date": "December 16, 2017"}, {"Content": "Keeps on crashing", "Numbers": "60", "Date": "December 14, 2017"}, {"Content": "It freezes when I switch between google maps and this app", "Numbers": "61", "Date": "December 6, 2017"}, {"Content": "crashes when you open it. cant use it.", "Numbers": "62", "Date": "February 2, 2019"}, {"Content": "Looks good but when it crashes the app loses the progress made and you have to search. App crashes at least once per podcast. I'm uninstalling", "Numbers": "63", "Date": "December 1, 2017"}, {"Content": "It crashes a lot. When I lock my phone the app just crashes. And I don,t have a crappy phone, but a Huawei P10", "Numbers": "64", "Date": "December 7, 2017"}, {"Content": "Crashes on launch a lot.", "Numbers": "65", "Date": "November 30, 2017"}, {"Content": "It has been crashing all day what is going on!?!?", "Numbers": "66", "Date": "November 25, 2017"}, {"Content": "Awesome app. I've waited a couple months to give it a review. No bugs, no crashes, no BS. It's easy to use. I've had zero problems with it.", "Numbers": "67", "Date": "November 7, 2017"}, {"Content": "Frustrated with this apps performance. Audio routinely freezes up or refuses to play, especially with long postcasts (1.3-3 hours)", "Numbers": "68", "Date": "April 14, 2018"}, {"Content": "Caused my (new) Samsung J3v6 to crash twice", "Numbers": "69", "Date": "September 6, 2017"}, {"Content": "Looked like a good app but ended up being buggy. Didnt work with bluetooth head phones forward/reverse buttons and was doing a weird loop thing sobi restarted my phone and now the app always crashes right after i open it. I think it may have had to do with me spamming the rewind button (since it wasnt working). So it gotbinto a sort of rewind loop or something", "Numbers": "70", "Date": "January 17, 2018"}, {"Content": "Love that it has all my favorite podcasts. It used to crash a lot. Now I experience some lag. I suspect it's because of all the backlogged podcast episodes. The app could use a feature that automatically deletes old episodes", "Numbers": "71", "Date": "August 27, 2017"}, {"Content": "Lag lag LAAAG! It freezes! Fix and I'll change back to 5 stars", "Numbers": "72", "Date": "September 8, 2017"}, {"Content": "Easy to use and I only get a prompt to review the app when I open it, not throughout a Podcast. It hasn't crashed on me, which is also good.", "Numbers": "73", "Date": "August 17, 2017"}, {"Content": "Great app, previous one crashed repeatedly. Love the variable playback speed feature.", "Numbers": "74", "Date": "August 19, 2017"}, {"Content": "Crashing all the time", "Numbers": "75", "Date": "August 6, 2017"}, {"Content": "I like this app, but sometimes it crashes my phone completley whilst playing audio in the background. The only fix is to remove the battery. Also there is a bug with the time bar where it keeps jumping between 0 and the time shown. The first issue really needs fixing as it makes the app unusable at times.", "Numbers": "76", "Date": "August 12, 2017"}, {"Content": "So many bugs. The playback keeps screwing up (eventually leading to a crash, or me having to restart the app), and I can't seem to save things to a playlist.", "Numbers": "77", "Date": "August 4, 2017"}, {"Content": "So disappointed, continually crashes and refusing to download tried restarts, updates but still so glitchy.", "Numbers": "78", "Date": "July 13, 2017"}, {"Content": "Love this, very informative and it has never crashed or had any technical issues", "Numbers": "79", "Date": "July 14, 2017"}, {"Content": "I've really tried to give this a fair chance but tonight was the last straw. The app will randomly crash requiring me to go back and download the podcast again. Sometimes just this action will cause the player to crash. Other times the podcast will not download and play at all. Sorry guys, when it's running it is great, but the constant crashes and resets have ruined the joy I had toward this app.", "Numbers": "80", "Date": "July 4, 2017"}, {"Content": "I wish I could give 0 stars. The app crashes my phone to the point it reboots. I think an app that u press play and it's reboots your cell seconds later may be useful to someone, but surely is not what I need", "Numbers": "81", "Date": "June 30, 2017"}, {"Content": "I'm new to podcasts but like what I'm hearing so far. I just read a few reviews, I haven't had any problems with this app crashing it seems to work just fine for me. Though I'm not downloading episodes I'm just listening over data. Works great for me.", "Numbers": "82", "Date": "July 5, 2017"}, {"Content": "Crashing all the time. Uses huge amounts of battery and ram", "Numbers": "83", "Date": "July 3, 2017"}, {"Content": "So far so good, no crashes like other apps I tried, please keep this going that is so frustrating! Very user-friendly as well👌", "Numbers": "84", "Date": "June 17, 2017"}, {"Content": "Illogical format. Have to click back button over and over until you get to the home screen. No home button. Clicks into things I didn't click on. Freezes. And my main issue is that it doesn't download the episode it says it is. If I download more than one episode, it turns ALL episodes into whatever the last downloaded one was, despite being labelled as something else. Seems to want to stream and use your Internet for episodes already downloaded, illogical as the point of downloading is to listen offline. I've deleted the app now and using something else.", "Numbers": "85", "Date": "June 16, 2017"}, {"Content": "Easy to use and more importantly no annoying crashes.", "Numbers": "86", "Date": "June 9, 2017"}, {"Content": "Awesome app... Best one I've found so far... Doesn't CRASH...!!!", "Numbers": "87", "Date": "June 15, 2017"}, {"Content": "Doesn't crash when playing", "Numbers": "88", "Date": "June 21, 2017"}, {"Content": "Crash every time when I click in \" my podcast\"", "Numbers": "89", "Date": "June 2, 2017"}, {"Content": "Kept crashing/rebooting my phone!", "Numbers": "90", "Date": "June 6, 2017"}, {"Content": "I like it cos it doesn't crash (not yet) and has the option to resume the previous episodes.", "Numbers": "91", "Date": "May 12, 2017"}, {"Content": "TRUST ME ... the other apps suck, this is the best.\nIf you are looking for the most efficient Podcast app, this is it. I've downloaded all the other piles of crap. Intrusive ads, slow load times, playback issues, crashing, etc... please take my advice and download this app. Don't listen to any of the negative reviews, they almost made me second guess as well. There's a reason there's an overwhelming amount of positive ones. I would assume any negative reviews are from other developers. THANK YOU Podcast Go. \\m/", "Numbers": "92", "Date": "April 15, 2017"}, {"Content": "Overall great app, but caused allot of problems on my galaxy note 4 whenever plaing in the background, on the lock screen the phone would freeze and be unresponsive, never had any similar problems before this app and it only happens when using this app, but other than that I really enjoy it and hopefully it will be fixed with an update soon", "Numbers": "93", "Date": "April 4, 2017"}, {"Content": "I have been using this app for months. But suddenly it just opens to a black screen, freezes, and crashes 30 seconds later. Very disappointing. If this is fixed i will use the app again, until then ill find something else. Please fix it soon, i really liked this app..", "Numbers": "94", "Date": "January 10, 2018"}, {"Content": "Really like the app. Unfortunately it has not been working in my MotoG 4 plus in the past weeks. It just gives me a black screen after I open the app then crashes the application.", "Numbers": "95", "Date": "January 9, 2018"}, {"Content": "An average podcast app that does what it needs to do, however the software under the hood is buggy, particularly the part of the program that delivers the ads. The program will freeze and crash often. Occasionally will hog system resources causing my phone to become uncomfortably hot. After uninstalling, my phone battery suddenly started lasting all day again. This app is fine, but I will be looking for something better.", "Numbers": "96", "Date": "April 19, 2018"}, {"Content": "Would constantly stop in the middle of the podcast at around 20 minutes, try to load, and then crash. I listen while driving, so this was a big deal. Other apps don't do it, so it's a problem with this one in particular.", "Numbers": "97", "Date": "October 19, 2017"}, {"Content": "Its free, which is great, but the episode will sometimes stop and the app will freeze, 10sec sections are often replyed, the app doesn't really automatically keep track of which episodes have been listened to. It recommend something else, but have been too lazy and have stuck with this...", "Numbers": "98", "Date": "December 12, 2017"}, {"Content": "Really nice and easy to use app, but kept crashing my samsung j3 phone and making it turn off randomly so I had to remove it.", "Numbers": "99", "Date": "August 31, 2018"}, {"Content": "last update broke this app using Samsung S8. app will crash immediately after opening .", "Numbers": "100", "Date": "February 1, 2019"}, {"Content": "Used to be excellent, but now really really slow, constantly crashing, stops working, had to delete and install another podcast app", "Numbers": "101", "Date": "January 10, 2018"}, {"Content": "Keeps crashing, cant make a decent playlist, pushing fast forward 3 times stops the podcast.", "Numbers": "102", "Date": "February 5, 2019"}, {"Content": "My phone kept crashing when I opened the app or would be totally irresponsive", "Numbers": "103", "Date": "December 15, 2018"}, {"Content": "It just kept crashing my Android. Unusable", "Numbers": "104", "Date": "April 20, 2018"}, {"Content": "Keeps crashing, thanks for the update, im gone", "Numbers": "105", "Date": "January 5, 2018"}, {"Content": "Keeps crashing after update!", "Numbers": "106", "Date": "January 5, 2018"}, {"Content": "Nice looking app, but causes my phone to hang, crash and sometimes reboot.", "Numbers": "107", "Date": "April 16, 2018"}, {"Content": "Crashed my phone", "Numbers": "108", "Date": "May 28, 2017"}, {"Content": "Crashes when importing opml", "Numbers": "109", "Date": "September 7, 2017"}, {"Content": "Colorful, easy to navigate, doesn't crash", "Numbers": "110", "Date": "April 9, 2018"}]