[{"Content": "Best free music app on Android. I started using that app about 4 years ago. It never crashed on any of my phones. I tried 3 other apps, but always came back to this one. The only thing I'd like to see added to the app is to be able to listen to the music in my Google Drive.", "Numbers": "1", "Date": "February 25, 2019"}, {"Content": "I do love shuttle I REALLY DO, BUT ITS GETTING ON MY NERVES. THE UPDATES MADE IT EVEN WORSE. NOW IT CRASHES EVERY TEN MINUTES!!!!! Please please do something about it. if this is not fixed I'mma uninstall this app.", "Numbers": "2", "Date": "February 20, 2019"}, {"Content": "Crashes when deleting a track. Not sure if anybody else has had this issue. Other than that, would be 5/5. 4/5 for now until that issue is fixed.", "Numbers": "3", "Date": "October 2, 2018"}, {"Content": "What a waste of money. I bought the paid version becouse I wanted to cast music to google chromecast and this useless app crashes each and very time I try to cast.", "Numbers": "4", "Date": "November 28, 2018"}, {"Content": "Sometimes it freezes. Otherwise it's great.", "Numbers": "5", "Date": "November 1, 2018"}, {"Content": "Constantly crashes in the middle of a song. Very annoying", "Numbers": "6", "Date": "August 22, 2018"}, {"Content": "Keeps crashing after update", "Numbers": "7", "Date": "August 22, 2018"}, {"Content": "App crashes kind of often and consistently deletes any playlists I try to make", "Numbers": "8", "Date": "August 25, 2018"}, {"Content": "Updates might have crashed it", "Numbers": "9", "Date": "August 20, 2018"}, {"Content": "Used of sort of be the best music player I could find so far; has the best organization options, auto loads artwork, quick lyric integration, etc. My original main complaint was you cannot add an album to Up Next, but since recent updates you can't actually use the \"Up next \" button at all for anything anymore unless you select your song via search (it's currently broken). Among other things, the \"Recently Added\" tab doesn't work correctly anymore, and deleting songs freezes up the app for about a minute, sometimes deletes the file, most of the time doesn't. It's a decent music app plagued by small issues that can easily be resolved.", "Numbers": "10", "Date": "May 12, 2018"}, {"Content": "App completely freezes phone. Used app for years and it was fine previously.", "Numbers": "11", "Date": "March 1, 2018"}, {"Content": "Works great most of the time, sometimes crashes", "Numbers": "12", "Date": "May 2, 2018"}, {"Content": "Sometines when i hit the home button, the music crashes along with it. Please fix this bug", "Numbers": "13", "Date": "February 6, 2018"}, {"Content": "This latest update has ruined one of the best android music apps around. Blacklist no longer works and the app keeps crashing", "Numbers": "14", "Date": "December 25, 2017"}, {"Content": "So much better than Google Play. Overall, it has pretty much everything I want for an offline music player. Slight skips when plugging in to charge phone, but doesn't crash like Play.", "Numbers": "15", "Date": "August 20, 2017"}, {"Content": "App is a little buggy (sometimes jumps tracks randomly and freezes) but on the whole, one of the better music players on the app store. I'm going to continue to use it.", "Numbers": "16", "Date": "October 5, 2017"}, {"Content": "My default music app bar none. Love the equalizer, it actually makes a difference, particularly with Bass. Crashing issues have been solved and now it works as good as it looks.", "Numbers": "17", "Date": "July 30, 2017"}, {"Content": "Keeps asking for permissions every single time and crashes after accepting the permission ..best useless app ever", "Numbers": "18", "Date": "December 4, 2017"}, {"Content": "App has a tendency of crashing after playing at least two tracks.", "Numbers": "19", "Date": "October 3, 2017"}, {"Content": "Keeps crashing when I open albums. Please look into it!", "Numbers": "20", "Date": "September 15, 2017"}, {"Content": "Favourite offline mp3 app. Found a small bug where the app will crash if I use Google Now voice commands to try to play a song, hopefully this can be fixed!", "Numbers": "21", "Date": "May 21, 2017"}, {"Content": "So far so good, after plenty of apps making music pause by itself I've found this nice app 👌. Love the Google assistant integration but some music titles seem to crash the app and have to ask Google assistant to play music in another type of way. Please fix this.", "Numbers": "22", "Date": "June 3, 2017"}, {"Content": "I can't create playlists. The app crashes everytime i try to do so.", "Numbers": "23", "Date": "May 5, 2017"}, {"Content": "Something's the app is stops playing music or it is crashing", "Numbers": "24", "Date": "May 12, 2017"}, {"Content": "Would be amazing if it wouldn't crash every time I try locking my phone..", "Numbers": "25", "Date": "June 2, 2017"}, {"Content": "It's an amazing app! They're on top of the crashes and fix them as soon as possible. The paid version gives you Chromecast, though it doesn't work fairly well (it has issues with connectivity, but it's still a nice concept).", "Numbers": "26", "Date": "March 5, 2017"}, {"Content": "+ delete song + equalizer + download album art sometime gives wrong artist-occasional freezes playback/widget buttons - blank album art on player but shows in sidebar/widget -random playback start/stop in background - no playback, shows 0:00", "Numbers": "27", "Date": "March 29, 2017"}, {"Content": "Search Broken\nI never had a problem with this app since 2 updates ago, it was working flawlessly until then... At first, searching just got very specific, you have to type the exact name including brackets & everything (which I never had to do before)... Now when I try to search, it shows the entire library instead, making it useless, and if I search again, the app crashes.", "Numbers": "28", "Date": "December 13, 2016"}, {"Content": "Miles above the others, and no ads to boot. Used it for about a year after a friend recommended it. Haven't looked back since. Low utilization, clean UI, stable and crashless, doesn't have ads slowing down the UI. Would love to see a better rating system and bulk tag editor.", "Numbers": "29", "Date": "December 17, 2016"}, {"Content": "I loved the free version so much I decided to pay for it. Once that happened, the app started freezing and crashing constantly, making it unusable. No amount of app or phone restarts fixes the issue. I can't get a refund since I upgraded in the app. Lesson learned.", "Numbers": "30", "Date": "January 24, 2017"}, {"Content": "New update Along with the latest update the app started to crash occasionally. Additionally, the new search algorithm is really bad. It screws up in its job. 3 stars until the app is bug free.", "Numbers": "31", "Date": "December 29, 2016"}, {"Content": "My other favorite player! Love it. Just gave 4 stars due to some crashes happening randomly. Sometimes the player crashes and refuses to stop the music. And one other time I opened the app and it stopped working! Besides all of that it's one awesome music player!", "Numbers": "32", "Date": "December 29, 2016"}, {"Content": "Great Alternative to Default App I have a big flac music library and the default app would freeze up or slow down while browsing. Shuttle has had no issue with my collection so far. It also doesn't try to shoehorn me into music streaming. Works great with Chromecast! - A great alternative!", "Numbers": "33", "Date": "December 18, 2016"}, {"Content": "Shuffle is good... At crashing constantly and not doing basic functions. I am uninstalling this garbage.", "Numbers": "34", "Date": "January 5, 2017"}, {"Content": "Was perfectly good until it recently started crashing, not sure why if fixed 5 stars.", "Numbers": "35", "Date": "February 13, 2017"}, {"Content": "Keeps crashing. Fix up!", "Numbers": "36", "Date": "January 26, 2017"}, {"Content": "Amazing app but crashes when I use it with Google now", "Numbers": "37", "Date": "February 21, 2017"}, {"Content": "One of the best. Cool themes. Sometimes the app crashes.", "Numbers": "38", "Date": "March 24, 2017"}, {"Content": "Used to be fantastic, but Android 6 update broke it Shuttle used to be my to go music player, but ever since my phone updated to Android 6, it's been experiencing crashes and slowdowns. It's still usable, but no longer the seamless listening experience as before.", "Numbers": "39", "Date": "December 11, 2016"}, {"Content": "Works great... When it works\nFreezes A LOT. Every time I want to change albums it goes full retard and I have to restart it to choose a different album. Music still plays, GUI freaks out and becomes unresponsive. I've used it for over a year with no complaints, this seems to be a recent problem. I switched to google music player. I hate it, the UI is awful, but it actually works !", "Numbers": "40", "Date": "September 3, 2016"}, {"Content": "Only one Problem\nNice app! I'm using it a while but the last month there is one little thing that is very annoying.. When I start a song manually it freezes on the 9th second and then I have to press twice the pause button so that it continues playing!! But the good news is that it doesn't have that bug on the next songs.. Only in the first one.", "Numbers": "41", "Date": "October 9, 2016"}, {"Content": "It used to work fine but too freezing or unresponsive with recent releases. Also picks artwork of different song even if option is to select embedded artwork. Crashes when using chrome.", "Numbers": "42", "Date": "October 8, 2016"}, {"Content": "Was good up until earlier today there was an upate. The app crashed it erased the shortcuts I had so I could see the music and just hit play or skip a song without completely opening the app. They removed the feature completely.", "Numbers": "43", "Date": "August 21, 2016"}, {"Content": "Not stable nor smooth Edit : my phone was the issue \\\\\\\\ The layout is nice and intuitive, I liked it a lot, but sometimes makes my redmi 1s phone crash completely, and the playback isn't always smooth.... I am disappointed", "Numbers": "44", "Date": "October 19, 2016"}, {"Content": "Great design, but some flaws\nI wanted an alternative to Google Music for offline playback. Shuttle looked great, had similar and sometimes better functions (like getting album art). My problem though is that the app often crashes or freezes (especially on long tracks like podcasts). This is dissapointing as I paid for the app. I hope this can be improved but until then its hard to use because it only works half the time.", "Numbers": "45", "Date": "September 27, 2016"}, {"Content": "When it works its great. Tends to freeze slot when switching songs. Have to start it again. Might be because it can't handle too much songs in library.", "Numbers": "46", "Date": "November 1, 2016"}, {"Content": "Great, efficient music app Shuttle works great with minimal crashes. I love how it automatically finds album & artist images.", "Numbers": "47", "Date": "October 5, 2016"}, {"Content": "Crashes on all songs view", "Numbers": "48", "Date": "July 18, 2016"}, {"Content": "Started as a fantastic app, but spoiled recently Crashes on Amazon Fire 7, started to ask for money for different features, but is still quite unpolished.", "Numbers": "49", "Date": "July 11, 2016"}, {"Content": "Bug found After update app is constantly crashing. Please fix it.", "Numbers": "50", "Date": "July 13, 2016"}, {"Content": "Latest update widget problems Don't get me wrong, I really like this player, it's one of the best out there. But since the last update the widget has been crashing and doesn't display the current album art. I don't recommend updating to this version.", "Numbers": "51", "Date": "July 8, 2016"}, {"Content": "Super app but weird bug Thx for working on this great app, it is beautiful, fast, gets easily my artwork... It crashes a lot randomly on my device but I think it's not a common bug by reading the comments. + I'd like to put lyrics on songs without using software like Itunes, or merge duplicated albums.", "Numbers": "52", "Date": "April 26, 2016"}, {"Content": "Sometimes crashes while using tag editor. Add an option to enable album art in song list.", "Numbers": "53", "Date": "May 16, 2016"}, {"Content": "Crashes everytime I seem to use it Love the fact it doesnt replay songs on shuffle, but it crashes so frequently.", "Numbers": "54", "Date": "May 13, 2016"}, {"Content": "Good Very nice features and colour themes. It rarely ever crashes.What more could you ask for in a player?!", "Numbers": "55", "Date": "July 5, 2016"}, {"Content": "Add a custom color option for shuttle+. Deleted songs show up in most played and suggested song list. Add a buffer size adjustment option as the app sometimes lags for no reason at all. Sometimes atop crashes in folder tab", "Numbers": "56", "Date": "May 25, 2016"}, {"Content": "Good service but crashes occasionally On a Nextbit Robin. Occasionally crashes and requires a phone restart to work. Otherwise great.", "Numbers": "57", "Date": "May 26, 2016"}, {"Content": "Beautiful interface. This is what I've been looking for. Beautiful customizable interface, flawless playback, minimal crashing, easy to use, etc. I hope it stays on the market forever, the other apps don't come close to this.", "Numbers": "58", "Date": "June 10, 2016"}, {"Content": "I love the app and i cant deal without it but since the new update itfreezes then crashes all the time and it's so annoying, please fix this", "Numbers": "59", "Date": "May 20, 2016"}, {"Content": "Nope The app crashed and it deleted all of my songs from my favorites list. It crashes frequently and I have had enough.", "Numbers": "60", "Date": "June 3, 2016"}, {"Content": "Nice player. Crashes all the time on Samsung Galaxy s5", "Numbers": "61", "Date": "May 29, 2016"}, {"Content": "It's OK A good music app. Sometimes it automatically got crashed. this bug must be fixed.", "Numbers": "62", "Date": "May 17, 2016"}, {"Content": "Only problem is, it keeps crashing without reason, else, best music app", "Numbers": "63", "Date": "May 10, 2016"}, {"Content": "Totaly Irritated Now !! Once upon a time it was the best app which one can use for listening music. But after updating my Moto G3 to Android 6.0 the search fuction is not working and the player crashes eventually. Please fix this issue.", "Numbers": "64", "Date": "January 13, 2016"}, {"Content": "Love the app but constant crashes are an issue\nThis app is beautiful and far better designed than the Google music app. Artwork is downloaded automatically and has always been correct for me but is often low quality. My only issue is that I experience extremely frequent crashes if I use certain other apps while listening to music and occasional random crashes when I'm on the app itself. Love the app other than this.", "Numbers": "65", "Date": "January 15, 2016"}, {"Content": "Random crashes and a little slow\nThis music app is pretty awesome as you can design how you want it to look like and there are other functions that it has that other music apps don't really have. But one tiny little problem; it crashes sometimes out of the blue and sometimes it is a little too slow. The widget is not working very well either. Please fix!", "Numbers": "66", "Date": "December 24, 2015"}, {"Content": "Never Ending Crashes I seriously thought this was the best music player app in the store. Well actually I still do, but as of recently I can't seem to go on even 1 minute without it crashing. I've loved the player too much to move on to another player, please do something about the crashes.", "Numbers": "67", "Date": "January 14, 2016"}, {"Content": "Hangs and crashes a lott even after update Player plays songs in a real bad quality. Basss is majory affected. New updates have screwed it even more. Previos versions were really good.", "Numbers": "68", "Date": "January 6, 2016"}, {"Content": "App crashes constantly (Galaxy S5)\nI have been using Shuttle for over a year, but for the past month it has been crashing constantly for me. Reinstalling the app fixed absolutely nothing. I try to select a song and it just freezes and crashes, and trying to reopen the app just results in a blank screen. I was honestly considering upgrading to the paid version, but not for an app that I can't even use anymore.", "Numbers": "69", "Date": "November 12, 2015"}, {"Content": "Awesome app. Nothing compares. Love the interface customability and it's simpleness. Its very responsive in almost all cases. I only had a couple of situations when my MP3 tags were not read properly for track sorting. And sometimes, if the phone is too busy you can have the player crashed.", "Numbers": "70", "Date": "February 28, 2016"}, {"Content": "App keeps crashing I love this app and this is the only music app I have ever used for so long. But I need you fix it asap! It keeps crashing every once in a while. Very annoying.", "Numbers": "71", "Date": "March 31, 2016"}, {"Content": "Long time user I've had this app since I got my Nexus 5 (3 years) and I must say I really enjoy it! Easy to use, almost never crashes, and organizes the music well and fast. I recommend this app 100%", "Numbers": "72", "Date": "November 2, 2015"}, {"Content": "Glitchy Freezes at random times (usually when picking a new song or using the next song button). Doesn't allow me to close the app when playing in background. Always have to force stop the app to close it.", "Numbers": "73", "Date": "November 15, 2015"}, {"Content": "No problems. I havent had a single problem with it so far. I enjoy the fact i can change the colors and themes and it responds fairly well. I dont think it has ever crashed on me either. The only thing i wish it could do was weed out duplicate files/songs. But its no big deal without that feature.", "Numbers": "74", "Date": "April 15, 2016"}, {"Content": "Great player. Its really good with exceptional layout and visuals. Also very good features in the suggested and most played. However the equaliser occasionally (sometimes too often) crashes just killing the vibe of a song.", "Numbers": "75", "Date": "January 10, 2016"}, {"Content": "Crashes too often One of the better players yet it crashes when playing a new song. Also album art sometimes glitches out and it shows the same art for multiple albums.", "Numbers": "76", "Date": "January 19, 2016"}, {"Content": "Great app Tho when u download new music u need to rescan library or restart app, and *sometimes* it crashes when u open another app that plays audio so u need to reopen. But besides that it's a great app.", "Numbers": "77", "Date": "April 20, 2016"}, {"Content": "Good app but glitches Multiple albums glitch and frequent crashes hold this music app back", "Numbers": "78", "Date": "November 29, 2015"}, {"Content": "Great Simple, plays music, eq functions. Crashes sometimes but patches keep it going", "Numbers": "79", "Date": "February 15, 2016"}, {"Content": "Crash when deny permission in setting When I play a song in Player activity, go to setting to deny storage permission then I go back to shuffle (via recent app), crash occurs", "Numbers": "80", "Date": "February 10, 2016"}, {"Content": "Still crashes \"Major crash fixes\" jkjkjk still crashes and tweaks all the time. Moving to a new app", "Numbers": "81", "Date": "November 13, 2015"}, {"Content": "Amazing player full customisation Love how the app let's me customise the look of it and it totally keeps to the minimalistic nature of Android. Not much crashes and it's been an amazing and simple experience", "Numbers": "82", "Date": "January 13, 2016"}, {"Content": "Cool app Everything works fine for me a little freeze here and there but nothing serious", "Numbers": "83", "Date": "December 9, 2015"}, {"Content": "NICEEE So much better than the default, BUT it has a tendency to crash sometimes.", "Numbers": "84", "Date": "January 3, 2016"}, {"Content": "Excellent. Excellent all with great customization, and very sleek. Only issue is some crashes", "Numbers": "85", "Date": "January 11, 2016"}, {"Content": "Awesome Well organised. Very good quality, never crashes and it's ad free. You can't beat that", "Numbers": "86", "Date": "March 18, 2016"}, {"Content": "Shuffle freezes on me It freezes randomly", "Numbers": "87", "Date": "April 3, 2016"}, {"Content": "Crashes. Started crashing again...", "Numbers": "88", "Date": "April 24, 2016"}, {"Content": "Great App Fresh UI, lots of feature, but sometimes the app crash.", "Numbers": "89", "Date": "February 26, 2016"}, {"Content": "Brilliant Crashes rarely. It's wonderful. Pleasant UI", "Numbers": "90", "Date": "November 10, 2015"}, {"Content": "great app, unfortunately it keeps crashing on marshmallow :/", "Numbers": "91", "Date": "December 7, 2015"}, {"Content": "Crashes frequently", "Numbers": "92", "Date": "February 23, 2016"}, {"Content": "Perfect!! It's exactly what I was looking for. Lock screen album art remover, customizable settings and appearance... My only complain is about the amount of crashes and bugs it has lately, it drives me crazy! Fix that and I'll give a million stars Thank you :) · LG G2 ·", "Numbers": "93", "Date": "October 25, 2015"}, {"Content": "Was great till now... I absolutely love this music player but ever since the update I can't even get it to play one song without crashing. Even when the app isnt open, it constantly crashes to the point of annoyance. Please fix this!", "Numbers": "94", "Date": "October 24, 2015"}, {"Content": "Keeps on crashing Almost perfect, except after the update it keeps on crashing. Huh...", "Numbers": "95", "Date": "October 26, 2015"}, {"Content": "Crashes constantly after update Always crashing randomly now.", "Numbers": "96", "Date": "October 25, 2015"}, {"Content": "One annoying lag Annoying lag: when we swipe songs very fast in playing mode the swyping lags and freezes a lot which is not acceptable. All other players including stock ones do not have this issue. Could you please fix it?", "Numbers": "97", "Date": "October 2, 2015"}, {"Content": "Was good before Before the last update the app was very good now it crash alot whenever you do a thing. It will crash when changeing the theme make a playlist and you can't modfiy your playlist or change artwork. I wish that you can slove this because it was a good app before.", "Numbers": "98", "Date": "October 1, 2015"}, {"Content": "Decent but room for improvement.\nBest music app out there as far I'm concerned but the gapless playback needs some work and I dont understand why I have to restart a playlist from scratch if I add something I didn't mean to add to a playlist because you can't remove songs from playlists. Also the new update is really glitchy and crashes often and is laggy too. The new interface design is fine aesthetically.", "Numbers": "99", "Date": "October 7, 2015"}, {"Content": "Droid turbo - skipping & crashing\nIt says version 1.5.9 has fixed this issue but it is still happening. This is a 5 star app hands down, but this needs to be fixed to get it back to 5 stars... I've had this a long time and I love it... This issue just needs to be fixed and I will change it to 5 stars.... Update - 9/29 - this issue is becoming more and more troublesome.. Freezing, crashing, have to skip a sing each time... Please fix.. This app was the best before these issues.. All others really suck", "Numbers": "100", "Date": "October 6, 2015"}, {"Content": "Sucks Occasionally skips or replays songs even when shuffle and repeat is not on. Also randomly crashes frequently. Tried reinstalling but it still keeps doing it. Do not recommend.", "Numbers": "101", "Date": "September 25, 2015"}, {"Content": "Crashes, poor design. Ripoff\nI paid for the plus version to play folders, but the app hangs when i try to play files. The ui is not intuitive, i cant understand if its playing or not. No \"play\" button.. Its very poorly designed i can not believe it has 1m downloads. Plus it doesn't even show that i purchased the plus version on the app store. I tried refunding it, but it was classified as an in app purchase so there's no easy way.", "Numbers": "102", "Date": "September 16, 2015"}, {"Content": "BUGS Frequently crashes at the end of songs. This would be the best music app if it weren't so buggy, but its inability to play music is annoying.", "Numbers": "103", "Date": "October 22, 2015"}, {"Content": "I like it, but its been crashing a lot lately It never happened before, might be due to the new version...", "Numbers": "104", "Date": "September 30, 2015"}, {"Content": "Sometimes crashes Its also doesn't let me rearrange my music in my playlists. Plz fix", "Numbers": "105", "Date": "September 19, 2015"}, {"Content": "Great player... Some minor bugs\nI was searching for an alternative to Google play music... I found this player better than play music... A few bugs are present in the app... The app is quite a memory hog.. Runs 5 main processes while playing music.. Also scrolling in the Playlist is really not great... It like freezes after one scroll and the next scroll attempt fails... Other than really great app... Keep up the great work.!", "Numbers": "106", "Date": "September 7, 2015"}, {"Content": "Better I'm happy that this app is better then Google Play. That app has a problem with all of my music on my SD card and kept crashing. Thanks for a great app.", "Numbers": "107", "Date": "September 6, 2015"}, {"Content": "Crash App crashes everytime i press play through the widget.", "Numbers": "108", "Date": "September 9, 2015"}, {"Content": "Beautiful but Buggy It's gorgeous, customizable, and fluid to use, but it crashes and fails to start 2 out of every 3 times I try to launch it. Also it won't find any of my Google play music, is it possible to fix that? *Edit: the app also crashes when I click any lockscreen controls.*", "Numbers": "109", "Date": "September 1, 2015"}, {"Content": "I love it\nIt's my main music player, but recently it started to bug out. What would happen is I would be listening to my music and browsing my library, when it would crash. However the music would not stop playing, even after the song ended, so i would end up having to restart my phone unless I decided i wanted to listen to two songs at once. I could find no way of stopping the song other than restarting the phone.", "Numbers": "110", "Date": "September 1, 2015"}, {"Content": "The widget Every time I play a song on the widget it freezes for a few minutes and it happends every time I use the widget and I have the app open all the time and not use the widget", "Numbers": "111", "Date": "August 30, 2015"}, {"Content": "Lovely Crashes consistently when surfing Tumblr on Firefox, otherwise small and good.", "Numbers": "112", "Date": "August 31, 2015"}, {"Content": "Would rate it 5 once they fix the song skipping issue and also for some reason crashes when I try to change songs", "Numbers": "113", "Date": "August 29, 2015"}, {"Content": "Beautifully made First music app I download that does what's expected of of it. The only problem is the artwork sometimes doesn't load when I download it other than that minimal crashing. Bugs fixed smooth", "Numbers": "114", "Date": "August 20, 2015"}, {"Content": "Keeps crashing. I downloaded this music player and upgraded it to pro to replace my current one. Hoped it would be better but I see I will have to stick with my older one because it doesn't crash every 3 songs. I really like the interface and themes and organization but the crashing is terrible.", "Numbers": "115", "Date": "July 28, 2015"}, {"Content": "Crashing after update\nIt has a widget for my LG g3 circle case, and it worked fine before the update. And now after the update a every time I press it, it crashes the app, and I have to force close it. It almost a month later still no response from company about this. Going to have to delete it because it forces close on every tap with the LG G3 circle case.", "Numbers": "116", "Date": "August 5, 2015"}, {"Content": "Needs some small fixes Great app, just some small problems. My biggest gripe is that there is no 5x5 widget. It also crashes occasionally.", "Numbers": "117", "Date": "July 28, 2015"}, {"Content": "Good but bother me When i try to open a song it crashes me oftenly, please fix it. I dont mind too much but it bother so much", "Numbers": "118", "Date": "July 21, 2015"}, {"Content": "Not working Its installing but hang hoke band ho raha he, still crashed", "Numbers": "119", "Date": "August 1, 2016"}, {"Content": "Next song preloading Please add next song preloading. Also, UI freezes while the track changes.", "Numbers": "120", "Date": "August 3, 2015"}, {"Content": "Bug Every two songs i play. The app always freeze and crash. Please fix this", "Numbers": "121", "Date": "August 7, 2015"}, {"Content": "Latest update causes crashes After the latest update my One Plus running Oxygen cannot use the shuttle app as it crashes on all lengths of music after 30 seconds or less. It makes no difference if the media is paused the app still crashes.", "Numbers": "122", "Date": "July 14, 2015"}, {"Content": "Almost perfect The recent updates were suppose to fix crashes and bugs in the app, but some seem to be present even after the update. Sometimes the app will pause unknowingly in the middle of a song or stop working completely. As an app, this app is great, but the pauses and stops are irritating.", "Numbers": "123", "Date": "May 17, 2015"}, {"Content": "Terrible Very bad the app crashes every time I tap on a song ,fix this cause its a real big issue also you could have avoided yellow color for fonts and icons its terrible to look and irritates me very much. (light green would be better)", "Numbers": "124", "Date": "June 26, 2015"}, {"Content": "Love it so much! But as of late, it's been crashing constantly for seemingly no reason! I'm on a first gen moto g, and its unbearable. Please fix soon", "Numbers": "125", "Date": "June 23, 2015"}, {"Content": "This is for music lovers!!\nThis app is awesome! Much better than Google music. A problem is that the album art is giving some trouble in terms of the photo being pixelated for certain albums. Please fix and something I look forward to seeing is a really nice lock screen control widget. Something like poweramp's but better. And the stability is poor it crashes every now and again. Fix these two problems and improve the lock screen control and its perfect, I'll give you full stars. Keep up the good work!", "Numbers": "126", "Date": "April 21, 2015"}, {"Content": "Samsung S3 - Android 4.4.4 Latest update ruined the app. It crashes as soon as it is opened. Rebooting the device doesn't fix the problem. It used to be good, though.", "Numbers": "127", "Date": "May 3, 2015"}, {"Content": "Crash my music files\nI had ever downloaded Shuttle on my old phone, it was a shock because many of my mp3 files were crashed, they sounded like canary bird \"ck ck ck\" . Exactly didn't know what really happened. Now I have a new phone, two days ago I downloaded Shuttle again because this music app made me in love , I expected that previous bug wouldn't happen again but It was really wrong. It's still the same problems appears. Several musics became corrupted again. I started to believe that Shuttle is the culprit of those mess", "Numbers": "128", "Date": "August 9, 2016"}, {"Content": "Emotions turned off Still freezes on random tracks. Doesn't recognise some tags. Doesn't download covers and shows unproper ones from another files instead. Unusable.", "Numbers": "129", "Date": "April 21, 2015"}, {"Content": "Keeps crashing Awesome player, but keeps crashing when I put the app on background or randomly. Please fix it", "Numbers": "130", "Date": "July 6, 2015"}, {"Content": "Killed my Dolby Audio Setting This app disabled my Dolby Audio Setting and crashed it. Had to make a Factory Reset to solve the issue on Lenovo A6000. HORRIBLE APP THIS IS", "Numbers": "131", "Date": "May 11, 2015"}, {"Content": "Great interface, but crashes with CM 5.11 and wma on SDCARD. Not stable!", "Numbers": "132", "Date": "July 20, 2015"}, {"Content": "Not perfect but good This app is not up to the mark but quite good, it doesn't crash itself so its kinda good", "Numbers": "133", "Date": "July 13, 2015"}, {"Content": "Crashes on play This app has issues tagging album artworks and crashes when u play a song", "Numbers": "134", "Date": "July 14, 2015"}, {"Content": "Still needs more fixing on crashes and the skip feature and also needs to allow more song formats to play", "Numbers": "135", "Date": "May 9, 2015"}, {"Content": "What the heck This player is so unstable and crashed very often on my quad core CPU phone it is extremely lady just improve stability because I'm starting to love this", "Numbers": "136", "Date": "May 8, 2015"}, {"Content": "Amazing By far the best player out there. Great graphics, works with Android wear perfectly, no crashes in 2 months of use.", "Numbers": "137", "Date": "May 30, 2015"}, {"Content": "Thanks for hearing me It stoped crashing", "Numbers": "138", "Date": "July 10, 2015"}, {"Content": "It crashes when I try to play a song", "Numbers": "139", "Date": "May 9, 2015"}, {"Content": "Still it crashes sometimes", "Numbers": "140", "Date": "June 29, 2015"}, {"Content": "Best player ever\nI am really enthusiastic! This is the best player, in my honest opinion, in terms of reliability and stability! I do use it intensively and, despite of the elderly device, its performance drive me crazy. I've experienced not a single crash in 6 months. Last but not least, its material redesign in lovely. Well done!", "Numbers": "141", "Date": "April 17, 2015"}, {"Content": "great music app (but) there seems to be a bug that constantly force crashes the app if it's playing in the background while I have chrome open. other than that the in-app shuttle+ upgrade is a beautiful theme addition. hope to see this resolved but keep up the great work.", "Numbers": "142", "Date": "March 16, 2015"}, {"Content": "Great Player except... It's crashing! It keeps crashing for songs without album art. I have to restart my phone (LG Tribute) in order for it to work again! This is a five star app, and if the dev can fix this it'll get a five star review from me.", "Numbers": "143", "Date": "March 13, 2015"}, {"Content": "Please fix crashes I have to reinstall this app for the second time now, its the best music player I've ever used but it keeps giving me 'unfortunately shuttle has stopped' after a few days of reinstalling. Please fix!", "Numbers": "144", "Date": "March 26, 2015"}, {"Content": "Its a 5 star app with a bug or two here or there. Lots of features. Sort by album year is really useful for me. Crashed upon accidentally clicking shuffle all as I have alot of music.", "Numbers": "145", "Date": "March 29, 2015"}, {"Content": "Updated, but crashing has gotten worse!!! Ever since the update, it continues crashing every 2-3 minutes! Before the update it was alright, but I guess I'm going to have to uninstall until then, it was such a great app too", "Numbers": "146", "Date": "March 18, 2015"}, {"Content": "It's crashing! It's crashing every time I play a music. I hope you could fix this coz I really like this App.", "Numbers": "147", "Date": "March 13, 2015"}, {"Content": "Crashed Crashed everytime i open it. Please fix it. Its a nice player, I am willing to use it but it crashes after every second track. Upset and Disappointed.", "Numbers": "148", "Date": "March 13, 2015"}, {"Content": "Great music player\nI think this a great music player and would be worth 5 stars, but the music player crashes a lot when I use google chrome. If this gets fixed, I would gladly give 5 stars. A feature I would much appreciate being added is the ability to pick random play instead of shuffle play, so that a song can be played more than once when shuffle is on.", "Numbers": "149", "Date": "April 5, 2015"}, {"Content": "Pretty design... Good job on the design, very pretty and very easy to use. I'm on Chroma with my Nexus 6, and I am experiencing some crashes at times. I can probably try doing a logcat next time that happens. ^^", "Numbers": "150", "Date": "April 12, 2015"}, {"Content": "COULD be perfect Shuttle does a lot of things well it has an amazing user interface and being able to download artwork is great but uses way to much ram and crashes if you pick a new song to often", "Numbers": "151", "Date": "April 5, 2015"}, {"Content": "Gets better with each version! No doubt this is the best looking music player out there on the play store! Could do with a few crash fixes though....", "Numbers": "152", "Date": "March 8, 2015"}, {"Content": "Great function but crashes a lot Has great features but crashes a lot. Not sure if my device ZTE ZMAX but unusable with all the crashes.", "Numbers": "153", "Date": "March 31, 2015"}, {"Content": "Decent The Shuttle music player is a good one but the APP lags and also crashes whenever I press the like (heart shaped) button I don't know why. Also one additional feature could be the support for previous track by pressing the button thrice in the earphone controller.", "Numbers": "154", "Date": "April 9, 2015"}, {"Content": "Still freezes sometimes It still freezes while changing from one tab to another or one song to another.. and I think that it's become too much colorful now..bring back the same old UI with crashes fixed..", "Numbers": "155", "Date": "March 19, 2015"}, {"Content": "GREAT BUT This app is packed with a lot of great feaures BUT what I REALLY HATE is that it lags my phone big time to the extent that I have to turn off my phone to exit the app because it makes my phone freeze!!!! Please fix this immediately", "Numbers": "156", "Date": "April 2, 2015"}, {"Content": "I have an LG Tribute. I really love this app, but it keeps crashing for me! The app worked for awhile, but now it crashes every couple of songs! Help?", "Numbers": "157", "Date": "March 14, 2015"}, {"Content": "Crashes It's the best music app I've seen with its features and the overall look of it is is just awesome but it crashes a lot as I come out of it sometimes it crashes when I lock my screen it crashes it's awesome but it crashes", "Numbers": "158", "Date": "March 8, 2015"}, {"Content": "S4 Plays one song and then the app freezes. Love the design and the feel of the app, would buy it if there was no freezes.", "Numbers": "159", "Date": "March 9, 2015"}, {"Content": "It's really awesome! But: it crashes too often, and it'd be really great if you added automatic lyrics to the app.", "Numbers": "160", "Date": "April 6, 2015"}, {"Content": "DON'T WORK!!! After MANY attempts to do something, this app would freeze and I had to shut down my freaking tablet. I do not want anyone to think I am mean I am 10. (I know I thought it was crappy, doesn't mean it is. So, get the app if you want to :)", "Numbers": "161", "Date": "April 18, 2015"}, {"Content": "Shuttle music player This upgrade crashes part way through songs. It has a terribly long lag between forwarding to next song. I am removing upgrade!", "Numbers": "162", "Date": "April 6, 2015"}, {"Content": "Really Wanna Like It Keeps crashing after about 2 songs when my screen is off..... Wanna keep using it but really can't if this always happens. Please help", "Numbers": "163", "Date": "March 23, 2015"}, {"Content": "Crashes Every time i tried to open the app, it keeps on force closing on itself. It's frustrating knowing that i can't play my music.", "Numbers": "164", "Date": "March 21, 2015"}, {"Content": "Crashing! Keeps crashing! After a few songs, it just stops and I have force stop it so it could work again! Whyyy", "Numbers": "165", "Date": "April 11, 2015"}, {"Content": "Best music player Good performance it's customisable, easy to use. New update freezes regularly though", "Numbers": "166", "Date": "April 3, 2015"}, {"Content": "Crashes After the new update the app crashes when I disconnect a Bluetooth speaker and try to plug in headphones again.", "Numbers": "167", "Date": "March 18, 2015"}, {"Content": "High memory usage Only problem seems like the high memory usage, it goes up to 300 MB, and it causes app to crash.", "Numbers": "168", "Date": "March 24, 2015"}, {"Content": "Crash It's good, and I pretty like it, but the app is dosen't work since I download the update. I hope will be good coming soon.", "Numbers": "169", "Date": "March 14, 2015"}, {"Content": "Crash reports! Its crashing like hell!! I mean I play a song and then open up the internet and within 30 secs it crashes! *bugs* fix it!!!.", "Numbers": "170", "Date": "March 8, 2015"}, {"Content": "New update messed up album art a bit, few crashes and random shut down", "Numbers": "171", "Date": "March 19, 2015"}, {"Content": "Crashes crashes crashes I like shuttle a lot but It keeps on crashing fix it plez", "Numbers": "172", "Date": "March 28, 2015"}, {"Content": "Crashes constantly I can't even open it without it crashing after the new update", "Numbers": "173", "Date": "March 12, 2015"}, {"Content": "Crashes too much Crashes approximately every 5-7 songs. Only fix is to reboot the phone. Fix this issue.", "Numbers": "174", "Date": "March 12, 2015"}, {"Content": "Bugs Keeps crashing, and the wire control from my earphone doesn't work", "Numbers": "175", "Date": "March 20, 2015"}, {"Content": "Worked alright one day and then.. Keeps crashing on my HTC sv", "Numbers": "176", "Date": "April 18, 2015"}, {"Content": "I can't even play a song without out just crashing", "Numbers": "177", "Date": "April 13, 2015"}, {"Content": "Crashes Even after updating the app it keeps on crashing", "Numbers": "178", "Date": "March 9, 2015"}, {"Content": "Great potential wasted by the fact that it crashes every 10 minutes.", "Numbers": "179", "Date": "April 5, 2015"}, {"Content": "Use to love it It crash a lot lately", "Numbers": "180", "Date": "April 3, 2015"}, {"Content": "Latest version still crashes all of the time", "Numbers": "181", "Date": "March 9, 2015"}, {"Content": "Better than the stock player Better than the stock player but it keeps crashing after the updates", "Numbers": "182", "Date": "March 15, 2015"}, {"Content": "Crashes Still crashes when opening it", "Numbers": "183", "Date": "March 8, 2015"}, {"Content": "keeps crashing after update", "Numbers": "184", "Date": "March 17, 2015"}, {"Content": "Really simple and a great UI Sleek and useful design.Has themes,doesn't crash and has multifunctional UI", "Numbers": "185", "Date": "March 31, 2015"}, {"Content": "Keeps crashing !", "Numbers": "186", "Date": "April 12, 2015"}, {"Content": "GREAT.. ..nice UI and design but crash sometimes..", "Numbers": "187", "Date": "April 18, 2015"}, {"Content": "Keeps Crashing", "Numbers": "188", "Date": "April 13, 2015"}, {"Content": "Crashing sucks", "Numbers": "189", "Date": "March 24, 2015"}, {"Content": "Alphabetization For some reason my songs aren't properly alphabetized.. Its a little annoying to find the song and I have to search for it, but when I do, it crashes. Other than that better than google play music.", "Numbers": "190", "Date": "December 3, 2014"}, {"Content": "Songs not in alphabetical order Ever since the update the list of songs is completely random, I could have songs we that start with a L and find them in the N section. Although it does not crash, this is an annoyance. It also does not allow me to look up songs as well.", "Numbers": "191", "Date": "December 8, 2014"}, {"Content": "Solid app Still crashes when I use it in the background with bigger apps like Google maps navigation or multiple apps in the background. Very very annoying, because it freezes basically your whole phone when this happens. I like it otherwise. Simple and easy.", "Numbers": "192", "Date": "December 25, 2014"}, {"Content": "Great music app.... Good looking and outstanding...\nPlease. Fix all crash bugs and add 'go to artist ' n 'go to album' options and a lyrics downloader, similar artist to the now playing artist and lots more......and I would to suggest that the blurred and a little bit darkened artist image should be displayed on the now playing screen only on the landscape mode with the album cover and the controls above it... I think that will add to the beauty and functionality of the app... Holla from Nigeria", "Numbers": "193", "Date": "January 26, 2015"}, {"Content": "Crashes in moto g second gen it crashes when multi tasking and it doesn't show album art when connected to wifi.. idk if its my settings but i have cheaked it though. need to these bugs otherwise its good.", "Numbers": "194", "Date": "December 22, 2014"}, {"Content": "Crashing when choosing track When opening a song, an app crashes(D802-Lollipop). Strangely, when open song from file explorer with Shuttle everything works as it should. 4 star cause developer said that bugs are being polished. Overall, really good music player as lollipop option", "Numbers": "195", "Date": "February 18, 2015"}, {"Content": "One of the best but...\nThis is my absolute favourite music app. Google play music is unnecessarily complex, I just wanna get to my music and listen and this app let's me do that without extra steps. The biggest issue I'm having with it is that after I listen to a song sometimes it won't go on and play the next one and then it just crashes. Now I'm using my default music player, which I also hate, because of the app stopping after a song. Please fix this problem cause I want to use this app again!", "Numbers": "196", "Date": "December 15, 2014"}, {"Content": "Keeps crashing. I absolutely love this music player, and it worked fine for a while. But then it started crashing constantly. Every time I start it up, it stops working and it's quite upsetting.", "Numbers": "197", "Date": "January 6, 2015"}, {"Content": "equaliser crashes\nIt would be a decent app if the equaliser didnt constantly crash. I select a custom equaliser setting and the app runs fine for a few songs, but at the start of the next track the equaliser crashes and reverts back to normal setting and you can't change the equaliser setting until you restart the app.", "Numbers": "198", "Date": "February 13, 2015"}, {"Content": "Good first impression, but crashes often Really like this app. Good UI, good features, big display for album art. But it crashes frequently and even prevents the home screen from appearing when player is on and screen dims. Please fix.", "Numbers": "199", "Date": "December 2, 2014"}, {"Content": "Not so good any more...\nEarlier it used to work well, but since the Lolipop theme update, it has various problems. Sometimes the EQ doesn't respond, or after a few seconds the lockscreen commands don't work. In the recent update, the app started to crash. Emailing the developer is useless as he keeps on saying that it is the fault of the Android OS, or any custom ROM that you have installed. Used this app for around 3 years, and finally started thinking about going back to Rocket. Also, don't even think about using the dark theme.", "Numbers": "200", "Date": "December 7, 2014"}, {"Content": "amazing music player but equalizer chrashes i dont know if its just mine but whenever i try to use its equalizer the app crashes. overall great intwrface but lacks features related to audio. keep up the good work", "Numbers": "201", "Date": "December 8, 2014"}, {"Content": "Music stops when I open other apps, if fixed this app is pretty great, love the automatic filling of album art. Crashes when searching for music, deleting playlists, can't play in the background", "Numbers": "202", "Date": "December 26, 2014"}, {"Content": "Brilliant! This has to be the best music player I've used on my phone! No crashing, no stuttering nothing but fantastic sound! Oh and NO ADS :D", "Numbers": "203", "Date": "December 25, 2014"}, {"Content": "A good app Would rate it 5 stars if the folder option in the display tab could be ticked. And the player crashes every time i pressed on the 'menu' button on my phone.", "Numbers": "204", "Date": "February 15, 2015"}, {"Content": "No playlist I gove this4 stars. Great but cant make playlist. Suggestion: 1. Allow playlist. 2. In recent tab, default tones should not be included. When i make a playlist it freezes.", "Numbers": "205", "Date": "January 27, 2015"}, {"Content": "More than a simple music player\nFor some reason, the Samsung Music app on my phone crashes every time I try to open it to listen to music, which I do extensively. Needless to say I have downloaded many music applications and this app in particular has become my favorite not only for it's intuitive and great design, it also has a feature-rich equalizer and frequency settings as well as effects that are worth exploring. Out of the dozens of music apps I have tried, this one takes the cake. I will gladly pay for the upgraded version as well.", "Numbers": "206", "Date": "December 22, 2014"}, {"Content": "Keeps crashing Was fine on the first couple of time of use, but quality slowly deteriorated, I'm rarely able to get it playing and when I do... It crashes :L", "Numbers": "207", "Date": "December 4, 2014"}, {"Content": "Never had a fault with this app before, but now it crashes every few seconds and I've had to uninstall it due to the constant crash reports. Hopefully this gets fixed and I can use this again.", "Numbers": "208", "Date": "February 3, 2015"}, {"Content": "Music player freezes most of the time I use this player daily but there are times that when I pick a song, the app freezes and I can't do a thing so I have to force restart my phone. Please fix this!!", "Numbers": "209", "Date": "December 9, 2014"}, {"Content": "I love this app but it should be new update again to fix the crash or force close problem. Its always crash on my device. Please", "Numbers": "210", "Date": "November 13, 2014"}, {"Content": "Sometimes good but sometimes its NOT It works really fine before but why lately it crash frequently? I would love if next update will have a better performance", "Numbers": "211", "Date": "January 22, 2015"}, {"Content": "I really like it but It crashes as soon as you install it.... And I really like it. But might uninstall", "Numbers": "212", "Date": "December 2, 2014"}, {"Content": "Freezes often Its a very good player but it freezes an I need to reboot...fix this and 5 stars rate!", "Numbers": "213", "Date": "January 23, 2015"}, {"Content": "It lies When I'm deleting songs using this player it only removes them from playlist even though it says that it deletes them from sdcard. It also crashes frequently which never happens on other music players on worse devices.", "Numbers": "214", "Date": "November 7, 2014"}, {"Content": "Annoying... I recently got this app and I have a problem with it already, as soon as i opened the app I started searching for songs but when I searched for them nothing happened. I tried this for at least 10 minutes and still nothing happened. Then it started crashing. So now I'm deleting it", "Numbers": "215", "Date": "January 18, 2015"}, {"Content": "Crash Shuttle crash when attempt to open the equalizer feature. This only happen after I've updated my OnePlus One that includes the new MaxxAudio. Please check. Thank you.", "Numbers": "216", "Date": "February 13, 2015"}, {"Content": "Crashes constantly Seriously I've had this app for two months. Yes, I waited this long before uninstalling, thinking, \"Maybe they'll fix the bugs by the next update!\" They didn't. I'm going to uninstall right now, because I can't even get through three songs without it crashing. :P", "Numbers": "217", "Date": "December 10, 2014"}, {"Content": "Crashes Its a great app but it crashes randomly and I'll have to restart the app to get the equalizer to work. Also it shows the shuttle icon on my lock screen instead of the actual album art", "Numbers": "218", "Date": "March 22, 2015"}, {"Content": "Crashes all the time Whenever I opened browser while shuttle is playing the player crashes every time. Totally lame", "Numbers": "219", "Date": "January 27, 2015"}, {"Content": "Good app but.. Nothing wrong with the app in itself, just keeps crashing constantly especially with the widget", "Numbers": "220", "Date": "December 5, 2014"}, {"Content": "Crashes a bit, stutters, autoplays Crashes sometimes, stutters, and constantly auto plays in my pocket can't find a way to STOP this", "Numbers": "221", "Date": "December 24, 2014"}, {"Content": "Great Great app, like Google's play music but with more customization which I love, only complain that it stops playing my music at times, not sure if it crashes.", "Numbers": "222", "Date": "February 16, 2015"}, {"Content": "Crashes a lot I'm tired of it crashing for no reason while listening. Please fix.", "Numbers": "223", "Date": "December 2, 2014"}, {"Content": "Please Fix I cant access the settings. Everytime I tried to access the setting it crashes.", "Numbers": "224", "Date": "November 1, 2014"}, {"Content": "Crashing When ever I select equalizer the application gets crashed.", "Numbers": "225", "Date": "March 4, 2015"}, {"Content": "Crashes It crashes after some time of play. Please fix it", "Numbers": "226", "Date": "January 12, 2015"}, {"Content": "Crashes alot Since the new update it crashes as soon as you open it", "Numbers": "227", "Date": "March 8, 2015"}, {"Content": "Crashes frequently Everytime I open the equalizer in the app it crashes", "Numbers": "228", "Date": "February 25, 2015"}, {"Content": "Fantastic Music Player If only it didn't crash all the time. I'd make it my main music app. Otherwise this is a very sleek clean music player.", "Numbers": "229", "Date": "November 15, 2014"}, {"Content": "Crashes App crashes when u open the equaliser. Please fix it", "Numbers": "230", "Date": "February 13, 2015"}, {"Content": "Bugs Crashes often and doesn't show search results.", "Numbers": "231", "Date": "February 9, 2015"}, {"Content": "Not stable, not smooth Cannot close from notification area, crashes a lot when minimised by \"back\" button on android 4.1", "Numbers": "232", "Date": "February 22, 2015"}, {"Content": "Error: its crashing There's error in the app.", "Numbers": "233", "Date": "November 23, 2014"}, {"Content": "Crashed suddenly Suddenly doesnt work.", "Numbers": "234", "Date": "January 21, 2015"}, {"Content": "Oh noes This is my favourite music app, but it keeps crashing lately. Please do something about it :(", "Numbers": "235", "Date": "December 27, 2014"}, {"Content": "It would be nice to have numbers for the tracks, especially with the playlists,it keeps on crashing", "Numbers": "236", "Date": "December 23, 2014"}, {"Content": "? I don't know what to do it just brings me to music then crash", "Numbers": "237", "Date": "February 26, 2015"}, {"Content": "Im in Love (*^﹏^*) The album arts are awesoome....so clear and it doesnt crash and stuff...", "Numbers": "238", "Date": "November 2, 2014"}, {"Content": "Fix this Crashing always", "Numbers": "239", "Date": "November 6, 2014"}, {"Content": "It keeps crashing!!!!!! :(", "Numbers": "240", "Date": "November 22, 2014"}, {"Content": "Freezes up", "Numbers": "241", "Date": "January 28, 2015"}, {"Content": "still crashes still crashes", "Numbers": "242", "Date": "December 17, 2014"}, {"Content": "OMG Improved like it should, doesn't crash that often anymore. 👌The size shrinked also. But,the embedded album art isn't in HD. That's a flaw. And! There are no widgets :(", "Numbers": "243", "Date": "December 14, 2014"}, {"Content": "Great app Probably the best music player out there. Also very aesthetically appealing. It glitches a bit too much though; when I try to skip a song, it'll often freeze. Wasn't too big of an issue at first but now it happens way too often", "Numbers": "244", "Date": "October 14, 2014"}, {"Content": "I really love this player... but it always kept my phone freezing, caused it to crash down and shut down after a while. Sadly had to deinstall it although it is the best looking player.", "Numbers": "245", "Date": "October 21, 2014"}, {"Content": "App Crash!! Best Music Player ever!! However...app is continuosly crashing as it stops playing the songs in the midway (400 mb Of Ram still available so my Ram is not the issue) fix this problem so that i can use this wonderful app again!", "Numbers": "246", "Date": "July 23, 2015"}, {"Content": "Suddenly started crashing It was the perfect music app until now.It has been about a week that from nowhere crush.Pls fix it, it deserves 5 stars but I can't give it that because of the crushing", "Numbers": "247", "Date": "October 22, 2014"}, {"Content": "It's okay Ican't stand when I'm listening to music this app freezes then I have to restart my phone cause it also freeze my whole phone ugh...", "Numbers": "248", "Date": "October 19, 2014"}, {"Content": "After last update sometimes freezes my phone completely, I have to remove battery :(", "Numbers": "249", "Date": "October 7, 2014"}, {"Content": "Best mp3 player I love it doesn't crash and can listen to it while surfing web", "Numbers": "250", "Date": "October 7, 2014"}, {"Content": "Love this music player Three stars because the only problem I see is it crashes at times, so that needs to be fixed and looked at first. Other than that, a great music player I still recommend to anyone. =)", "Numbers": "251", "Date": "October 2, 2014"}, {"Content": "Freezes While playing, it freezes than crashes. Sometimes it'll start up again. After 5+ mins has passed. Annoying.", "Numbers": "252", "Date": "September 21, 2014"}, {"Content": "Player crashes after a couple songs. Worked fine before last update", "Numbers": "253", "Date": "October 3, 2014"}, {"Content": "Most beautiful player I want to see about the crashes. So far so good", "Numbers": "254", "Date": "September 30, 2014"}, {"Content": "It's great I love everything but it continues to crash! Needs to be fixed", "Numbers": "255", "Date": "September 21, 2014"}, {"Content": "The best ! Never crashed and never let me down :)", "Numbers": "256", "Date": "September 19, 2014"}, {"Content": "It crashes!!! And how can I remove songs from playlist??? After u leave the player on, it crashes! It suddenly stops. And is there really no \"remove from playlist\" option in this app?? I don't wanna delete the song but only to remove it from the playlist. Pls help! Thank u!", "Numbers": "257", "Date": "September 11, 2014"}, {"Content": "Crashes constantly Great music player but crashes way too often and usually multiple times in a row, was 5/5 but since updates won't stop crashing, please fix.", "Numbers": "258", "Date": "September 8, 2014"}, {"Content": "Just a few bugs When I close it erases all the artist photos and crashes time to time, but still, an awesome app :) thanks...waiting for update!!", "Numbers": "259", "Date": "August 21, 2014"}, {"Content": "Really laggy and slow at times. Takes up a lot of room and crashes a lot. I want something quick and simple. This didn't provide it", "Numbers": "260", "Date": "August 16, 2014"}, {"Content": "OUTSTANDING!!! Thanks for fixing the crash problem. Now, this player will be my favourite. :-)", "Numbers": "261", "Date": "August 15, 2014"}, {"Content": "Ever since the update I can't work the settings. The only thing that happens when go into the settings is the app crashing. Please fix this update and make it better please. Other than thatvi love the app.", "Numbers": "262", "Date": "August 9, 2014"}, {"Content": "Şöyle böyle\nCrash issues were totally driving me crazy however I'm hoping that'll come to an end with the last update. Can't seem to benefit from my headphone controller tho. I mean, seriously.. Why not?? Editing song names and all would also come in handy.. Now let's take a look at the bright side.. I love the layout and the 'recently added' section otherwise I keep forgetting what I have.. In conclusion, I WANT MY HP CONTROLLER, PLEASE..", "Numbers": "263", "Date": "June 25, 2014"}, {"Content": "Best I would tag this as the best, I have used various players but this is awesome. The only problem I face is it crashes whenever I select the most played song list. Check it guys", "Numbers": "264", "Date": "August 7, 2014"}, {"Content": "Crashes Hi there, I've noticed recently that once I switch the screen off in my moto g with KitKat 4.4.2 your app stops playing music and closes itself. For my security I use a password to access the phone. Please look into the issue. Cheers", "Numbers": "265", "Date": "June 27, 2014"}, {"Content": "Crashing issues... And i dont like the album art to be automatically assigned.", "Numbers": "266", "Date": "July 15, 2014"}, {"Content": "App was working perfectly fine since I got it. But all of a sudden it started crashing a lot. Please fix.", "Numbers": "267", "Date": "July 6, 2014"}, {"Content": "why? i have use other music players and these one i liket most but now crashes two much i wos using for mor than a year and with this update it crashes ...", "Numbers": "268", "Date": "August 4, 2014"}, {"Content": "Crash Crashed many times ..nd i hatw it", "Numbers": "269", "Date": "July 14, 2014"}, {"Content": "Htc desire x Nice music player .....but it crashes....many time....you should add feature like shake to change the song....thanks", "Numbers": "270", "Date": "July 21, 2014"}, {"Content": "Keep crashing and i really hate that !!!! Fix it plz", "Numbers": "271", "Date": "July 18, 2014"}, {"Content": "Almost Perfect\nI love everything about this app, especially the layout. My only problem is that it tends to crash quite a bit. It will crash randomly, then when I try to open it again it crashes the second I go into a song. This problem sometimes isn't fixed even after a restart of my phone so I am unsure on how it starts working again, it just does after a day or two. Without that it would be absolutely flawless EDIT: Just saw the release notes of the latest patch, that might have fixed it then.", "Numbers": "272", "Date": "May 2, 2014"}, {"Content": "I'll still be patient... for now\nI really do like the way Shuttle is laid out. It's clean and simple. I like that it gets rid of the gaps in between song & finds album covers as well as artists' photos although not all. My main concerns are the amount of crashes I get on a daily basis, after selecting a song, skipping a track, or even skipping too many tracks at a time. Some others that bother my experience is that after a playlist finishes shuffling and I try to replay the list, it only plays one track at time and when using my bluetooth headphones I can never go back to a previous track. The back button doesn't even show in the notifications tab. I'm still willing to be patient, but it is wearing thin.", "Numbers": "273", "Date": "May 3, 2014"}, {"Content": "Bad update The newest update causes my player to get stuck on playlists, not allowing me to return to the library without a force close. Also crashes at random, and will cut off some songs in the middle for no reason.", "Numbers": "274", "Date": "April 29, 2014"}, {"Content": "Poor update New update is very buggy. Can't play music, playlists and music doesn't display properly, and the app crashes very often.", "Numbers": "275", "Date": "April 29, 2014"}, {"Content": "Keeps Crashing Everytime I try to play a song it crashes.", "Numbers": "276", "Date": "April 29, 2014"}, {"Content": "Doesn't work I have several thousand songs on my device this app doesn't find any of them. Found songs Have to be in music folder for app to find them, now crashes constantly, doesn't show folders", "Numbers": "277", "Date": "April 27, 2014"}, {"Content": "Continuous crashing Constant crashing, new ads, and completely unusable for me. Used to love shuttle and used it everyday during my commute. I'm not sure why things had to change but the new version is not up to par with the old. I'm regretfully leaving shuttle for something else.", "Numbers": "278", "Date": "March 17, 2014"}, {"Content": "Ads and crash I used to like this but it sucks now. It has ads and crashes a lot.", "Numbers": "279", "Date": "March 17, 2014"}, {"Content": "It crashes after latest update. The crash occurs when i tap on a song, it plays but the app closes. Please fix it. Update: it's now fixed! Thank you devs for the fast update!", "Numbers": "280", "Date": "February 22, 2014"}, {"Content": "Crashes fixed, best music player Edit: new update fixes the problem, thank you. Its great and worked great until the most recent update. Always crashes when I play a new song.", "Numbers": "281", "Date": "February 22, 2014"}, {"Content": "Needs to fix: 1) When turning your phone, it crashes. 2) Album cover is low quality, while being a high quality (1600x1600) cover. Also, when changing the album cover, it stays the same after , and reinstalling. Please fix.", "Numbers": "282", "Date": "February 26, 2014"}, {"Content": "Recent Issues Used to be great. Now it freezes and lags a lot.", "Numbers": "283", "Date": "March 7, 2014"}, {"Content": "Fix I really like this app. But it keeps crashing. Please fix that.", "Numbers": "284", "Date": "February 26, 2014"}, {"Content": "Crashes too much Since the last update, crash, after crash, after crash! Tunes sounded like a scratched album. Adios!", "Numbers": "285", "Date": "May 16, 2014"}, {"Content": "Crashes After the latest update the player crashes after selecting a song. Very happy with the player apart from that.", "Numbers": "286", "Date": "February 21, 2014"}, {"Content": "Stop Crashing!! Good layout, but crashes every time I tap on a song!!!", "Numbers": "287", "Date": "February 21, 2014"}, {"Content": "New update sucks Crashes wen i try to open it....", "Numbers": "288", "Date": "February 21, 2014"}, {"Content": "It keeps crashing", "Numbers": "289", "Date": "February 22, 2014"}, {"Content": "Crash", "Numbers": "290", "Date": "February 21, 2014"}, {"Content": "!!! Latest update made my phone crash and restart", "Numbers": "291", "Date": "February 21, 2014"}, {"Content": "Worked Finally....Awesome Cleared My Media Storage Data.... And The Automatic Crash Stopped", "Numbers": "292", "Date": "January 27, 2014"}, {"Content": "Cuts out Cuts out aka freezes all the time", "Numbers": "293", "Date": "December 27, 2013"}, {"Content": "Good but severe stability problems Would be perfect but crashes constantly.", "Numbers": "294", "Date": "January 18, 2014"}, {"Content": "I like it! It never closes by itself or freezes my phone.", "Numbers": "295", "Date": "December 27, 2013"}, {"Content": "Plays nice with DSP now! No more crashes associated with DSP Manager and Awesome Beats, 5 stars for you - thanks!", "Numbers": "296", "Date": "December 24, 2013"}, {"Content": "Excellent! Best music player I've seen for android. So much better than original Google music app. Early versions crashed few times on my nexus 4 but recent versions are improved significantly and never crashed. UI is beautiful and you have so many options to customize it. Thank you!", "Numbers": "297", "Date": "November 7, 2013"}, {"Content": "best.music.player.ever. EXCEPT... It randomly freezes allll the time and I have to \"kill it\" in my task manager each time. It's sooo annoying! I WOULD just download a new player except that, aside from this recurring problem, this is one of the best music player apps out there! Pleeease fix :/", "Numbers": "298", "Date": "November 16, 2013"}, {"Content": "Bug It crashes", "Numbers": "299", "Date": "November 26, 2013"}, {"Content": "Good! But fix asap! I luv the player!! The only player i found to be able to import my playlist!! But it always crashes n closes like saying: shuttle unfortunately stopped working. Plzz fix soon i like this player!", "Numbers": "300", "Date": "October 28, 2013"}, {"Content": "Excellent player Found a bug where an album dissapeared from library, and when i try to play it from Recent list, Shuttle crashes.", "Numbers": "301", "Date": "October 16, 2013"}, {"Content": "Testing\nJust downloaded and testing. At first blush, the GUI is far superior to the app that came with my phone. Lots of usable settings. Search feature awesome. Genre category is really worthless. Haven't found a way to edit tags. Size of app a bit bulky. All in all, still vastly superior to what I have been using. Deleted song, it appears in Recent, tap that song, app crashes. Used PL in car 10/1/13, outstanding performance. It could use a func 2 find dups. Func of pausing when BT disconnects is excellent.", "Numbers": "302", "Date": "October 2, 2013"}, {"Content": "Perfect. Excellent work! Simple and straightforward, yet still does everything. Ability to change font size would be sooper cool... App crashes lots after a couple months.", "Numbers": "303", "Date": "November 9, 2013"}, {"Content": "Few problems Overall, I love the layout of the app and the numerous settings options. Normally it runs rather smoothly--but often it freezes and stops playing. The app needs to be restarted to resolve this problem, and that's my only qualm. Other than that, great app!", "Numbers": "304", "Date": "September 5, 2013"}, {"Content": "Crashes Cool player but it crashes all the time on my galaxy s3.", "Numbers": "305", "Date": "August 31, 2013"}, {"Content": "Fantastic\nGreat app all together one of the best I've come across, better than poweramp in my opinion. Aesthetically pleasing, great organization system, and great widget! Recent update fixed the crash problem; running smoothly now! 5 stars, great app. 3rd edit: crashing problems still there where the app forces my entire phone to restart. I really want this app to work great please fix Edit: just updated again still crashes after about 3 songs.", "Numbers": "306", "Date": "August 24, 2013"}, {"Content": "Good. Minor Problems Great App! No Playlist Feauture???? & It Every Time I Long Press On A Song Or Go To A Different App It CRASH & FREEZES. PLZ FIX", "Numbers": "307", "Date": "August 25, 2013"}, {"Content": "Good start, needs work\nI've been looking for a good looking minimal music player for a while now, and I'm quite happy with the UI. Personally, I'd like to see the option of a \"shuffle all\" button on the top of the songs tab. Changing songs by swiping the album art breaks the frame rate too often. The biggest issue I have is regarding stability. I've been toying with the app for around ten minutes and it has crashed three times already. I really wish I could recommend this but it needs a lot of polish. Nexus 4)", "Numbers": "308", "Date": "August 5, 2013"}, {"Content": "Crashes Looks nice. Well organized. Clean interface. But still has a CRITICAL BUG. Running JB on SSExpressI437. Plays music. Home screen. Notification screen. Pause playback. Resume playback. Freezes with the playbutton highlighted. Phone reboots.", "Numbers": "309", "Date": "August 7, 2013"}, {"Content": "Not that good, really. I can listen to music for a while and then it'll stop working it all freezes the widget on my status bar doesnt want to exit and the app is just blank after a while, SMH. Please fix", "Numbers": "310", "Date": "August 12, 2013"}, {"Content": "Crashes Crashes when trying to play 24/96 FLAC", "Numbers": "311", "Date": "July 24, 2013"}, {"Content": "Great when it works. Sounds good when it works. Crashed when I got an email while playing. Also will sometimes not go to the next track. I like the gapless playback.", "Numbers": "312", "Date": "July 18, 2013"}, {"Content": "Great App\nI really love this app. It's a nice clean layout. It looks good. However, lately it has been crashing on me every few days. I think it may be conflicting with another music player on my phone, I'm not sure at the moment. It's not a huge deal. The app still saves the last song I was playing and what time during the song. If I could recommend something, I'd love lyrics support, but that's just a nifty addon. :) Keep up the good work!", "Numbers": "313", "Date": "May 16, 2013"}, {"Content": "Destortion After update it crashes badly on my device forget it very badly sound created do not installed avoid it Viraj Ghadge", "Numbers": "314", "Date": "July 9, 2013"}, {"Content": "Constantly crashes I really wish I could enjoy the UI of this music app, but every time it never fails to crash. It can run for 5 minutes or 30, but the end result is an unresponsive application that bogs down the rest of my system.", "Numbers": "315", "Date": "April 14, 2013"}, {"Content": "Crash when delete song Otherwise work okay. Xperia z", "Numbers": "316", "Date": "April 14, 2013"}, {"Content": "Excellent functionality. Works fast, smooth, no crashes. Low ram usage. But it just doesn't look good, even a bit ugly IMHO. Also lyrics support is missing!", "Numbers": "317", "Date": "February 22, 2013"}, {"Content": "Fast, easy but.. To the developer : this app starts up so fast nd navigation is perfectly fast. But the problem is it directly crashes when I play any song.. I use 4.0.4. I would directly buy it if it wouldn't be crashed...", "Numbers": "318", "Date": "February 10, 2013"}, {"Content": "Great music app This is the first app I've taken the time to write a review for. Heard about Amp on reddit and tried it out. It was crashing all the time. The Dev was quick to respond and help fix my problem. For my music app needs, this app has satiated all of my desires.", "Numbers": "319", "Date": "January 14, 2013"}, {"Content": "Constant Crashing - Fixed! The problem has been fixed, eagerly awaiting new features.", "Numbers": "320", "Date": "November 21, 2012"}, {"Content": "Works well\nOverall it is pretty solid, good features, interface looks nice, I would have given it 5/5 if it weren't for one bug. If you have a file type with a supported extension, but the encoding isn't supported, the song will get skipped, which is OK. If it is part of a playlist though, it gets skipped, and then you can't skip to any song before that. If you try to skip back over repeatedly, the app crashes. Not really a big deal for me, but notice it sometimes", "Numbers": "321", "Date": "August 21, 2015"}, {"Content": "Fixed my problem\nUpdate: I uninstalled v4a (which wasn't working anyway) and google play music which was doing the same thing works now. Haven't tested this app but won't be because I'll be using google play. Original: It doesn't play my music and it crashes 90% of the time..... I'm using an att nexus 6 on 5.1 with root.", "Numbers": "322", "Date": "May 20, 2015"}, {"Content": "Very bad app change of heart.\nThis app I had it not even a hour and it caused my phone to freeze up and flicker. 4 times. This app is very unstable. Even tbough I gave this app good reviews and changing what I said about this app now being bad is telling the truth because I only had this app a hour and I exsperienced issues with this app so uninstalling. Finding a music player thats stable. And wont cause my phone to freeze up and flicker. This music player thanks but no thanks.", "Numbers": "323", "Date": "June 26, 2014"}, {"Content": "It's great, but.. When I first got this app I was overjoyed.. Bought the plus version the same day! Now there are so many issues and it crashes ALL the time.", "Numbers": "324", "Date": "September 5, 2015"}, {"Content": "I give 3 star Because the app is turning off and crashes when my phone is screen off... Please fix this bug im still using this eventhough there's still a bug. This is far the best music app ive use... Fix that bug and this will be the best music app in the playstore", "Numbers": "325", "Date": "February 26, 2015"}, {"Content": "Glitchy\nI uninstalled this app after about five months of use. It is glitchy -- freezes up, won't shuffle even when shuffle is turned on, and, a few times, would only play one song no matter how many times I tried to skip it. When I uninstalled it, my phone stopped playing email and text notifications, and I can't seem to get that fixed. If I wasn't getting a new phone soon, I'd be more upset. Bottomline: avoid.", "Numbers": "326", "Date": "May 2, 2015"}, {"Content": "Crashing with new Material Design UI Title says it all. It crashes all the time! Didn't have this problem with the old UI. The new design is OK just wish there was more space for the album art. It looks a bit too much and not as simple", "Numbers": "327", "Date": "March 22, 2015"}, {"Content": "No\nTakes approximately 30 seconds to change a song when using folders. Crashed 4 times in my first 2 hours of use. No 'select all' option to easily add numerous files to a playlist. Annoyed. Ready to give more stars as these problems are resolved. Thanks. EDIT- need select all as option as I already have playlists sorted into folders in my SD card. NEW EDIT- I just learned that the dev just finished his masters. Good for you. No more 1 star rating. Congratulations!", "Numbers": "328", "Date": "August 8, 2015"}, {"Content": "Great app but crashing problems This is a really great music player app, the best one I've ever found. However, these past days the app has been crashing like crazy, I don't really understand why bc in the first 2 weeks it worked perfectly. So please fix this problem.", "Numbers": "329", "Date": "January 3, 2015"}, {"Content": "Great looking, works well. Two issues: 1) Crashes when I open another app sometimes (like Snapchat) 2) After updating to Android Lollipop, the search feature isn't working. It doesn't display any items! Please fix!", "Numbers": "330", "Date": "January 24, 2015"}, {"Content": "Perfect - if it didn't crash! Nearly you could want in a music player. Paid version includes everything you'd want in a music player for the unreasonable price of 55p. Occasionally cuts out when multitasking.", "Numbers": "331", "Date": "November 25, 2013"}, {"Content": "No equalizer. Crashes on sgs3\nIt was a suitable media player at the time I installed it. Now I cant even use the equalizer, I can adjust it all I want and it does nothing. Sometimes when I play my music with headphones in or plugged into a stereo system, it switches to the phone speaker?! I have to quit and reopen the program to fix the problem. It crashes randomly as well. Sometimes, I get no album art even though its there. Lots of problems, so I'm uninstalling for now. Edit: Thanks for replying dev. Once the problems are fixed, I'll gladly reinstall and re-rate.", "Numbers": "332", "Date": "June 11, 2013"}, {"Content": "No obvious way to create playlist from folder Rocket Player will do it but keeps crashing during playback.", "Numbers": "333", "Date": "December 24, 2014"}, {"Content": "Great app but。。 it crashes a lot and I would love it if it displayed track numbers and how many songs I have in my library/playlist/etc。 other than that its great。 so simple yet so effective and attractive～", "Numbers": "334", "Date": "November 16, 2014"}, {"Content": "A few problems but it's great I love this app, the UI is great. My only problem is that the app constantly crashes and once it crashes it will NOT open again it just continually crash upon opening.", "Numbers": "335", "Date": "March 15, 2015"}, {"Content": "Small bug I absolutely love this music player. Probably the best out there, but the player crashes every time I go to Display settings. Every single time. Please do something about it.", "Numbers": "336", "Date": "February 4, 2015"}, {"Content": "Crashes all the time Maybe a conflict with cm locker, battery saver. HAd to uninstall. Other than that good player", "Numbers": "337", "Date": "July 10, 2015"}, {"Content": "Aaaarrggh No crash issues. But. BUT, it wipes my playlists every time my phone switches off. Have to then relist everything which is time consuming and frustrating as hell", "Numbers": "338", "Date": "December 27, 2014"}, {"Content": "Work fine Till the recent update.. when I play a song the app freezes well continuing to play and I can't stop or skip and have to reset my phone.", "Numbers": "339", "Date": "August 5, 2015"}, {"Content": "Its good One problem if you remove the widget it crashes and will not start back up", "Numbers": "340", "Date": "March 14, 2015"}, {"Content": "Doesn't work (or works all wierd)\nI like the UI, but everytime I try to play any song, it just crashes. This problem doesn't occure on ARMv8 based chipsets tho. Also if you set CPU governor on \"powersave\" Shuttle becomes pretty laggy. Almost looks like it can't run smoothly under 1GHz which is kinda weird for a simple music player like this.", "Numbers": "341", "Date": "November 21, 2015"}, {"Content": "It works sometimes... but it crashes more often than working. This is a great app and the interface is lovely but for this one reason I'm uninstalling.", "Numbers": "342", "Date": "May 13, 2014"}, {"Content": "Needs update with improvement No update realy bad. Crashes sometime", "Numbers": "343", "Date": "April 3, 2016"}, {"Content": "Crashes I freaking love it!! But it keeps crashing on me. I've uninstalled and re-installed it for the 4th time now and this time might be the last time I get it back again. Please fix this! Galaxy S3", "Numbers": "344", "Date": "February 12, 2014"}, {"Content": "Could have been good but for one annoying bug. Whenever on locksrenn and skipping to the next track, the app freezes when it doesn't find an album art.", "Numbers": "345", "Date": "March 6, 2016"}, {"Content": "Bug? I really like this music player. However, after the newest update for some reason my phone crashes at the lock screen when I have the player on and I pull down the header tab.", "Numbers": "346", "Date": "August 15, 2014"}, {"Content": "Force closed I downloaded this app 20 minutes ago and the very first time I tried to open it, it crashed! I've tried opening again multiple times and I'm disappointed because this app looked hecka cool.", "Numbers": "347", "Date": "November 14, 2014"}, {"Content": "Awesome app, crashes all the time! I love this app but it crashes all the time. Please fix this as I do love everything else about it though!", "Numbers": "348", "Date": "March 16, 2015"}, {"Content": "Great,but.... I have a broblem with equalizer function,crash everytime i use pantech sky a830", "Numbers": "349", "Date": "December 12, 2014"}, {"Content": "Crash It crashes a lot after the last update. I don't know if it's because of my device but please fix it. Thank you.", "Numbers": "350", "Date": "July 26, 2015"}, {"Content": "Love it! Very simple UI, never crashes, and works great with Google Chromecast (only available with the premium, but I believe it is worth supporting these amazing developers!) My favorite music player by far!", "Numbers": "351", "Date": "January 21, 2016"}, {"Content": "Dead search Search never ends with a nice white screen on my phone....keeps crashing....uninstalled right away....talk about NON USER FRIENDLY", "Numbers": "352", "Date": "October 18, 2015"}, {"Content": "Crashes when locked Turns off when i switch off screen, could be having a conflict with go locker", "Numbers": "353", "Date": "June 27, 2014"}, {"Content": "Shuttle music player Good app but if i was u i would download spotify instead this crashes alot and its realy noticeable and annoying but exept for that its a brilliant app", "Numbers": "354", "Date": "February 3, 2015"}, {"Content": "Buggy! Keeps crashing when I play a split track mixtape.", "Numbers": "355", "Date": "March 31, 2015"}, {"Content": "crashes Music stops too often when I'm using chrome.", "Numbers": "356", "Date": "December 24, 2014"}, {"Content": "crashes sometimes when I'm listening to my music the app will suddenly stop and i have to restart it again", "Numbers": "357", "Date": "August 14, 2015"}, {"Content": "YAY FOR THIS APP!! But.. The application is great but most of the time it would freez and then crash. Hope you'd fix it. :)", "Numbers": "358", "Date": "December 17, 2014"}, {"Content": "Crashes It's ok but keeps crashing whenever I select lyrics mode Other than that it's amazing", "Numbers": "359", "Date": "February 23, 2014"}, {"Content": "Keeps on crashing Almost every time.", "Numbers": "360", "Date": "June 9, 2015"}, {"Content": "Copacetic This app is great, the album artwork and artist images are downloaded automatically. Never crashes for me. My opinion, this app is flawless.", "Numbers": "361", "Date": "March 11, 2015"}, {"Content": "The new update ...Argghh I used to loveeee it..but after the new update, it keeps crashi ng. ..can't use it :(", "Numbers": "362", "Date": "March 13, 2015"}, {"Content": "crashes way too often for something as simple as a music player", "Numbers": "363", "Date": "August 8, 2017"}, {"Content": "The only music app I use. Love it, very reliable, no ads and doesn't crash", "Numbers": "364", "Date": "November 2, 2017"}, {"Content": "Bugs Beautiful design but it freezes and crashes often.", "Numbers": "365", "Date": "January 21, 2015"}, {"Content": "it keeps crashing please fix", "Numbers": "366", "Date": "August 28, 2015"}, {"Content": "Crash Crashes too much", "Numbers": "367", "Date": "October 9, 2016"}, {"Content": "Good Crashes sometimes, but great sound and excellent equiliser.", "Numbers": "368", "Date": "November 1, 2016"}, {"Content": "Crashing on Cm12 L5.1 😭", "Numbers": "369", "Date": "April 7, 2015"}, {"Content": "crap crashes constantly", "Numbers": "370", "Date": "September 21, 2014"}, {"Content": "Still crashed sometimes", "Numbers": "371", "Date": "November 14, 2014"}, {"Content": "Booo. Crashes", "Numbers": "372", "Date": "November 25, 2014"}, {"Content": "Dhshd It crashesss", "Numbers": "373", "Date": "March 25, 2015"}]