[{"Content": "The schedule function causes my program to crash after an attempt to remove a earlier schedule. I paid for the pro program and have not received any support after four sent messages. I have wipe the program from my phone and reinstalled multiple times with no solution. I am giving it 2 stars because the normal feature works fine although I would greatly prefer to have it work on a schedule.", "Numbers": "1", "Date": "February 1, 2019"}, {"Content": "I can't uninstall the app. It kept asking me to make it a device administrator, and so I did, to try to prevent those constant notifications. However, I now cannot stop it from being a device administrator, as settings always crashes when I try to do that, and I can't uninstall it until I stop it from being a device administrator. Long story short, don't make this app a device administrator, because you'll never be able to uninstall it.", "Numbers": "2", "Date": "September 22, 2017"}, {"Content": "The basic functions of this app works fine. But the problem is when I try to schedule my offtime, it often crash or the offtime profile doesn't start properly, so basically I can't schedule my offtime. Another problem is about the scoring system, you need to balance the scoring system between device time and phone session. And not only that, I have purchased pro but I can't make offtime account and my profile photo is not showing up. I hope the dev could fix all the problem.", "Numbers": "3", "Date": "February 18, 2019"}, {"Content": "The app worked well until both the schedule thing crashed the app when opened and that the timer on my profile resets (for ex. the clock o will change to 5 starsn the off time runs out, then it resets to 24 hours.) There isnt much I can do to fix this because the profile that loops blocks pretty much everything on my phone. Fix this and I will change to 5 stars", "Numbers": "4", "Date": "May 9, 2018"}, {"Content": "Kindly note: I have paid version of this app. Its amazing app and I use it everyday. However, since two whenever I access scheduler (I needed to change the times) the app crashes. Please fix that asap. :)", "Numbers": "5", "Date": "September 20, 2018"}, {"Content": "I am an Offtime Pro User. Whenever I click on Goals in the menu, the app crashes. Please fix this so that i can use that feature.", "Numbers": "6", "Date": "August 28, 2018"}, {"Content": "I adore Offtime and use it every day but in the last few days a few things have just stopped working. The app crashes if I try to go to the Schedule menu, and insights just told me I'd been using my phone for 1850 minutes when I'd only just picked it up. Hoping these things get fixed soon so I can get back to that seamless Offtime goodness!", "Numbers": "7", "Date": "October 27, 2017"}, {"Content": "Its a great app.However there is one way to make the offtime go away by going to the settings and changing the time you could literally get rid of the offtime.So i would suggest you to fix that and also the app seems to crash a lot please fix that too", "Numbers": "8", "Date": "January 9, 2019"}, {"Content": "I can't manage my schedules, and I haven't been able for the past month. Are you even reading the crash reports that users send?", "Numbers": "9", "Date": "August 2, 2018"}, {"Content": "I had it before and it used to work greatly. But now for some time, it keeps crashing and eventually stops doing what it should be. Please correct the bug issues.", "Numbers": "10", "Date": "December 6, 2017"}, {"Content": "I can't uninstall this app. Every time I try to remove the app from the list of device administrators, settings crashes.", "Numbers": "11", "Date": "January 30, 2018"}, {"Content": "No longer in development. Been having a problem with scheduling for months now (crashes on page load). There are no new updates since March 2017 and they don't respond to mails.", "Numbers": "12", "Date": "February 2, 2018"}, {"Content": "Right now I have reduced the rating because for some reason, everytime I access the schedule the app is crashing. Maybe it's because of a new update. But anyway, this needs to be fixed.", "Numbers": "13", "Date": "May 19, 2018"}, {"Content": "blocks me from using apps, but also doesn't let me use apps that i allowed to be accessible. crashes instead.", "Numbers": "14", "Date": "January 28, 2019"}, {"Content": "Edit: Just wasted hours, more time than it saves me, trying to configure it to behave as it should, making sure I get calls and sms, but not notifications... Sms only get's a notification at top, no sound, if you want FB/whatsapp e.tc. notifications of. Tried dosens off different setup/system options. I even miss calls now since answering maching gives me sms which I somethimes dosn't get notified off. (Unless I look)... Still running it though and wasting more time trying to configure it... Old 3 star review. Will still use it since it does it job great when it works, but it has it's bugs and it's annoying there is no feature to pause the schedule those days that will be holidays if you for example are using it to pause for focused work: Either you have to remove some days in the week or just remove the schedule in total. The premium schedule feature has some bugs to, overlaying schedule made it go wacko and just crash so I had to clear all data. All in all when you found the workarounds it works very good for my use though but I would say it needs quite some future development.", "Numbers": "15", "Date": "January 31, 2019"}, {"Content": "I loved the app but since a couple months the scheduling is crashing and the app is useless this way.", "Numbers": "16", "Date": "December 7, 2018"}, {"Content": "I used to love it but recently it ALWAYS crashes when I try to use a schedule and I've already payed for it?? Can this please be fixed!", "Numbers": "17", "Date": "December 16, 2018"}, {"Content": "crashes a lot", "Numbers": "18", "Date": "December 10, 2017"}, {"Content": "Keeps crashing", "Numbers": "19", "Date": "January 25, 2019"}, {"Content": "Buggy app. Does not play well with Samsung's phone app, won't allow access to the call management screen for an ongoing call. Goal setting screen when selected, crashes the app. Keeps reminding that daily goal is exceeded at random times during the day, hours after it actually has. Great concept, but the app needs to be improved a lot upon.", "Numbers": "20", "Date": "April 14, 2017"}, {"Content": "This app has serious usability issues. Everytime I open schedules it crashes. Not worth buying. No option to toggle each saved schedule. Totally defunct.", "Numbers": "21", "Date": "February 16, 2017"}, {"Content": "DO NOT INSTALL!!\nSince I installed this app then decided to remove it from my phone, I cannot uninstall it. Trying to remove it from the phone administrator list will cause the settings menu to crash. I emailed the developer about this issue and they basically said sorry we can't help since is Android. What type of crap is this? I installed their app and now I'm basically not allowed to uninstall it because it's written poorly. Do not install this. Many people have had this same issue and are stuck with it on their phone...", "Numbers": "22", "Date": "September 15, 2016"}, {"Content": "this app does everything that i want except block outgoing calls. so far i haven't found a way to kill/bypass it and access my blocked apps. i have an lg v10 and just saw a review that it crashes when trying to uninstall - i have android 5.1 and am able to uninstall the app (the other reviewer has android 6). PLEASE add option to block outgoing calls!! :)", "Numbers": "23", "Date": "December 8, 2016"}, {"Content": "Surely this is a crime?!\nSo you're telling me if you're using Android 6 and you give this app administration permissions it basically bricks your phone so that every time you try to remove admin permissions it crashes the settings? You better if this soon because I don't want this crap on my phone any longer. I used to use your app but after this I've lost all trust in you. And the worst part is I'm not the only one, there's so many people having this issue and you're doing nothing about it!", "Numbers": "24", "Date": "November 22, 2016"}, {"Content": "Can't get it to open Have reinstalled it many times over the past weeks and it always crashes with a message saying it'll send a message and fix the problem ASAP.... problem hasn't been fixed... :/", "Numbers": "25", "Date": "September 14, 2016"}, {"Content": "Keeps crashing on my note 7 Crashes on startup. Worked railing well on note 3, now it is useless. I'll wait a little for an update, than I'll uninstall", "Numbers": "26", "Date": "September 3, 2016"}, {"Content": "Not solid app anymore It crashes every time i open it on my galaxy s7 edge. Looking for an alternative.", "Numbers": "27", "Date": "September 8, 2016"}, {"Content": "Not great for lg g4 Reinstalled this after a while of not having it. Crashes every time I open it now.", "Numbers": "28", "Date": "August 22, 2016"}, {"Content": "App doesn't work on my S6. It just crashes", "Numbers": "29", "Date": "August 14, 2016"}, {"Content": "Crash The app is crashing. OnePlus 2", "Numbers": "30", "Date": "September 5, 2016"}, {"Content": "App crash App doesn't open on Android 6.0.1", "Numbers": "31", "Date": "August 13, 2016"}, {"Content": "Crashed Crashed on using it for the first time.", "Numbers": "32", "Date": "August 28, 2016"}, {"Content": "Since installing Offtime, Messenger consistently crashes and error/fault messages appear. This is happening even when Offtime isn't 'active' and in down time. Does this happen to anyone else? Any ideas how to stop it and Messenger bugging out? If I delete Offtime and reboot Messenger it works fine, but then reinstall Offtime it goes haywire again.", "Numbers": "33", "Date": "May 20, 2016"}, {"Content": "Keeps crashing Worked well for a while and I paid for the pro version. Unfortunately it keeps crashing every time I open it. Using a different app now.", "Numbers": "34", "Date": "November 21, 2015"}, {"Content": "1.7.5.4 crashes always 1.7.5.3 was fine", "Numbers": "35", "Date": "April 9, 2015"}, {"Content": "Might be useful Only if it work. Crashes way too often when i tried to create a profile, 3 stars because the potential in it.", "Numbers": "36", "Date": "December 27, 2014"}, {"Content": "Great app But it crashes often..please fix the bug", "Numbers": "37", "Date": "January 21, 2015"}, {"Content": "Crashes in settings Does not send sms to the caller on my nexus 5 with lollipop.", "Numbers": "38", "Date": "December 7, 2014"}, {"Content": "I WANT it to work Set up a profile, messed around with some stuff and now it crashes with nearly everything I do. It looks so interesting and useful but IT KEEPS CRASHING. Please update :c", "Numbers": "39", "Date": "October 4, 2014"}, {"Content": "Lollipop seriously incompatible The app works on lollipop but in mine it considerably slowed it down, messed up with the battery, and cause random crashes of Chrome. Uninstalling it fixed all these problems. Unfortunately. Because this is a very informative and useful app...", "Numbers": "40", "Date": "January 6, 2015"}, {"Content": "Immediate Crash Installed the app and received an immediate error message. Wouldn't function beyond the (OFFTIME) loading screen. Therefore, this isn't a review of actual functionality. I'll certainly consider reinstalling after more bug fixes. :)", "Numbers": "41", "Date": "August 17, 2016"}, {"Content": "Good app overall..... Quite unstable always crashing when I try to upload the profile pic.. also there should have been an option where we can pause the ongoing profile... Pls look into these things... This app is helping a lot. Thanks... Please fix the above issue asap", "Numbers": "42", "Date": "October 10, 2017"}, {"Content": "Android 7.0 Not working on my Nexus 6P running on Android 7.0. The screen turns black and white and the app crashes. Fix needed immediately !!", "Numbers": "43", "Date": "August 31, 2016"}, {"Content": "Keeps crashing... uninstalled it. Like the concept very much. App crashes everytime I want to whitelist or block contacts. Just uninstalled and will wait for a more stable release.", "Numbers": "44", "Date": "October 4, 2014"}, {"Content": "Keeps crashing and won't let me keep my profiles... I really wish this works, but it I cancel off time it just starts the app over from scratch", "Numbers": "45", "Date": "October 4, 2014"}, {"Content": "Not Working It is not working in my Xperia Z1. It crashes everytime with showing black screen", "Numbers": "46", "Date": "October 9, 2014"}, {"Content": "Crashed REPEATEDLY while trying to install and select the apps to block. Couldn't use it at all, period.", "Numbers": "47", "Date": "February 16, 2019"}, {"Content": "Does not work Droid turbo 2, all it did was crash", "Numbers": "48", "Date": "August 15, 2016"}, {"Content": "Once I updated it, I can't even open it without it crashing", "Numbers": "49", "Date": "August 29, 2016"}, {"Content": "Did not open Showed the logo and then just crashed.", "Numbers": "50", "Date": "September 5, 2016"}, {"Content": "It keeps crashing!!", "Numbers": "51", "Date": "April 26, 2017"}]