[{"Content": "The interace is ok, and i love using wetransfer on my laptop, but the app is absolute rubbish, crashes every time i try to open a board. my phone is new so it cant come from me. might see to solve those issues", "Numbers": "1", "Date": "January 2, 2019"}, {"Content": "Update that killed the app. Sharing directly from gallery doesnt work, keeps crashing, stupid interface.", "Numbers": "2", "Date": "September 28, 2018"}, {"Content": "New version overheated my phone and crashed it and still didn't manage to send my file. I had to uninstall the app because I couldn't cancel the upload so it would just continue to overheat. I mourn the loss of a very useful tool.", "Numbers": "3", "Date": "July 30, 2018"}, {"Content": "Amazing app. I could not live without it!! Never any issues!! Never ever crashes!! Love it", "Numbers": "4", "Date": "July 3, 2018"}, {"Content": "Very useful, easy to use, no crashes or bugs.", "Numbers": "5", "Date": "March 16, 2018"}, {"Content": "Won't complete an upload, freezes when nearly finished. Incredibly slow upload over WiFi as well. Huge wait before it fails, every time. Can't browse all files, just images, so you have to find files in your browser then share from there. Means you can't upload multiple files. Just let mobile users use the website rather than force this non functioning app on us.", "Numbers": "6", "Date": "June 16, 2017"}, {"Content": "The app has too many bugs it seems since this latest update previously all the files used to get transfer pretty fast. But now it's way too slow and sometimes crashes as well.", "Numbers": "7", "Date": "February 3, 2017"}, {"Content": "Tried the simple task of sending some photos. Crashed 3 times. Gave up.", "Numbers": "8", "Date": "December 29, 2017"}, {"Content": "It restarted my phone and took ages to uninstall. No practical use because it freezes the phone when trying to upload bigger (200+ MB) video files", "Numbers": "9", "Date": "July 27, 2018"}, {"Content": "Keeps crashing half way though and restarts from beginning. Awful.", "Numbers": "10", "Date": "February 25, 2017"}, {"Content": "Keeps crashing when loading files. Absolute trash", "Numbers": "11", "Date": "September 18, 2017"}, {"Content": "Cannot browse your files, resitricted with camera folder, keeps stopping and crashing. Very poor interface design.", "Numbers": "12", "Date": "July 11, 2017"}, {"Content": "Buggy Installed and tried to connect it to my WeTransfer Plus account. Entering in the provided numeric code crashes the app every time. Have reinstalled the app and restarted my phone. Same result each time. No good.", "Numbers": "13", "Date": "May 2, 2016"}, {"Content": "Hopeless Seems totally unusable on my note3. Worked a few months ago but now keeps stalling & crashing. .", "Numbers": "14", "Date": "April 18, 2015"}, {"Content": "Freezes at 99% Never finishes an upload, alas.", "Numbers": "15", "Date": "April 17, 2015"}, {"Content": "Doesn't work! Crashes every time I try to upload.", "Numbers": "16", "Date": "December 25, 2014"}, {"Content": "Crashes, always. Not one single file uploaded. Fail.", "Numbers": "17", "Date": "December 5, 2014"}, {"Content": "Crash all apps Camera, voice and video recording, whatsapp, wifi are crashed and did not work. After deleting the app everything is fine.", "Numbers": "18", "Date": "March 8, 2015"}, {"Content": "Not working App continually crashes on my Nexus 6P.", "Numbers": "19", "Date": "November 26, 2016"}, {"Content": "Crashes No good, slow, crashes and freezes. Go with Hightail", "Numbers": "20", "Date": "January 3, 2016"}, {"Content": "Kept crashing after choosing file to transfer and clicking next", "Numbers": "21", "Date": "March 25, 2018"}]