[{"Content": "As a beginner I am enjoying this app a lot. It is easy to use an it has plenty guided meditations. I love that it also provide meditation sounds, so you can go both ways guided or silent. It crashed one time, but I haven't have any other issues. Great app!", "Numbers": "1", "Date": "February 16, 2019"}, {"Content": "Though the app has been quite useful for me, I have one very serious complaint that it keeps on crashing. Every time I open, it the data does not load. Only the loading sign is shown. I have to reinstall the app, to actually log in. And I don't log out after every session, yet the data doesn't load. Frankly speaking I am scared of buying a premium subscription, if the app bug is not fixed. i had serious plans of getting the paid subscription after, the free trial period gets over, but ..", "Numbers": "2", "Date": "February 20, 2019"}, {"Content": "Freezes every couple of minutes ive had to close and reopen the app 3 times already and i just installed it 10 minutes ago. This is on a new phone too.", "Numbers": "3", "Date": "January 2, 2019"}, {"Content": "Great app, but starting a few weeks ago my meditations freeze about 10-15min in. I have to close the app and start over. Please fix this! Otherwise this app is awesome", "Numbers": "4", "Date": "October 24, 2018"}, {"Content": "Constantly crashing, downloads won't play, keeps thinking I haven't paid for a subscription when I have, really disappointed as in theory it sounds good!", "Numbers": "5", "Date": "August 29, 2018"}, {"Content": "This app crashes frequently, and the guided meditations are not helpful. You're better off with a free podcast and a personal reminder/calendar to help make meditation a habit.", "Numbers": "6", "Date": "July 29, 2018"}, {"Content": "I love Simple Habit, but it crashes every time I try to open and I have to forcestop. I got so frustrated a few months ago that I uninstalled it. I missed it and reinstalled it recently and it's giving the same issues. If you can fix the app crashing I would give it 5 stars!", "Numbers": "7", "Date": "June 4, 2018"}, {"Content": "Plenty of nice courses to take. You don't get cut off for not renewing your subscription. However, the volumes lack cohesivity and a sense of standardness. Also the guided meditations will crash in the middle. Also noticed the teachers talk more throughout the :guided' meditation. rather than telling you what to do then reminding you during meditation, they mostly take 5 mins to tell you what to do, so you don't get to actually meditate much. : /", "Numbers": "8", "Date": "April 17, 2018"}, {"Content": "I had some issues with the app crashing after opening and requiring a force quit before functioning properly again, but it only ever happened on start-up. I did the week long Foundations of Mindfulness series, and I enjoyed the guided meditation a lot. The app looks pretty slick too. I wish there was an option to sort or filter by Free, but I suppose that's a deliberate oversight...", "Numbers": "9", "Date": "February 18, 2018"}, {"Content": "This app seems promising. However, on my Pixel 2 (Android 8.1), it just crashes too much to be considered minimally functional, esp for a paid service.", "Numbers": "10", "Date": "June 4, 2018"}, {"Content": "Great idea and fantastic meditations, but reminder doesn't work and the app crashes fairly frequently.", "Numbers": "11", "Date": "January 28, 2018"}, {"Content": "Nice app but crashes often on startup", "Numbers": "12", "Date": "February 1, 2018"}, {"Content": "East to use. Great first 3 day instructor. Unfortunately I have to restart my phone each time I open app as it freezes. But overall a great app.", "Numbers": "13", "Date": "January 2, 2018"}, {"Content": "Great app, Great contents. But since I got premium the app crashes all the time (phone version and web version) sometimes become very slow and the meditations doesn't load, or just crashes and it needs to restart it. If this technical issue is fixed, i will give it 5 stars. Its very good. (I have a Samsung S7 edge, enough memory, good WiFi connection, I only have this issue with this app, and it started with problems after I get premium. Before that was working ok. Now its really annoying when I cannot listen the file that I wanted to)", "Numbers": "14", "Date": "November 29, 2017"}, {"Content": "It crashes after just a few seconds within my meditation. Useless.", "Numbers": "15", "Date": "October 3, 2017"}, {"Content": "App constantly freezes or gets stuck loading without ever starting a meditation. A great idea but a fatally flawed delivery.", "Numbers": "16", "Date": "March 1, 2017"}, {"Content": "It worked for few days then kept crashing so uninstalling it.", "Numbers": "17", "Date": "February 10, 2017"}, {"Content": "Crashes consistently ~1 minute into the first meditation and always after.", "Numbers": "18", "Date": "March 10, 2017"}]