[{"Content": "Desktop and Android This is the best app for planning I have found. Never crashes, syncs across all devices perfectly and is constantly updated by the author. I use it for software design, projects and anything that requires planning. One of the few I would unconditionally recommend as a professional engineer.", "Numbers": "1", "Date": "December 5, 2016"}, {"Content": "Worth it\nMy phone started crashing randomly around the time I downloaded this app. I have tried uninstalling every other app I installed around the time of this one to rule them out but still have crashes. I suspect this app but I love it so much (and don't want to lose the maps I've created) that I'm living with the crashes for it! My galaxy s2 is getting pretty old I guess...", "Numbers": "2", "Date": "October 1, 2014"}, {"Content": "amazing easy to use, saves automatically, doesnt crash, had it for 6 months and it hasnt forced closed yet", "Numbers": "3", "Date": "May 23, 2014"}, {"Content": "Great! Does exactly what it says on the tin, just wish you could control the colours/style a bit more, but its great, it doesnt crash, i have never lost work or ever had any problem with it :)", "Numbers": "4", "Date": "January 9, 2014"}, {"Content": "Best mind mapping tool found on android for xoom Offers most functionality with least hiccups. Didn't crash on me", "Numbers": "5", "Date": "October 16, 2013"}, {"Content": "Useful and easy to use. Very intuitive, never seems to crash, recommended.", "Numbers": "6", "Date": "March 25, 2013"}, {"Content": "Very nice It doesn't crash or anything.", "Numbers": "7", "Date": "January 16, 2013"}, {"Content": "Fantastic Such an easy app to use. Constantly saving so if there any crashes (none so far) then your work is safe. Using this on my Galaxy Tablet is a joy. I'm able to drag an individual box around or a selection if I choose. Highly recommended.", "Numbers": "8", "Date": "November 21, 2012"}, {"Content": "Simple but very useful This is an easy way to draw a mind map. You can go back and add notes, or move and regroup the thought balloons. Highly recommend. Not experienced any bugs or crashes.", "Numbers": "9", "Date": "September 25, 2012"}, {"Content": "ola. w. This app works as it should. No crashes. Good App, Just what i needed.", "Numbers": "10", "Date": "October 10, 2013"}]