[{"Content": "Has saved my butt so many times. Having Tiles on important items let's me track them when I'm out of the house and provides peace of mind when I suddenly can't locate something. Customer service is astounding as well The company worked with me on a reordering issue (buying from overseas) and were prompt and complete in their emails. Will be a long term customer. Update. Dropped to 2 stars. Latest version keeps crashing on my phone every four to six minutes! Very annoying!!", "Numbers": "1", "Date": "March 3, 2019"}, {"Content": "11/2018 Update from Moto phone. App now crashes all the time after recent update and isn't usable. 4/2017 Revising review. Tile has definitely made improvements. I'll continue testing, but it seems to be working more reliably. 1/2017 Samsung Galaxy s6. Be prepared to spend over one hundred dollars for bulky squares that seldom pick up your phone's Bluetooth, thus defeating the purpose of the app. I had really wanted it to work because losing things is a tremendous problem. But Tile does not help you find them because it rarely works, showing most of your Tiles as \"out of range\" most of the time. I'd encourage the tile team to test more thoroughly.", "Numbers": "2", "Date": "December 2, 2018"}, {"Content": "Does not impact function and also indefensible how changing the image of phone or tile via selecting from gallery causes the app to crash. Zero confidence in app developer incapable of not inspecting existing functions when tweaking others.", "Numbers": "3", "Date": "November 25, 2018"}, {"Content": "Where do I begin. Complete garbage sums it up nicely. Downloaded it, app crashed twice in 40 seconds. I'd only opened it twice. Finally stopped long enough to try and pair. The instructions say to click the tile logo once, it's actually a double click. Once I'd worked that out it flat out refused to pair. Reset the phone, turned the Bluetooth on and off, tried connecting through the phones system but to no avail. Extremely disappointing. Epic fail.", "Numbers": "4", "Date": "October 30, 2018"}, {"Content": "Tried to connect to my tile today. App loads super slowly and then crashes evertime I hit find. Seems like the opposite of the new update.", "Numbers": "5", "Date": "July 16, 2018"}, {"Content": "The app keeps crashing on my Android 7.0 Galaxy S6 Edge", "Numbers": "6", "Date": "May 8, 2018"}, {"Content": "Stopped working - crashes on start up", "Numbers": "7", "Date": "May 9, 2018"}, {"Content": "After past Android update the app crashes ever 2-3 minutes. Had to uninstall...... Now useless", "Numbers": "8", "Date": "April 11, 2018"}, {"Content": "Latest update only crashes on my s9", "Numbers": "9", "Date": "April 7, 2018"}, {"Content": "Uninstalling a reinstalling after a few days solved the crashing issue I experienced on my Pixel 2 xl. Now works as expected.", "Numbers": "10", "Date": "April 8, 2018"}, {"Content": "Horrible .. Save your Money. When you need it the app or tile crashes or can't find your keys . When I found my keys ( no help from tile) I tested it . I can have my keys next to my phone and search . Nothing. 90% time it doesn't locate them", "Numbers": "11", "Date": "April 6, 2018"}, {"Content": "The Bluetooth connection is constantly lost or fails to connect or disconnects, the app crashes a lot, or I can't get it to connect to the Tile, the tile dies way too quick, can't replace battery, terms of service are not consumer friendly, costly, can't track remaining battery life (so it's dead when I actually need it, Tile can remotely disable the device without warning, etc. So I'm moving on.", "Numbers": "12", "Date": "April 12, 2018"}, {"Content": "Latest update only crashes on my Nexus 6.", "Numbers": "13", "Date": "April 13, 2018"}, {"Content": "It keeps crashing now on my gs9. No idea why. I've reinstalled it twice.", "Numbers": "14", "Date": "April 13, 2018"}, {"Content": "Great product I put it on my drone to locate in case it crashes or gets lost", "Numbers": "15", "Date": "March 30, 2018"}, {"Content": "When I needed it the app crashed.", "Numbers": "16", "Date": "April 10, 2018"}, {"Content": "Current version constantly crashing..", "Numbers": "17", "Date": "April 6, 2018"}, {"Content": "The application has consistently crashed and I have not been able to actually use the application or set up the tile device.", "Numbers": "18", "Date": "December 26, 2017"}, {"Content": "After the lastest update, my Bluetooth crashes every few minutes running Android 8.0 on Nexus 6P. Uninstalling the app fixed the problem.", "Numbers": "19", "Date": "October 5, 2017"}, {"Content": "I was a huge tile fan. Now the app keeps crashing. I can't use it at all on my Samsung S8", "Numbers": "20", "Date": "August 19, 2017"}, {"Content": "$25 bucks saved me $300. Put it on my drone, then crashed it in tall grass. When I pulled up the app it gave me an option to ring the tile and I was able to find it easily.", "Numbers": "21", "Date": "June 18, 2017"}, {"Content": "Absolute Garbage. Keeps crashing on Galaxy S7. Have to replace tile every year because battery goes flat... don't bother with this one.", "Numbers": "22", "Date": "June 23, 2017"}, {"Content": "It keeps crashing Bluetooth stack on Android 7.0", "Numbers": "23", "Date": "March 7, 2017"}, {"Content": "This App Sucks! Crashes then freezes to bootup screen on my new android phone constantly. I have to remove & reinstall the phone's battery to reset it. I turned off Tile App & problem gone...defeats the purpose. And it's already a let down that you have to pay for another Tile after 1 year....Lame.", "Numbers": "24", "Date": "February 23, 2017"}, {"Content": "Buggy app. Samsung S7 Edge will *TURN OFF* Bluetooth altogether, silently, if you leave this Tile app running. Something about Tile either crashes the Bluetooth stack or turns it off -- impossible to tell why. Unfortunately, if you do NOT leave it running, the Tile is pretty useless. It will never ring the phone. Finding the tile sometimes work, but you have to run the app and leave it running for a while before it can find the Tiles. To that end, it sort-of works.", "Numbers": "25", "Date": "January 24, 2017"}, {"Content": "I can't wait to get things set up! Which is also why I'm so frustrated that I don't even get to select a tile to add before it crashes!! Fix your app!", "Numbers": "26", "Date": "January 24, 2017"}, {"Content": "I tried adding tile mate and it crashes each time i try. Only thing I've found with my tile so far are bugs and glitches in the program", "Numbers": "27", "Date": "January 21, 2017"}, {"Content": "Great My tile has been very useful, however since the last update either my tile disconnects or the app crashes when i need to use it lg v10 5 star when fixed", "Numbers": "28", "Date": "November 17, 2016"}, {"Content": "Cool concept/flawed execution Only works when phone screen is off. App constantly crashes in background rendering it unusable to find phone from tile. Constantly shows out of range even when testing across a room.", "Numbers": "29", "Date": "November 27, 2016"}, {"Content": "Crashing App is currently crashing when I try to launch it. I'm running Android 6.0.1 on the Samsung Galaxy S6.", "Numbers": "30", "Date": "September 29, 2016"}, {"Content": "Terrible on lg g3 running marshmallow Causes Bluetooth to start crashing repeatedly after a few hours of being installed, without failure, unless wifi is disabled. When I uninstalled tile (all 3 times) all is fine. Almost unusable", "Numbers": "31", "Date": "September 3, 2016"}, {"Content": "This app used to work fine, but now it crashes everytime I open it. All that has changed is I have upgraded to a new higher spec phone.", "Numbers": "32", "Date": "August 30, 2016"}, {"Content": "Not Reliable Great idea poor execution. The app crashes more often than not.", "Numbers": "33", "Date": "August 29, 2016"}, {"Content": "For some reason, the app crashed while adding my Tile, so I contacted them and in (literally) 2 minutes, everything was working well. It helps you find your keys (or something else) and your phone easily, it's pretty simple. I'm gonna get one for my mom too :D Recommended!", "Numbers": "34", "Date": "July 26, 2016"}, {"Content": "This app sucks\nDon't waste your money. The battery only lasts about 6 months and the app crashes all the time. It says it just saw my keys and purse 1min ago , but can't locate it when I press it to find my items. I notified customer support and they said to turn Bluetooth off and close the app then turn on Bluetooth and open the app to try again. It worked once like that. I've uninstalled and re-installed the app and sometime that works. I lost my phone for a whole day because the tile couldn't reach it. Brand new tiles.", "Numbers": "35", "Date": "July 30, 2016"}, {"Content": "Wonderful app for an absent minded person Although it does crash a little more than I would like overall it is saving me on my vacation trip with tracking stuff in all the hotel room changes", "Numbers": "36", "Date": "June 29, 2016"}, {"Content": "Great app! It does what's supposed to do quite well. No crashes. Great product! It's very useful.", "Numbers": "37", "Date": "July 9, 2016"}, {"Content": "Crashes/Unusable on Galaxy S5 Please fix. My first time using app and it crashes regardless of which option I select. I'll gladly change my review score once it works. Thank you.", "Numbers": "38", "Date": "January 6, 2016"}, {"Content": "Marshmallow used to crash, now find button doesn't work. Otherwise app is designed well. Update: fixed in marshmallow 6.0.1", "Numbers": "39", "Date": "January 20, 2016"}, {"Content": "App always crashes on log in, can't even set up my tile.\nI was given my tile as a gift because I always lose my keys. Too bad that in the month that I've had this product I can't even use it because the app has never once worked. Always crashed on log in and I've sent multiple reports on the crashes with no response. What a waste of a gift. Samsung Galaxy s5 Sport", "Numbers": "40", "Date": "January 15, 2016"}, {"Content": "Crash On the galaxy s5 when you click the app it goes to the main screen but freezes and doesn't allow you to click anything then crashes.", "Numbers": "41", "Date": "December 23, 2015"}, {"Content": "Crashes immediately Got given this as a gift and went to set it up. Crashes immediately once you get to the log in/sign up page. So far not recommeneded", "Numbers": "42", "Date": "January 24, 2016"}, {"Content": "Bad app The app crashes as soon as you press anything on the screen on my galexy s5", "Numbers": "43", "Date": "December 23, 2015"}, {"Content": "Doesn't work App crashes before I can even sign in. Not compatible with S5", "Numbers": "44", "Date": "December 26, 2015"}, {"Content": "Doesn't work App crashes immediately.. Galaxy S5", "Numbers": "45", "Date": "December 26, 2015"}, {"Content": "Galaxy S5 App freezes and then crashes. Waste of money.", "Numbers": "46", "Date": "December 28, 2015"}, {"Content": "Crashes Does not work. Crashes when I try to sign up.", "Numbers": "47", "Date": "December 26, 2015"}, {"Content": "App crashing every time Bought the tile already 😒", "Numbers": "48", "Date": "February 10, 2016"}, {"Content": "Crashes Great concept if it worked! Galaxy S5 Neo can't get past login", "Numbers": "49", "Date": "December 29, 2015"}, {"Content": "Crashes instantly S5 lollipop. Crashes immediately after opening. Can't even sign up or login.", "Numbers": "50", "Date": "December 14, 2015"}, {"Content": "Crashes on Marshmallow.", "Numbers": "51", "Date": "November 29, 2015"}, {"Content": "Crashes instantly Just bought tile and the app opens but once you click Sign On sign up or click on the video it instantly crashes. I guess I'll never get to use this thing.", "Numbers": "52", "Date": "November 18, 2015"}, {"Content": "App doesn't work I bought tile for 25$ and app crashes instantly. Update the app, then I'll change my rating.", "Numbers": "53", "Date": "October 30, 2015"}, {"Content": "Rubbish Constantly crashes my phone and no way to unregister it. Wouldn't trust it to find itself, which it frequently doesn't. Avoid.", "Numbers": "54", "Date": "August 12, 2015"}, {"Content": "Neat gadget gear! It has worked prior to the several updates. Now, shortly after the app is opened, my Bluetooth crashes. Fix this issue as it is a decent product", "Numbers": "55", "Date": "February 14, 2015"}, {"Content": "CM12 and Note 3 Runs initially, then crashes BLE and I have to reboot.", "Numbers": "56", "Date": "December 25, 2014"}, {"Content": "Great Stile\nPun aside, it's an excellent little app with well thought out user journey's and experience. There were some technical glitches when pairing my Tile the first time, it didn't connect, then when it did connect on my second attempt it didn't show up in the list of paired devices. It also crashed when I took a photo of my second tile'd keys. Come the third and fourth however, it was super fast and faultless! I'm very happy with it!", "Numbers": "57", "Date": "December 18, 2014"}, {"Content": "Fix your app! Keeps crashing my Bluetooth. LG G2. Deleted until I hear back from you. Update: Quick reply from support staff and working with them for a resolution. Changed to 5 starts for the outstanding customer service.", "Numbers": "58", "Date": "February 26, 2015"}, {"Content": "Sign up fail 4 times. Then when I finally get it working it crashes. Good thought, but no go.", "Numbers": "59", "Date": "December 12, 2015"}, {"Content": "Crashes. Crashes. Crashes. Samsung Galaxy S5 running 5.0 gets to start screen and crashes. Totally useless. At least I have 4 very expensive key fobs.", "Numbers": "60", "Date": "February 5, 2016"}]