[{"Content": "This could be a great app if it didn't crash and the tools worked. It's a real faff!", "Numbers": "1", "Date": "February 6, 2019"}, {"Content": "app takes great photos, but it works is non-intuitive and have bugs. Sometimes applied filter make change to photo, it shows in previews in the gallery oka, but then you open photo again, it opens without filter. I don't understand how to use albums and gallery functional. Why i can't open image in full size and why images open by long press not double tap. Why photos not load into phone gallery by default and I must export it (two same files in memory) Some freezes even on top smartphone", "Numbers": "2", "Date": "February 4, 2019"}, {"Content": "a bit of uncharted territory,inline help wise. app crashes sometimes, but that's not unexpected after a rewrite. took me 5 minutes to find myself familiar with the controls after that it was pure joy to photograph everything. nice textures and filter. recommended purchases: all filter, all textures. both for ~10€ at time of writing. best this side of Adobe lightroom.", "Numbers": "3", "Date": "December 23, 2018"}, {"Content": "I honestly feel that you are planning to shut this app down. There have been no new updates for a very long time. I love using this app but lately it crashes everytime I open it. And pictures aren't getting saved either. They get saved as blank grey images. If you are shutting down this app then please do it already. And if that is not plan then please do something about the frequent crashes.", "Numbers": "4", "Date": "October 11, 2018"}, {"Content": "Xperia XZ here, working with this app is a bit difficult. The loading ( or transitioning ) is a bit slow in this app with those real-time effects viewing. Hopefully it will get better and much more smoother later on. As for now, every transitioning that you made feel like it is about to crash! Just choosing the settings/effects to get ready for a photo shooting is not easy ( as it isn't snappy/smooth).", "Numbers": "5", "Date": "March 19, 2018"}, {"Content": "This app will crash the s*** out of your phone like no other", "Numbers": "6", "Date": "September 19, 2018"}, {"Content": "Default camera with monochrome imaging is far far better than this. Even this app is slow, sometime crashes. Devices : Samsung Galaxy J7 2016, J7 Pro 2017, Moto G5 plus, LG G6.", "Numbers": "7", "Date": "January 21, 2018"}, {"Content": "Amazing app, would be great to be possible to take photos with volume key or fingerprint. *sometimes it freezes and doesn't click :/", "Numbers": "8", "Date": "September 5, 2017"}, {"Content": "Newer version just crashed in phone, Please solve it", "Numbers": "9", "Date": "May 29, 2017"}, {"Content": "But when set to auto export to camera album, it will crash after take picture and the image doesn't save. As well when tap to focus, the focus area is not at the same spot you tap, worse is after tap crash. And the view finder doesn't show actual crop. Note 3.", "Numbers": "10", "Date": "May 15, 2017"}, {"Content": "crashes a lottt, everytime i take photo with this app crashes everytime", "Numbers": "11", "Date": "March 14, 2017"}, {"Content": "The app crashes many times... And do not saves photos in the drive.... If you fix then it may be the app of 5 stars..... This only get lagged nothing else....", "Numbers": "12", "Date": "February 26, 2017"}, {"Content": "Heads freezes not handy and featured.", "Numbers": "13", "Date": "February 15, 2017"}, {"Content": "Great but... The app is awesome, but there is a very annoying bug, it keeps asking for permissions to the photos, and when I upload a photo that wasn't made with the built-in camera app, the photo crashes and I can't edit it", "Numbers": "14", "Date": "January 10, 2017"}, {"Content": "Crashing again and again", "Numbers": "15", "Date": "January 3, 2017"}, {"Content": "Always crashing when taking photo. It is good with editing b/w photos. It just the camera ALWAYS crashes and the image don't get saved all the time.", "Numbers": "16", "Date": "October 25, 2017"}, {"Content": "Unresponsive Everything is ok untill i take a photo. The app crashes", "Numbers": "17", "Date": "December 21, 2016"}, {"Content": "It crashes after each click.... not able see or save any pic...", "Numbers": "18", "Date": "May 1, 2017"}, {"Content": "Crashing too much", "Numbers": "19", "Date": "January 30, 2018"}, {"Content": "Crashes on android 7.1.1", "Numbers": "20", "Date": "January 30, 2017"}]