[{"Content": "Crash when open any article", "Numbers": "1", "Date": "December 23, 2018"}, {"Content": "This app is persistently most horrible, the passages you highlight don't remain highlighted, the highlights and responses don't update in your profile, I've contacted support multiple times and they did absolutely nothing about it. The app crashes too.", "Numbers": "2", "Date": "December 4, 2018"}, {"Content": "Were there a zero star an option, this app would be aptly awarded so. In the year of 2018, this app, which a whole lot of us pay for, mind you! still gets crashing & malfunctioning, every few articles or so! Great job irritating tf out of the readers, you good for nothings!", "Numbers": "3", "Date": "November 21, 2018"}, {"Content": "Sering ngecrash :(", "Numbers": "4", "Date": "January 1, 2019"}, {"Content": "Its terrible.crashes alot on galaxy note4", "Numbers": "5", "Date": "November 22, 2018"}, {"Content": "crash on droid turbo", "Numbers": "6", "Date": "November 7, 2018"}, {"Content": "I really wish this app had a history tab where you can see what you have read... So when the app crashes or you switch to another app for a bit and the OS decides to kill it at least you'll have a way to go back to where you were. The moment you get this I'll be the happiest user ever :)", "Numbers": "7", "Date": "October 28, 2018"}, {"Content": "Keeps crashing on my phone when reading an article", "Numbers": "8", "Date": "November 11, 2018"}, {"Content": "App crashing when i click on any story inside stats", "Numbers": "9", "Date": "September 24, 2018"}, {"Content": "Bottom line, the Medium app works great for reading interesting content and interacting with writers and readers. I like the way it allows me to follow favorite writers and topics. It rarely (if ever) crashes. I'm not sure about how the Medium subscription model works, exactly, but that's not an app problem.", "Numbers": "10", "Date": "September 27, 2018"}, {"Content": "I love medium website and I was so happy when I saw the android app for it. For some reason this app keeps on crashing on Oreo 8.0 (Samsung S8) please fix it to make it awesome again.", "Numbers": "11", "Date": "September 30, 2018"}, {"Content": "Overall i liked the app. But i found a bug when ever i scroll down till the end, some times it just crashes", "Numbers": "12", "Date": "September 26, 2018"}, {"Content": "Great sleek app that keeps you wanting to read more. But keeps crashing when opening medium links from email or browser.", "Numbers": "13", "Date": "September 29, 2018"}, {"Content": "not crashing anymore. will update once I use the app", "Numbers": "14", "Date": "September 13, 2018"}, {"Content": "It crashes/closes on tablet when scrolling down to the end.", "Numbers": "15", "Date": "September 18, 2018"}, {"Content": "Crashes all the time", "Numbers": "16", "Date": "September 12, 2018"}, {"Content": "I like the website version of this and hoped to have it on my phone. I've tried all day to log in into my account using the email address, but it doesn't allow it and it keeps crashing. I've tried many times, uninstalled and reinstalled it, rebooted my phone, but nothing seems to work.", "Numbers": "17", "Date": "August 21, 2018"}, {"Content": "Garbage. Requires account to read anything. Couldn't sign in via Google, app crashed on opening from any medium url. Awful first time UE, will stick with website", "Numbers": "18", "Date": "August 8, 2018"}, {"Content": "I absolutely love this app. it is pretty easy to use, does'nt crash and works seamlessly. I installed it last week. Prior to installation, I used the web version, but once I installed the app. I realised it was better a lot more user friendly than the web version (even though that works well too) but I do prefer the app. Tons of stories to read and seamless switch between categories. If you are registered, publishing your own stories is just as easy. Love it. p.s. I am not even being paid to write this. lol.", "Numbers": "19", "Date": "August 6, 2018"}, {"Content": "Still the app crashes sometime when the profile is being opened.", "Numbers": "20", "Date": "November 13, 2018"}, {"Content": "Does everything i need, which is crashing, and crashing and crashing as early as the login page. Would had given more stars if i could actually use it. Till they fix it im sticking to flipboard.", "Numbers": "21", "Date": "April 24, 2018"}, {"Content": "SenCrashing everytime..Sent feedback. Please check crashes on developer account.", "Numbers": "22", "Date": "April 5, 2018"}, {"Content": "On my latest version, i can't read stories. Everytime i tap (using touchscreen), it will leave a blank page and then for seconds back to previous page (either home or search). Is it possible because i only register using email or it is because the app itself have some minor problem and crash? I still giving it four star because it's good and giving in-depth articles but please fix it. Thank you.", "Numbers": "23", "Date": "March 26, 2018"}, {"Content": "I love medium, but the app makes me sad. It crashes everytime I try scrolling down any profile. I have tried reinstalling but it didn't help. I think I should resort to web browser for medium.", "Numbers": "24", "Date": "March 25, 2018"}, {"Content": "I downloded it twice and it made my phone crash with a Touchwiz bug both times. Love medium, hate the bugs!", "Numbers": "25", "Date": "March 28, 2018"}, {"Content": "Medium doesn't open, Infact crashes when opening a link from chrome. But I just couldn't give it less than 4 stars because I love it so much", "Numbers": "26", "Date": "March 6, 2018"}, {"Content": "Crashing on startup and \"oops something went wrong\" if I try to reinstall and log in.", "Numbers": "27", "Date": "May 9, 2018"}, {"Content": "Crashes too much", "Numbers": "28", "Date": "February 28, 2018"}, {"Content": "Crashing every single time I use it!", "Numbers": "29", "Date": "March 1, 2018"}, {"Content": "Update, the last update doesn't let me scroll down my profile, it just crashes", "Numbers": "30", "Date": "March 8, 2018"}, {"Content": "The app is solid with quality content. My issue though is that when \"Reading List\" is tapped, the app crashes and that is a major issue for me as I am unable to access my bookmarks. I strongly advice to take care of this bug.", "Numbers": "31", "Date": "February 12, 2018"}, {"Content": "Great recommendations, simple and straightforward to use, never had a single issue with it crashing or not working correctly. Basically, a great example of what apps how be designed and implemented.", "Numbers": "32", "Date": "February 12, 2018"}, {"Content": "Really enjoying Medium with such variety and insightful and engaging content. App crashes now and then which is a drag but the posts please.", "Numbers": "33", "Date": "January 20, 2018"}, {"Content": "Every time I installed it on my Galaxy J3 my phone UI got crashed.I don't know what to do..", "Numbers": "34", "Date": "December 13, 2017"}, {"Content": "App is crashing when I open an article. Samsung galaxy tab 4", "Numbers": "35", "Date": "November 17, 2017"}, {"Content": "Tried to sign in with my Facebook account but the app just freezes and all the buttons and text fields disappear. Disappointing.", "Numbers": "36", "Date": "November 16, 2017"}, {"Content": "5 seconds into my first article the app crashed.", "Numbers": "37", "Date": "November 22, 2017"}, {"Content": "Content is great, but running on LG L22C / Android 5.0.1, consistently crashes to home screen on opening certain articles. (My carrier doesn't allow OS updates, so that's not an option. ) The crashes are very annoying, use app less than I would like to. Contacted Medium about the issue, but no fix yet.", "Numbers": "38", "Date": "October 25, 2017"}, {"Content": "The only problem is that it crashes opening stories to read from Google cards.", "Numbers": "39", "Date": "November 4, 2017"}, {"Content": "If some people were able to be responded to and other people were not, that would not give it a perfect rating. Add to that it sometimes just crashes in the middle of stuff.", "Numbers": "40", "Date": "October 22, 2017"}, {"Content": "After coming back to the app, the app freezes and I have to restart the app, find the article again..", "Numbers": "41", "Date": "November 6, 2017"}, {"Content": "Very annoying when the app crashes after typing an elaborate comment and everything is gone! It happened exactly when I tried to select my text to make a copy as backup. Ironic", "Numbers": "42", "Date": "October 4, 2017"}, {"Content": "App is not starting at all. I click on get started and after that it comes back to same page and then didn't go any where. It's crashing pathetic experience.", "Numbers": "43", "Date": "September 21, 2017"}, {"Content": "Short easy read articles that are packed with inspirational and interesting facts, wisdom, and advise. I look forward to scrolling through the suggested reads. No crash issues Galaxy s7......great app!", "Numbers": "44", "Date": "September 22, 2017"}, {"Content": "It keeps crashing. I am using a OnePlus.", "Numbers": "45", "Date": "September 27, 2017"}, {"Content": "It crashes a lot", "Numbers": "46", "Date": "September 2, 2017"}, {"Content": "Crash.", "Numbers": "47", "Date": "August 26, 2017"}, {"Content": "Very well relevant selection of articles. The app has a nice light feel, good functionality and so far hasn't crashed or lagged.", "Numbers": "48", "Date": "October 3, 2017"}, {"Content": "Previous version was working really well. But new updated version is not starting and is crashing during app launch only. If I cannot open the app then what is the point of having all these features of stories and premium version. First you should focus on building strong backend", "Numbers": "49", "Date": "August 23, 2017"}, {"Content": "I liked the app but after too many silent crashes when viewing articles I've decided to uninstall.", "Numbers": "50", "Date": "August 19, 2017"}, {"Content": "Crashes a lot", "Numbers": "51", "Date": "August 6, 2017"}, {"Content": "It crashes all the time when I come from Google suggestions", "Numbers": "52", "Date": "July 23, 2017"}, {"Content": "Why do you need contacts permission to login with google? The app is completely lost if I decline it checking never to ask again. Either there is something you are not telling me, or something went wrong. I cant login to my account so I can't use your product. Now it is even worse, it keeps crashing and I can't open any article and because you register as default client app, I can't read the stories I'm interested in.", "Numbers": "53", "Date": "July 18, 2017"}, {"Content": "Back button dysfunctional. App hangs and freezes multiple times. Unwanted redirection to gif and external links. Failure to trigger actions in acceptable amount of threshold. I hope next release will fix most of these issues.", "Numbers": "54", "Date": "July 5, 2017"}, {"Content": "I like medium. I really wanted the app but installing this app crashes my stock launcher repeatedly. I was forced to uninstall it. It ll be grt if the issue is solved. Note: Version 3.3.2476 works fine without any problem.", "Numbers": "55", "Date": "July 3, 2017"}, {"Content": "Feedback: App crashes every time I try to open a series on my Moto E.", "Numbers": "56", "Date": "June 9, 2017"}, {"Content": "It works Slick UI. Has yet to crash my phone. Easy to find my interests and bookmarks. I really enjoy it.", "Numbers": "57", "Date": "May 28, 2017"}, {"Content": "Good content, has a lot of bugs though Crashes a lot, night mode is broken (only the first few article cards are dark colored on the main feed), clicking the follow button on a publication doesn't seem to sync when you leave and re-enter a publisher's page. Overall design is nice though and is easy to use.", "Numbers": "58", "Date": "June 12, 2017"}, {"Content": "Well... A little buggy. One time it crashed down as I was highlighting the world. Also several crash-downs occured with no reasons. So, 4.", "Numbers": "59", "Date": "March 11, 2017"}, {"Content": "Content is great but the app keeps crashing on certain articles.", "Numbers": "60", "Date": "January 17, 2017"}, {"Content": "What's not to like, runs smooth, no crashes and good content.", "Numbers": "61", "Date": "January 10, 2017"}, {"Content": "it's crashing constantly", "Numbers": "62", "Date": "January 18, 2017"}, {"Content": "Functionality and Relevance\nIt works across my device, with the occasional glitch. One in which it will freeze but nonetheless it could easily be Android itself messing up. Other than that it functions 98% of the time. It is also a very relevant app in the blog heavy internet. Everyone's somebody. At least as long as your post goes viral. Lol.", "Numbers": "63", "Date": "December 27, 2016"}, {"Content": "Awesome app, but... Medium is such an awesome app! My only issue is that it tends to crash sometimes when I attempt to write a post. Other than that, the reading experience is great. No other issues.", "Numbers": "64", "Date": "November 23, 2016"}, {"Content": "Well designed Reading articles here is so satisfying. You don't have to worry about noise from ads. However, I have having performance issues on Android N. I can't highlight without the application crashing", "Numbers": "65", "Date": "November 13, 2016"}, {"Content": "Crashes constantly Crashes every time I tried to read an article.", "Numbers": "66", "Date": "October 26, 2016"}, {"Content": "Great Site, great app! The Medium site has always worked smoothly for me. No crashes, easy to navigate.", "Numbers": "67", "Date": "October 29, 2016"}, {"Content": "Keeps crashing on KitKat... Works fine on lollipop..", "Numbers": "68", "Date": "November 3, 2016"}, {"Content": "Crash all the time", "Numbers": "69", "Date": "September 9, 2016"}, {"Content": "Buggy. But user friendly. Images don't load, even on LTE. Frequent crashes. But still, an amazing UI.", "Numbers": "70", "Date": "September 7, 2016"}, {"Content": "App keeps on crashing I love this app but everytime I try to view the home screen and the new collections, it just keeps crashing on my. I am on a Galaxy Note 4.", "Numbers": "71", "Date": "August 7, 2016"}, {"Content": "Freezes/Reloads continually Quite often certain stories cause an app restart, or reload of that page, now it is doing it with comments", "Numbers": "72", "Date": "August 10, 2016"}, {"Content": "It's crashing on opening!", "Numbers": "73", "Date": "August 11, 2016"}, {"Content": "Faulty Updates! Please don't release updates that cause your app to crash and make it unusable.", "Numbers": "74", "Date": "August 5, 2016"}, {"Content": "App Crashes on Load While I love the Medium platform, the app crashes as soon as it loads on my Samsung S4.", "Numbers": "75", "Date": "August 5, 2016"}, {"Content": "Sucks. Cant logged in. Auto crash.", "Numbers": "76", "Date": "August 6, 2016"}, {"Content": "Crashes! Updated, cleared cache, keeps crashing on open. Loved app but now unusable!", "Numbers": "77", "Date": "July 30, 2016"}, {"Content": "Phone version crashes when opening story. Awesome on desktop.", "Numbers": "78", "Date": "July 8, 2016"}, {"Content": "Create DRAFT feature not working APP CRASHES. Medium has been one of best clean smooth content sharing platform, and it just got better", "Numbers": "79", "Date": "July 7, 2016"}, {"Content": "Good They fixed crash on signed out really quick, interesting app give it a go, would be great to edit interest later on that's why it's 4 not 5 stars", "Numbers": "80", "Date": "May 31, 2016"}, {"Content": "Doesn't allow me to edit\nI love Medium and always use it for writing (and occasionally, I'll read an article if it sounds interesting), but the only reason I downloaded the app to my phone is to edit my writing, and continue writing. Everything else comes up fine, but it doesn't allow me to edit anything. It just freezes up where it's all green and I can't touch anything. If this was fixed, I'd give it a five!", "Numbers": "81", "Date": "May 30, 2016"}, {"Content": "Crashed after latest update Crashed every time while loading image.", "Numbers": "82", "Date": "September 3, 2016"}, {"Content": "Crash on last version", "Numbers": "83", "Date": "April 21, 2016"}, {"Content": "Nice experience despite few crashes the overall built is smooth", "Numbers": "84", "Date": "April 8, 2016"}, {"Content": "Freezes constantly on Marshmallow After reading an story for a few minutes the app will freeze up. I then have to close and reopen.", "Numbers": "85", "Date": "March 24, 2016"}, {"Content": "Works Well Feels much better and the interaction works well. Unfortunately, crash too often. Thank you.", "Numbers": "86", "Date": "March 20, 2016"}, {"Content": "Love the stories but would like to be able to see just the tags I have chosen and nothing else, some articles crash randomly too", "Numbers": "87", "Date": "March 22, 2016"}, {"Content": "Pretty and buggy Nice looking app that could be great but the UX us awful due to several issues. Appears to be UI lag when accessing async resources that freeze the application, along with an annoying back press like action that kills the article you are reading when the application is not frozen.", "Numbers": "88", "Date": "March 2, 2016"}, {"Content": "Crashes upon opening and freezes device", "Numbers": "89", "Date": "February 18, 2016"}, {"Content": "Quick, diverse reads Easy to use, diverse, lots of viewpoints, doesn't crash!", "Numbers": "90", "Date": "February 22, 2016"}, {"Content": "Crashes on Android M", "Numbers": "91", "Date": "January 31, 2016"}, {"Content": "Love the Concept - Crashes on Nexus 6.\nI've become generally disgusted with social media, and so I've turned to news apps like Flipboard or google play news. I think it's amazing that this app seems to combine the concept of social networking into the news infrastructure, so I can share my thoughts with the world while actually learning something. The problem I face now, though, is that it keeps crashing on the nexus 6. It should be noted that I'm using the Android M Beta, so that could be it, but the app is nearly unusable because it crashes.", "Numbers": "92", "Date": "March 28, 2016"}, {"Content": "I love medium and access it from both chrome on my desktop and the ios app all the time. I just wasted the last hour trying to use the android app on my galaxy tab s, only to have my bookmarks not show up at all for the first half hour and then to have it crash every couple of minutes when scrolling through it. I've uninstalled the app and will just access it from chrome on my tablet from now on.", "Numbers": "93", "Date": "December 29, 2015"}, {"Content": "I installed on my Samsung and it repeatedly crashed the page until I managed to get to Settings and uninstall it. Not impressed", "Numbers": "94", "Date": "December 22, 2015"}, {"Content": "App keeps crashing, can't read articles. Better to use the browser.", "Numbers": "95", "Date": "January 6, 2016"}, {"Content": "Not working in my phone. After installing says home launcher crashed. After back up it says invalid apk.", "Numbers": "96", "Date": "January 1, 2016"}, {"Content": "I got the subscription, but the app keeps crashing when I try to play audio. I am on a One Plus 3T.", "Numbers": "97", "Date": "December 29, 2015"}, {"Content": "what is this???? sorry guys! unable to edit profile photo AND also i am unable to follow people and publications.... please fix this .....oh yeah it is crashing also", "Numbers": "98", "Date": "December 14, 2015"}, {"Content": "Keeps crashing Everyone I try to use this app on my SG6 it keeps crashing.", "Numbers": "99", "Date": "November 29, 2015"}, {"Content": "Love it Works well. Never had an app crash. Lots of interesting stuff to read. Very ergonomic and well interconnected.", "Numbers": "100", "Date": "November 6, 2015"}, {"Content": "App crashes Everytime I click on article", "Numbers": "101", "Date": "November 9, 2015"}, {"Content": "I can't read any article, it crashes when I try to open one.", "Numbers": "102", "Date": "September 18, 2015"}, {"Content": "It does what it says it does have not had crashes s8", "Numbers": "103", "Date": "August 5, 2015"}, {"Content": "Crashed a lot", "Numbers": "104", "Date": "January 17, 2019"}, {"Content": "crashes on marshmallow", "Numbers": "105", "Date": "December 18, 2018"}]