[{"Content": "This is the 3rd update and still the same problem mentioned below. Please sort it out!! Using xiome redmi note 4. Subscribed for the premium version. Crashes when clicked on emergency calls ( no point of having this app as 1 can disable just by clicking on emergency numbers). Previous versions were much better even without subscribing for premium. Release an update to fix the crash.", "Numbers": "1", "Date": "November 13, 2017"}, {"Content": "Arrrgggghhh. You guys are so frustrating. I can't do anyhting I used to be able do. There was no record of the membership that I already paid for. So I went a bought another one- only to find I can't do anyhting anyway. So I have paid double for an app that is useless to me. I can't edit the whitelist. When I go to edit my emergency numbers it crashes. And it keeps crashing during the full lock. I am literally paying for nothing you said I would get. Sort it out Flipd. This is really unfair on your customers.", "Numbers": "2", "Date": "November 16, 2017"}, {"Content": "In the previous versions the app was not affected by switching phone off but in the latest version the app fails when i restart my phone...please fix this soon.And another thing is that it crashed and unlocked when I used the whitelisted app for 3 or 4 times continuosly. ..why ?", "Numbers": "3", "Date": "November 23, 2017"}, {"Content": "I was pleased with the original version but not happy now!! It crashes whenever i try and set emergency numbers and the whitelist is gone. Im a premium member aswell so what a waste of money😣", "Numbers": "4", "Date": "September 26, 2017"}, {"Content": "For older version i gave 5 star not for new versiin... NO MORR WHITE LIST APP &CANT SET EMERGENCY CINTACTS NO(it crashes every time i want to set up emergecy contact no) ALL MONEY PAID FOR PREMIUM FOR 1 YEaR GOT WASTED (no more additional option for Premium like i used to get in older version) IT USED TO BE THE BEST APP BUT NPT ANY MORE :( PLZ BRING BACK THE OLD OPTIONS", "Numbers": "5", "Date": "September 26, 2017"}, {"Content": "Ever since the developers began tinkering with the app months ago it became trash. Full lock just recently came back and it crashes as soon as touch to initiate it. It's disappointing that a good app became so useless", "Numbers": "6", "Date": "December 24, 2017"}, {"Content": "It is very good app. Now it is getting crashed each and every time.", "Numbers": "7", "Date": "August 27, 2016"}, {"Content": "The best. Just make more people aware amor this app. And you will be on the top. Sometimes it continuously crashes even while the app is not running. You might want to look into that. It says \" Flipd is not responding\"", "Numbers": "8", "Date": "December 19, 2015"}, {"Content": "White listed Im unable to enable the whitelisted feature. It just keeps asking me to allow flipd in the accessibility but i do not know how.. also, everytime i click on the schedule icon, the app just crashes.. please help?", "Numbers": "9", "Date": "December 26, 2015"}, {"Content": "There is a massive glitch....if u disconnect mobile data....the app crashes.....it allows usage of all other apps outside the standard ones for full lock and the timer glitches.....wow......I was very very happy to find this app and turned off data to save battery and this happens!", "Numbers": "10", "Date": "March 16, 2018"}, {"Content": "it didnt crashes or closes like how the others said!! i love it!! thanks!", "Numbers": "11", "Date": "February 10, 2019"}]