[{"Content": "Constantly crashes. Lucky if I can get two articles open before crashing. Each update makes it worse. I uninstalled, reinstalled too many times to count. Content is ok but who cares if you can't read it. Update 2/7/19: Continues to crash and freeze. I've sent numerous file logs, etc., and nothing changes. I'm done and uninstalling this app. Too bad HuffPo can't get their act together and fix the issue.", "Numbers": "1", "Date": "February 8, 2019"}, {"Content": "I like HuffPost but the latest versions of their app crash almost every time I try to read a story. I've never had an app crash so often. It's unusable. So, my advice is just to use your browser to access HuffPost. If you know how, the Chrome browser will allow you to put a link to HuffPost on your Android desktop so you can access it just as quickly as you can with the app. And, no crashes!", "Numbers": "2", "Date": "February 1, 2019"}, {"Content": "App will crash when I click on an an article, any article, EVERY time. Has steadily deteriorated over the last six months. the mobile site became unworkable due to constant pop ups telling me to use an unstable app that cover half of the screen.", "Numbers": "3", "Date": "February 8, 2019"}, {"Content": "Not sure if this is due to an update, but I can't get through a single article now without the app crashing. They need an update fast!", "Numbers": "4", "Date": "February 7, 2019"}, {"Content": "Unstable Android app. Just try and read an article without it crashing. So sad.", "Numbers": "5", "Date": "February 18, 2019"}, {"Content": "What is Happening?! App crashes. Videos are frustrating at best. HP is my fave news app! Please, for the love of all that is the Resistance, FIX THIS!", "Numbers": "6", "Date": "January 30, 2019"}, {"Content": "Still crashes but even worse the videos auto start. If I wanted to watch the video I would! plz fix.", "Numbers": "7", "Date": "January 31, 2019"}, {"Content": "huffpo content is great. but the app crashes constantly, rendering articles almost unreadable at times.", "Numbers": "8", "Date": "January 30, 2019"}, {"Content": "keeps crashing each time I try to open it, each update seems to do nothing to fix this.", "Numbers": "9", "Date": "February 21, 2019"}, {"Content": "I might enjoy reading the articles published in the app if it didn't freeze and crash almost every time I try to open one to read.", "Numbers": "10", "Date": "February 15, 2019"}, {"Content": "its been fine for a long time but ever since the llast update it keeps crashing.", "Numbers": "11", "Date": "February 7, 2019"}, {"Content": "used to be great, now it crashes every 4 minutes or less.", "Numbers": "12", "Date": "February 1, 2019"}, {"Content": "I love this Huff Post but this app barely works on my phone now. Takes forever to load story and won't let me log in to comment. Constantly crashes.", "Numbers": "13", "Date": "January 10, 2019"}, {"Content": "App has serious stability issue. Crashes inexplicably. Have never had this problem with any other app I've installed from a top-flight news co.", "Numbers": "14", "Date": "December 21, 2018"}, {"Content": "Content is fine but app is highly unstable and has been for months. I'm lucky if I can read an entire article without it freezing or crashing.", "Numbers": "15", "Date": "January 13, 2019"}, {"Content": "App crashes everytime I run it. Deleted it.", "Numbers": "16", "Date": "January 17, 2019"}, {"Content": "The app is constantly crashing. I updated, and it is still crashing.", "Numbers": "17", "Date": "December 11, 2018"}, {"Content": "App keeps crashing! Urgent updates are needed", "Numbers": "18", "Date": "January 5, 2019"}, {"Content": "Keeps crashing on Samsung Tablet. had to uninstall", "Numbers": "19", "Date": "December 23, 2018"}, {"Content": "I like Huff post but the app crashes a LOT", "Numbers": "20", "Date": "January 16, 2019"}, {"Content": "Crashes several times a day.", "Numbers": "21", "Date": "January 19, 2019"}, {"Content": "Still crashing", "Numbers": "22", "Date": "December 10, 2018"}, {"Content": "keeps crashing", "Numbers": "23", "Date": "January 29, 2019"}, {"Content": "It keeps crashing", "Numbers": "24", "Date": "December 5, 2018"}, {"Content": "If you're going to make changes don't break it in the process. It's now unstable and crashes.", "Numbers": "25", "Date": "November 21, 2018"}, {"Content": "Constantly crashing. It's very frustrating not to be able to get through even one article. ☹", "Numbers": "26", "Date": "November 25, 2018"}, {"Content": "Still crashes when reading articles. Use to be a great app now crashes all the time when reading articles. Would not recommend.", "Numbers": "27", "Date": "December 3, 2018"}, {"Content": "It used to work, would be 5 Stars, but now it crashes!! Can't even get thru one article!", "Numbers": "28", "Date": "November 30, 2018"}, {"Content": "Very unstable, freezes, crashes constantly. Can't even read one article.", "Numbers": "29", "Date": "November 24, 2018"}, {"Content": "app crashes all the time!", "Numbers": "30", "Date": "December 4, 2018"}, {"Content": "Good source for real news. However it crashes so often that it is all but worthless. I am about 3 crashes away from un installing.", "Numbers": "31", "Date": "November 21, 2018"}, {"Content": "App crashes multiple times daily. Freezes frequently as well.", "Numbers": "32", "Date": "November 21, 2018"}, {"Content": "The app has one very simple problem: it crashes every time I try to read a story. I have sent feedback with crash logs pretty much daily for a month, but nobody has bothered to send an auto-reply. Apparently the developers just don't care.", "Numbers": "33", "Date": "November 16, 2018"}, {"Content": "Love the stories but it crashes constantly no matter how many updates they do, good thing the techs aren't working on aircraft software.", "Numbers": "34", "Date": "November 15, 2018"}, {"Content": "Constant crashing. I've tried reinstalling this app at least 10 times in the past year but nothing has changed. Maybe instead of trying to dig deeper into our phone data to be exploited at a later date, try being less shady and focus on spreading news.", "Numbers": "35", "Date": "December 8, 2018"}, {"Content": "With so many negative reviews about the app crashing (count me in), why isn't the Webmaster fixing this NOW?", "Numbers": "36", "Date": "November 10, 2018"}, {"Content": "The app crashes frequently. I do like the content when I can read it.", "Numbers": "37", "Date": "November 11, 2018"}, {"Content": "I love the content but the app keeps crashing and closing. Hopefully these issues get fixed.", "Numbers": "38", "Date": "November 8, 2018"}, {"Content": "First off, the app is now garbage, and consistantly crashes every 2 minutes. Secondly, they're extreamly bias, downright racist, and very sexist. In the past 3 years, this has become the least honest news source, in the mainstream. I've used this app for 7+ years, but the journalistic integrity is completely gone. It's now just a far-left propaganda app. The \"Fox News\" of the left.", "Numbers": "39", "Date": "November 1, 2018"}, {"Content": "This app constantly crashes on my Samsung tablet. All other apps work fine.", "Numbers": "40", "Date": "November 1, 2018"}, {"Content": "Sure would be nice to read an entire article without the app crashing. Is that too much to ask?", "Numbers": "41", "Date": "November 3, 2018"}, {"Content": "I love the Huff but your site crashes over and over and over again!", "Numbers": "42", "Date": "October 31, 2018"}, {"Content": "Crashes continuously", "Numbers": "43", "Date": "October 29, 2018"}, {"Content": "Keeps crashing.", "Numbers": "44", "Date": "October 29, 2018"}, {"Content": "Crashes constantly", "Numbers": "45", "Date": "October 28, 2018"}, {"Content": "Not sure why but recently the app crashes frequently. It is very annoying. I have tried uninstalling and reinstalling to no avail....perhaps a new update.", "Numbers": "46", "Date": "October 15, 2018"}, {"Content": "Crashes every time I try to use it on my Nvidia shield. Finally had to uninstall the app.", "Numbers": "47", "Date": "October 19, 2018"}, {"Content": "App is continually crashing, can barely read one article before it crashes", "Numbers": "48", "Date": "October 17, 2018"}, {"Content": "Now it just crashes every time. Cant read a news story anymore..", "Numbers": "49", "Date": "October 16, 2018"}, {"Content": "Be nice if you could finish reading one article without it crashing.", "Numbers": "50", "Date": "October 14, 2018"}, {"Content": "Crashes continually. Most disappointing. News is still great but almost impossible to use", "Numbers": "51", "Date": "October 2, 2018"}, {"Content": "Crashes constantly on Samsung Tab A running 7.1.1. Still occurring ater 1 October update. Very disappointing.", "Numbers": "52", "Date": "October 2, 2018"}, {"Content": "Constant crashing on Pixel XL running Android Pie. Last two versions have been completely unusable.", "Numbers": "53", "Date": "October 2, 2018"}, {"Content": "Consistently freezing and/or crashing since the last update. Overwhelmingly frustrating...please fix!!", "Numbers": "54", "Date": "October 5, 2018"}, {"Content": "The app crashes constantly", "Numbers": "55", "Date": "October 5, 2018"}, {"Content": "This used to be a good App......about 8 months ago. The latest version is buggy and unstable, crashing constantly. Added 02/13/2018: The latest version crashes halfway through an article. Even more unstable than before. Now worth only half a star, but that rating is not possible. Update: 09/20/18 even more buggy than before. App shuts down constantly while one is reading an article.", "Numbers": "56", "Date": "September 20, 2018"}, {"Content": "Crashes all the freaking time! I can't believe I'm the only one with the problem. Very strange that developers seem unable to fix.", "Numbers": "57", "Date": "September 22, 2018"}, {"Content": "I changed my rating fom 4 to 1 because it keeps crashing since last update. Seems to very common complaint", "Numbers": "58", "Date": "September 20, 2018"}, {"Content": "Constantly crashes on my Samsung Galaxy Tab S8. I've tried everything, but can't read even one article.", "Numbers": "59", "Date": "September 28, 2018"}, {"Content": "Until the latest update, I really liked this app. Now it crashes every time I open a story. I'm deleting the app.", "Numbers": "60", "Date": "September 27, 2018"}, {"Content": "I really did enjoy this app.....until the new update. Now I can't even finish an article without it crashing. Please fix!!!", "Numbers": "61", "Date": "September 26, 2018"}, {"Content": "This app crashed 6 times or more Everytime I read the articles. It's absolutely awful", "Numbers": "62", "Date": "October 1, 2018"}, {"Content": "After most recent updates can't so much as read an article without it crashing.", "Numbers": "63", "Date": "September 27, 2018"}, {"Content": "Keeps crashing every time I open a story.", "Numbers": "64", "Date": "September 24, 2018"}, {"Content": "Latest version keeps crashing on my Samsung Tablet.", "Numbers": "65", "Date": "September 30, 2018"}, {"Content": "Keeps crashing on my Android phone", "Numbers": "66", "Date": "September 28, 2018"}, {"Content": "Hang...Crash .. phone rebooted.", "Numbers": "67", "Date": "September 21, 2018"}, {"Content": "This app crashes too much.", "Numbers": "68", "Date": "December 4, 2018"}, {"Content": "It was crashing repeatedly. Latest update fixed crashes. Now articles just don't load. Wish I could go back a month to older version.", "Numbers": "69", "Date": "September 8, 2018"}, {"Content": "Have always liked Huff but the latest update is slow and crashes. PLEASE FIX!!!", "Numbers": "70", "Date": "September 14, 2018"}, {"Content": "Crashes. That's all it does since the updated version. Happy to be uninstalling.", "Numbers": "71", "Date": "September 20, 2018"}, {"Content": "The app doesn't load and crashes.", "Numbers": "72", "Date": "September 15, 2018"}, {"Content": "Good content but app constantly crashes and restarts.making it unusable.", "Numbers": "73", "Date": "September 3, 2018"}, {"Content": "The best section of this app besides the news is the readers comment. But now it either crash or very, slow loading. Why update and make it worse? And if it is worse, why not bring back the old version?", "Numbers": "74", "Date": "September 30, 2018"}, {"Content": "Crashes constantly, even after clearing cache", "Numbers": "75", "Date": "October 18, 2018"}, {"Content": "Freezes and lags frequently. Crashes frequently.", "Numbers": "76", "Date": "September 5, 2018"}, {"Content": "Love HP, HATE the app. Beyond belief they can't fix this . The \"reboot to main screen bug\" is still there. Continues to crash scrolling within a story or trying to view a video. I've installed & uninstalled way too many times. Cleared cache, plenty of memory. Don't they test this on more than one device? Your code is bad., admit it & go back to a working version!", "Numbers": "77", "Date": "July 31, 2018"}, {"Content": "Crashes all the time. Whatever I'm doing it regularly pops up as HuffPost app has closed.", "Numbers": "78", "Date": "August 2, 2018"}, {"Content": "Crashes on launch as of update.", "Numbers": "79", "Date": "August 2, 2018"}, {"Content": "Works well, no issues with crashing.", "Numbers": "80", "Date": "June 11, 2018"}, {"Content": "App crashes on every open, after latest update.", "Numbers": "81", "Date": "May 25, 2018"}, {"Content": "App keeps crashing. Real pain will delete if not sorted soon. Dropping a star still crashing. I reinstalled this app not expecting much improvement but how wrong I was. Works really well now.", "Numbers": "82", "Date": "April 30, 2018"}, {"Content": "Newest version doesn't even open. Crashes every time!", "Numbers": "83", "Date": "April 15, 2018"}, {"Content": "No incident of crash yet experienced so loving it. Thanks", "Numbers": "84", "Date": "April 21, 2018"}, {"Content": "During the last few months the app crashes after opening a story and it returns to the main page. Deleting it.", "Numbers": "85", "Date": "March 26, 2018"}, {"Content": "I love the reporting, but the app keeps crashing, on my tablet & phone. Don't know why.", "Numbers": "86", "Date": "April 14, 2018"}, {"Content": "Not fair and impartial, but I like it. 03/18 the app crashes a LOT.", "Numbers": "87", "Date": "March 3, 2018"}, {"Content": "Normally this is my goto app for news, but the last couple days the app continually crashes. I haven't been able to read an entire article for almost 3 days. I'll raise the review once the crashing is corrected.", "Numbers": "88", "Date": "February 14, 2018"}, {"Content": "This app has gone steadily downhill. Recently they've removed the last 2 news sections I follow (besides the front page): Weird News and Tech. Not to mention the highly inappropriate, sexist ads, combined with disturbing graphics ads for medical services. Now with the latest version, the app crashes every time you scroll to the end of an article. It crashes even quicker if the article has any embedded Twitter comments. It is basically unusable. Very disappointing; it's almost like they don't use their own app. How could anyone enjoy this experience?", "Numbers": "89", "Date": "February 14, 2018"}, {"Content": "Used to be good. Now it crashes frequently and is getting more and more padded with laughable silly opinion pieces. Should stick more to news and actual journalism. Noticing it misses major stories often, which you will find on the BBC, while having minor opinion pieces the top of it's stories.", "Numbers": "90", "Date": "February 14, 2018"}, {"Content": "App is crashing every 30 seconds and the \"news\" is in no way unbiased. I tend to lean left but that's because I make my own opinions and read both sides of things. HuffPo is no less divisive than Trumps Twitter feed (or anything else he says or does) and more annoyingly, even if there is an article that's interesting and I agree with, I can't read it because the app itself is constantly crashing. Just disappointing tbh.", "Numbers": "91", "Date": "February 14, 2018"}, {"Content": "Much better app than others (no crashes or slowing down your phone) , and does not try to charge you like the Washington Post & such... At least not yet!", "Numbers": "92", "Date": "February 17, 2018"}, {"Content": "Previous versions would have gotten a five star rating without a doubt, but the latest version seems to crash constantly when I reach the end of an article.", "Numbers": "93", "Date": "February 14, 2018"}, {"Content": "pathetic. app crashes unexpectedly after a few minutes. videos, sound only auto starts with no way to stop it.", "Numbers": "94", "Date": "February 2, 2019"}, {"Content": "Every update is WORSE. Crashes, stupid formating, it sucks. For God's sake, just report news.", "Numbers": "95", "Date": "March 5, 2018"}, {"Content": "It keeps crashing halfway through an article.", "Numbers": "96", "Date": "February 14, 2018"}, {"Content": "Crashes often. Have had to reinstall several times", "Numbers": "97", "Date": "February 27, 2018"}, {"Content": "This news app is a spam machine that crashes consistently", "Numbers": "98", "Date": "February 13, 2018"}, {"Content": "Sometimes it crashes when scrolling at the end of an article", "Numbers": "99", "Date": "February 16, 2018"}, {"Content": "Only complaints would be: Sometimes I hit backk and it exits out of the app instead of going to the previous page. Also, crashes at least once every day. (I use it maybe... half a dozen times a day)", "Numbers": "100", "Date": "January 17, 2018"}, {"Content": "crashes every minute", "Numbers": "101", "Date": "February 9, 2019"}, {"Content": "I wanted to read Huffpost on my Google Nexus 10 tablet but every article I try to read crashes with an \"unknown url\" error. Reinstalling makes no difference.", "Numbers": "102", "Date": "January 2, 2018"}, {"Content": "Crashes and locks up all the time", "Numbers": "103", "Date": "September 30, 2018"}, {"Content": "Crashes constantly, piece of s...", "Numbers": "104", "Date": "January 2, 2018"}, {"Content": "App is great and does not crash!", "Numbers": "105", "Date": "December 23, 2017"}, {"Content": "Easy to use. No crashes", "Numbers": "106", "Date": "January 9, 2018"}, {"Content": "Was great. Now like everyone else says, it keeps crashing. Reply to developer's response: Thank you. Better, but when I try to read the articles, 50% of the time I get a \"web page unavailable\" white out after opening the article. Using Galaxy S4 phone. On my Galaxy S tab it's fine. Still one star until fixed.", "Numbers": "107", "Date": "December 10, 2017"}, {"Content": "They fixed the bug that was causing the crashes extremely quickly and even notified me by email. I have since reinstalled the app & it's running smoothly. It's a great app for staying updated on the news!", "Numbers": "108", "Date": "December 12, 2017"}, {"Content": "Latest update keeps crashing. Have to uninstall. Dec. 8, 2017 Edit: HP responded. I re-installed and \"so far, so good\"... which is a lot more than I can say for the current admin. *rimshot*", "Numbers": "109", "Date": "December 9, 2017"}, {"Content": "Keep crashing; won't let me sign in; receive error message when trying to filter responses and expand comments. Uninstalled and reinstalled, same issue.", "Numbers": "110", "Date": "December 14, 2017"}, {"Content": "Hurrah working properly so I can enjoy again. Spoke to soon still crashing such a pity.", "Numbers": "111", "Date": "December 16, 2017"}, {"Content": "The new version as of today 12/8/17 keeps crashing. After a while it stopped opening.", "Numbers": "112", "Date": "December 9, 2017"}, {"Content": "Was 100% ,Now keeps crashing , changes to no network page", "Numbers": "113", "Date": "December 18, 2017"}, {"Content": "Keeps telling me that some web pages are unavailable and promptly crashes.", "Numbers": "114", "Date": "December 12, 2017"}, {"Content": "Installed update, still crashes everytime. Uninstalled.", "Numbers": "115", "Date": "December 12, 2017"}, {"Content": "Crashes constantly", "Numbers": "116", "Date": "December 9, 2017"}, {"Content": "Loved this app until it updated yesterday. Doesn't work now. Just constantly gives message saying it's crashed even when I've not opened it.", "Numbers": "117", "Date": "December 8, 2017"}, {"Content": "It's the second update in.a row that keeps crashing. Will you please fix it.", "Numbers": "118", "Date": "December 8, 2017"}, {"Content": "Is crashing every time you try to open the app.", "Numbers": "119", "Date": "December 8, 2017"}, {"Content": "Crashes since last 2 updates.", "Numbers": "120", "Date": "December 8, 2017"}, {"Content": "I am using the older version which is more tablet friendly and no constant crashes", "Numbers": "121", "Date": "December 8, 2017"}, {"Content": "Worked beautifully until the update today. App won't open and crashes constantly. Error messages pop up every minute or two. Fix it please!!!!! Updated 12/7/17: Got the new update today, installed it, and had the same problems again. I had to uninstall the app and reinstall. It's working now!", "Numbers": "122", "Date": "December 8, 2017"}, {"Content": "I eventually had to uninstall this application as it was continually crashing and prompting Android to ask about sending a crash report.", "Numbers": "123", "Date": "December 8, 2017"}, {"Content": "Every now and then decides to crash over and over every few seconds even when it wasn't open and just in the background.", "Numbers": "124", "Date": "December 9, 2017"}, {"Content": "Constent crashing had to uninstall", "Numbers": "125", "Date": "December 7, 2017"}, {"Content": "App will not open after latest update. (12/07/2017) Multiple crash notices every few minutes, eventually had to uninstall the app. It's a shame because I use this app daily and I am not sure if I will ever use it again, even if it gets fixed.", "Numbers": "126", "Date": "December 8, 2017"}, {"Content": "The new update continually crashes and actially crashed my phone a number of times. I had to uninstall. Sad.", "Numbers": "127", "Date": "December 8, 2017"}, {"Content": "It's crashing constantly since last update. Can't even open app. S8+", "Numbers": "128", "Date": "December 8, 2017"}, {"Content": "Crashed 4 times while reporting a former crash; crashed many times after this report. Uninstalled!!!!!!", "Numbers": "129", "Date": "December 5, 2017"}, {"Content": "Since last update, the app keeps crashing. It's worthless.", "Numbers": "130", "Date": "December 8, 2017"}, {"Content": "This app crashes all the time. It is really frustrating when you are trying to read an article and can't finish it because it repeatedly crashes. Currently can't even open any article to read it. It crashes before I finish reading the title.", "Numbers": "131", "Date": "September 13, 2017"}, {"Content": "This app continually crashes with net::ERR_UNKNOWN_URL_SCHEME. This is even after the September 6th update. So the only I can read articles is to download a section and read off-line but I have to be online to change sections or editions! POS!", "Numbers": "132", "Date": "September 23, 2017"}, {"Content": "Most recent update (12/7/17) meeps crashing....can't open it. Even when I haven't tried to open, I get a pop up stating it's stopped working. So annoying will probably have to uninstall.", "Numbers": "133", "Date": "December 8, 2017"}, {"Content": "Does just what it should - provide main news first followed by older stories & the gossipy trash many don't care about. Rarely crashes, reliable app!", "Numbers": "134", "Date": "November 24, 2017"}, {"Content": "Latest version keeps crashing in the background taking my screen hostage! Test your software before deploying!!!", "Numbers": "135", "Date": "December 8, 2017"}, {"Content": "No issues with the app crashing or anything. Regular notifications on news updates are fine. Please stop using headlines that include spoilers for shows! Thanks huffpost!", "Numbers": "136", "Date": "September 29, 2017"}, {"Content": "Since update now crashes every time on Samsung 10.1 tab running Androidn 4.1.2. Used to be great now unusable :(", "Numbers": "137", "Date": "September 10, 2017"}, {"Content": "Every article in the Canadian edition crashes after being open for just a few moments rendering this news app useless.", "Numbers": "138", "Date": "September 29, 2017"}, {"Content": "App keeps crashing. News appears to have a significant bias toward the left. Story titles too often misleading.", "Numbers": "139", "Date": "September 29, 2017"}, {"Content": "App opens an article but then crashes with this error every time - \"net::ERR_UNKNOWN_URL_SCHEME\" help!?", "Numbers": "140", "Date": "October 1, 2017"}, {"Content": "Great news source, but the app crashes and sends me to the play store to attempt to have me download other advertised apps. I can't use it :(", "Numbers": "141", "Date": "October 15, 2017"}, {"Content": "YOUR APP IS CRASHING EVERY ARTICLE A USER OPENS- BY REDIRECTING USERS TO MULTIPLE GOOGLE PLAY DOWNLOAD APP PAGES. SO OVERWHELMINGLY SO THAT IT'S NEARLY CAUSING REBOOT NECESSITY. BRAND NEW GALAXY S8. You've been getting worse in general though. Lazy. Months old articles on the majority of the categories. Really sad when the entertainment section is updated daily but health and science are still showing articles from 2016. Get it together HuffPost. Total garbage currently, seeing as you can't even read an article.", "Numbers": "142", "Date": "October 8, 2017"}, {"Content": "hopeless keeps crashing after 30 seconds on my Galaxy Tablet :(", "Numbers": "143", "Date": "November 2, 2017"}, {"Content": "Unusable constantly crashes, was so good, but can't read anything.", "Numbers": "144", "Date": "October 11, 2017"}, {"Content": "Keeps crashing on my phone,so has become unusable", "Numbers": "145", "Date": "October 11, 2017"}, {"Content": "App keeps crashing had been working fine now it crashes all the time", "Numbers": "146", "Date": "September 21, 2017"}, {"Content": "App keeps crashing since latest update using note 8", "Numbers": "147", "Date": "December 8, 2017"}, {"Content": "Latest version is CRASHWARE. Fix this thing!", "Numbers": "148", "Date": "October 26, 2017"}, {"Content": "Love it but keeps crashing! I can't even get through an article... Help!", "Numbers": "149", "Date": "November 23, 2017"}, {"Content": "LOVED IT NEW VERSION CRASHES S8 +", "Numbers": "150", "Date": "December 8, 2017"}, {"Content": "Keeps crashing!", "Numbers": "151", "Date": "September 12, 2017"}, {"Content": "Always crashes", "Numbers": "152", "Date": "September 8, 2017"}, {"Content": "Continually crashes", "Numbers": "153", "Date": "September 10, 2017"}, {"Content": "Always crashes", "Numbers": "154", "Date": "November 3, 2017"}, {"Content": "updated to latest version now crashes on opening..... further update.... waited a few weeks and reloaded now ok. must have had an update in my absence.", "Numbers": "155", "Date": "August 30, 2017"}, {"Content": "Runs terrible. App crashes just scrolling through articles. Videos won't load. This app worked better five years ago.", "Numbers": "156", "Date": "August 28, 2017"}, {"Content": "Crashed. Uninstalled. Reinstalled. Crashed.", "Numbers": "157", "Date": "August 19, 2017"}, {"Content": "I like the app, I installed a while ago and never crashed or had problems", "Numbers": "158", "Date": "August 9, 2017"}, {"Content": "Could have liked it but it crashes my phone and I hate that", "Numbers": "159", "Date": "July 18, 2017"}, {"Content": "Crashing too often", "Numbers": "160", "Date": "July 30, 2017"}, {"Content": "Works well never crashes on my devices", "Numbers": "161", "Date": "August 5, 2017"}, {"Content": "Updated to the latest version and it immediately crashes when trying to open.", "Numbers": "162", "Date": "July 6, 2017"}, {"Content": "Easy to use, doesn't crash like every other news app I've tried.", "Numbers": "163", "Date": "July 8, 2017"}, {"Content": "I prefer the older version far better. I find the new layout difficult to use. The new app crashes frequently. Huffpost has radicalized too far left with the new EIC. I am uninstalling and will no longer use Huffpost. I prefer Alternet, Politico, Guardian and The Intellectualist.", "Numbers": "164", "Date": "June 11, 2017"}, {"Content": "Won't even open anymore. Crashes every time since the last update.", "Numbers": "165", "Date": "June 11, 2017"}, {"Content": "Constantly crashing after last update. Have uninstalled", "Numbers": "166", "Date": "June 29, 2017"}, {"Content": "Works OK in the USA edition. But in the Canadian edition the article pages are always crashing.", "Numbers": "167", "Date": "November 25, 2017"}, {"Content": "Crashing on samsung galaxy J7. Plz fix", "Numbers": "168", "Date": "June 9, 2017"}, {"Content": "App crashes after startup...", "Numbers": "169", "Date": "June 22, 2017"}, {"Content": "Unusable since 'rebranding'. Crashes on EVERY article now. Have uninstalled and reinstalled several times with no improvement.", "Numbers": "170", "Date": "May 16, 2017"}, {"Content": "App constantly crashing and sending error reports every few seconds to every few minutes. Had to uninstall", "Numbers": "171", "Date": "December 8, 2017"}, {"Content": "Used to be my favourite news app. Current version just crashes so I can no longer use it. Love the new look though. device OS is up to date and I really don't have much else installed.", "Numbers": "172", "Date": "May 7, 2017"}, {"Content": "I love Huffington Post. I like the look of the new app but it crashes almost everytime I open a news story with a minute. Please fix this issue. Thanks for replying. I updated as instructed but it still crashes. I uninstalled and reinstalled it and it crashes more than before. Please fix it or go back to the old one...", "Numbers": "173", "Date": "April 30, 2017"}, {"Content": "Easy use, doesn't crash constantly like USA Today, ads are OK without over intrusion, like others mentioned that probably crash because of ad handling. Good content, constant updated content as well.", "Numbers": "174", "Date": "May 7, 2017"}, {"Content": "Always enjoyed Huffington post but the new huff post app crashes every time I try to load a new story. And I need my damn Huffington post news", "Numbers": "175", "Date": "May 5, 2017"}, {"Content": "I like the interface they've made. Doesn't crash. Easy to move around between sections.", "Numbers": "176", "Date": "April 28, 2017"}, {"Content": "Crashes constantly", "Numbers": "177", "Date": "April 28, 2017"}, {"Content": "Often first with reporting, embedded videos crash sometimes only issue. I like that avoiding clicking ads is easy enough, and they don't try to obscure the story with an ad you have to scroll around.", "Numbers": "178", "Date": "April 7, 2017"}, {"Content": "Love the content but the app is just awful. Links don't work, scrolling is hard and it regularly crashes.", "Numbers": "179", "Date": "March 9, 2017"}, {"Content": "Had to uninstall from two devices as kept crashing (even when not open).", "Numbers": "180", "Date": "December 8, 2017"}, {"Content": "On Android 7.1, crashing constantly!", "Numbers": "181", "Date": "April 25, 2017"}, {"Content": "Good app that has an occasional issue with crashing on my not so great tablet.", "Numbers": "182", "Date": "April 18, 2017"}, {"Content": "Crashes on opening, freezes up frequently, and have to force close to kill it.", "Numbers": "183", "Date": "February 28, 2017"}, {"Content": "Crashes every time I want to read a story.", "Numbers": "184", "Date": "February 27, 2017"}, {"Content": "Love huff po but it crashes alot, I've uninstalled and reinstalled it several times,", "Numbers": "185", "Date": "February 28, 2017"}, {"Content": "Has been crashing, but this is new. Perhaps update will solve. Would be nice to be able to join and long in easily to an account. For some reason this feature has never worked on this app. All that aside the HP app is the easiest to use, least intrusive and one of the more comprehensive. Is there any way at a you can negotiate some kind of extended article reading with any other the other major outlets? For instance, Washington Post and NYT limits the articles. I'm glad to pay, but do not want or need multiple for pay news apps. I would like one.", "Numbers": "186", "Date": "February 25, 2017"}, {"Content": "New version keeps freezing and crashing on Nexus 6P", "Numbers": "187", "Date": "February 23, 2017"}, {"Content": "Started crashing constantly. Uninstalled it!", "Numbers": "188", "Date": "February 14, 2018"}, {"Content": "Pretty straight forward app. Works well, has never crashed on my Samsung J7.", "Numbers": "189", "Date": "March 14, 2017"}, {"Content": "Great news feed, but the app crashes constantly.", "Numbers": "190", "Date": "February 13, 2017"}, {"Content": "Used to be great...now, crashes constantly, and \"breaking\" news is old news already!", "Numbers": "191", "Date": "February 14, 2018"}, {"Content": "Crashes and causes excessive battery use on Galaxy S8. Phone gets hot. Issue immediately resolved after deleting the app.", "Numbers": "192", "Date": "October 1, 2018"}, {"Content": "Crashes all the time", "Numbers": "193", "Date": "January 22, 2017"}, {"Content": "App seems to be robust no crashes compared to other apps for news.", "Numbers": "194", "Date": "January 25, 2017"}, {"Content": "Huff post review Loads fast, doesn't ever crash", "Numbers": "195", "Date": "January 9, 2017"}, {"Content": "Buggy, poorly designed garbage\nThis app just gets worse all the time. Constantly crashes and freezes up. Interface is horrible and buggy as hell. Beside that, it's Huffington Post. If your only interest is SJW garbage feminist whining, BLM pandering and non-stop childish name-calling headlines, then this is the safe space for you. Its basically the liberal version of Fox Nation. If you want real news delivered in an actually functioning app, then you should probably go elsewhere.", "Numbers": "196", "Date": "December 11, 2016"}, {"Content": "App crashes too often and when I attempt to share articles or copy a link it is blank.", "Numbers": "197", "Date": "December 14, 2016"}, {"Content": "seems like when i read a negative article about trump it either doesn't appear or crashes before i can read. otherwise i like the topics.", "Numbers": "198", "Date": "February 28, 2017"}, {"Content": "CRASHES! So annoying, can't read any articles....crashes every time! 11/28/16----The app still sucks....articles won't load and there is something wrong with the comment section. Huffington Post needs to fix these already this is getting ridiculous.", "Numbers": "199", "Date": "November 28, 2016"}, {"Content": "It gets worse w every update! Constantly closing. Won't open at all or can only read a few comments. And if you like one, that's it it crashes again. Reported numerous times.", "Numbers": "200", "Date": "November 28, 2016"}, {"Content": "Constantly hanging and crashing, can't read more than a few stories without the app going unresponsive and forcing me to totally close it. Was never this bad before, FIX IT!!!!!", "Numbers": "201", "Date": "November 28, 2016"}, {"Content": "Works fine. Rarely crashes like many other need apps, updated frequently", "Numbers": "202", "Date": "November 24, 2016"}, {"Content": "All my news This is a great app. No crashes and always there to give me the latest", "Numbers": "203", "Date": "November 24, 2016"}, {"Content": "Nice app Smooth, easy reading. No crashes.", "Numbers": "204", "Date": "November 22, 2016"}, {"Content": "I use it daily App always works for me. No crashes", "Numbers": "205", "Date": "November 12, 2016"}, {"Content": "Always crashing\nI love Huff Po, but I can't even used the app for a whole minute (not exaggerating). I just keep getting the \"unfortunately the Huffington Post has stopped working\". I've tried adjusting all kinds of app and android system settings... still, no luck. This is the only app on my device that has this problem... which sucks, cause I like to check Huff Po a lot... but I can't, with their app!", "Numbers": "206", "Date": "October 27, 2016"}, {"Content": "Crashes a lot. That's pretty much it. App just crashes every time I use it.", "Numbers": "207", "Date": "November 2, 2016"}, {"Content": "Keeps crashing Can only read the front page. Crashes every time I try to open another section.", "Numbers": "208", "Date": "November 2, 2016"}, {"Content": "Crashes. Links stop working", "Numbers": "209", "Date": "November 24, 2016"}, {"Content": "Poor Quality Content Presentation Poor stability. Crashes too often. Slideshows, video and other multimedia don't work reliably. Content from other sites doesn't fit in the app's constrained window. Frustrating app to use. Newer version still plagued with similar issues.", "Numbers": "210", "Date": "October 11, 2016"}, {"Content": "Crashes since latest update. Loved the app until latest update. Now crashes whenever I try to get to an article. Samsung S7 edge.", "Numbers": "211", "Date": "October 12, 2016"}, {"Content": "Goid app Sometimes crashes unexpectedly", "Numbers": "212", "Date": "October 12, 2016"}, {"Content": "Go to I enjoy this app rarely crashes and up to date info", "Numbers": "213", "Date": "October 4, 2016"}, {"Content": "Crashes less, still no landscape view No longer has two pane browsing, often displays only part or none of article with a black page instead. No open in browser option. Not a good newsreader app.", "Numbers": "214", "Date": "September 30, 2016"}, {"Content": "Flaky Crashes a lot. Pictures and vids may not display. Slightly more convenient than using a browser.", "Numbers": "215", "Date": "September 25, 2016"}, {"Content": "Responsive developer gets credit!\nI am impressed by the quick response of the developer to the issues I wrote of. - - I like the content but recent releases aren't working correctly. Latest issue is with the auto-download of stories. Even after updates I'm still seeing the app repeatedly download the same 9 pages. Not sure why this is happening. Also the app frequently freeze-crashes while downloading always on page 7/9. The only way to get it to run again is to force quit and restart.", "Numbers": "216", "Date": "September 15, 2016"}, {"Content": "Good app Only way i get to read Huffington Post. Never an issue with crashes", "Numbers": "217", "Date": "September 20, 2016"}, {"Content": "Great app Love this app. Great info and rarely crashes", "Numbers": "218", "Date": "September 21, 2016"}, {"Content": "Let's me read complete articles, huge variety, no crashes. Works great. Thanks!", "Numbers": "219", "Date": "September 6, 2016"}, {"Content": "Still a bit buggy I have run this app on numerous devices all of which experienced random crashes. They ranged from just having an article close, to crashing the entire program, and needing to have phone turned off and restarted before new stories would post.", "Numbers": "220", "Date": "August 31, 2016"}, {"Content": "Crashing today Usually great, but not today. Crashing on tablet and s5.", "Numbers": "221", "Date": "August 23, 2016"}, {"Content": "Sometimes crashes", "Numbers": "222", "Date": "August 22, 2016"}, {"Content": "Keeps crashing As technically unsound as any major news app out there. Usually have to uninstall and reinstall everything few months when some new update is released. I tried that quick fix again today but still no luck. As Donald Trump would say, \"Sad!\"", "Numbers": "223", "Date": "August 4, 2016"}, {"Content": "The greatest online news site. I'm glad I went back to it after it kept crashing a year ago or so. I really love the depth of information. The informative pieces as well as the diverse quality content. It's your one stop shop for ANY kind of news you may seek.", "Numbers": "224", "Date": "July 31, 2016"}, {"Content": "Love the site. App regularly breaks. I'll just use the mobile site since this is just a weak browser that crashes on HuffPost's own pages likely having to do with increasing the font size.", "Numbers": "225", "Date": "August 5, 2016"}, {"Content": "Suddenly started crashing Not sure what's happened but it started crashing on opening a couple of weeks ago. I've reinstalled but to no avail.", "Numbers": "226", "Date": "August 13, 2016"}, {"Content": "I use its widget feature on a daily basis, and its performance has improved (doesn't crash frequently like it used to).\nReally like the built-in blue light filter too. It's a great feature. A couple of minor quibbles: I wish there was an ability to filter out a few of the categories on the widget because for example, I have 0 interest in parent stories. Also would like the ability to share stories directly from the widget, but overall HuffPost is on the plus side. To the trolling reviewers who complain about liberal bias: SCREW YOU! I mean that. Go f**k yourselves. There are a plethora of right-wing apps. Use those, whiners.", "Numbers": "227", "Date": "September 1, 2016"}, {"Content": "Good improvement After horrid crash when changing orientation, it finally works well, on tablet or phone.", "Numbers": "228", "Date": "July 31, 2016"}, {"Content": "Whatever was done with the last update I can't pull a single article. Keeps crashing. Please fix or I'm removing the app", "Numbers": "229", "Date": "August 10, 2016"}, {"Content": "Great news source Only issue is that it sometimes crashes. .", "Numbers": "230", "Date": "August 18, 2016"}, {"Content": "Getting Worse Everyday... App crashes often when certain new section and/or article is opened. Also, its okay to have these bogus ads, but why do I get redirected to app store to download stupid apps? This has been happening more frequently. Please fix!", "Numbers": "231", "Date": "July 28, 2016"}, {"Content": "Keeps crashing Everytime I open the app it crashes immediately. Tried clearing cache but still crashes", "Numbers": "232", "Date": "July 17, 2016"}, {"Content": "Improvable Poor very poor. You can read any articles. Crash all the times. Please fix it. Samsung S6 Edge.", "Numbers": "233", "Date": "July 22, 2016"}, {"Content": "Easy and no crashes Easy to navigate and responsive. Good menu system. Has not crashed in the month of using.", "Numbers": "234", "Date": "July 22, 2016"}, {"Content": "My news Never crashed. Unbiased. Wish I could search", "Numbers": "235", "Date": "July 21, 2016"}, {"Content": "Used to CRASH wayyyyyyy too often, but seems to have been fixed. THANKS to the team or person responsible for this. The site is now enjoyable & informative. Must have gotten BBF 🙄(better bug fixes)🤗", "Numbers": "236", "Date": "July 10, 2016"}, {"Content": "Best News App I love this news app. So many things to read on it. News is more detailed than local news. I just wish it would not crash so much.", "Numbers": "237", "Date": "July 9, 2016"}, {"Content": "Works well. Rarely crashes. Love it!", "Numbers": "238", "Date": "July 9, 2016"}, {"Content": "Everything I want in a news app. The HuffPo app works great - it's completely intuitive and doesn't crash. And really, that's all I ask for in a news app.", "Numbers": "239", "Date": "July 12, 2016"}, {"Content": "Very good Great news and rarely crashes", "Numbers": "240", "Date": "July 11, 2016"}, {"Content": "Better than before Doesn't crash as much but could still use some improvement", "Numbers": "241", "Date": "July 9, 2016"}, {"Content": "Great app, nocrash, fast updating. Notifications on point", "Numbers": "242", "Date": "July 10, 2016"}, {"Content": "Great for news Has lots of news available with no crashes.", "Numbers": "243", "Date": "July 15, 2016"}, {"Content": "What happened?\nHas never been completely bug free since its inception but worked enough of the time. Recently every time you hit comment the app would crash. Every time without fail. This week a new update came out. Figured this was to fix the comment problem. Nope, now there is no comment button. And still crashes when you open up a story about 25% of the time. Also the icon keeps disappearing from my home screen. It's totally un-useable now.", "Numbers": "244", "Date": "July 8, 2016"}, {"Content": "Crashes more than it should Sometimes stories won't load. Can we switch up the stories. The jerry springer guest cutting off his penis story has been there for months. Can we switch it up already?", "Numbers": "245", "Date": "July 8, 2016"}, {"Content": "Great site, constantly updated, and good links, But crashes a lot. Big annoyance to have to restart.", "Numbers": "246", "Date": "July 8, 2016"}, {"Content": "Great App No crashes, opens quickly, and the articles are easy to find", "Numbers": "247", "Date": "July 8, 2016"}, {"Content": "Good It doesn't crash and loads fast", "Numbers": "248", "Date": "July 8, 2016"}, {"Content": "Great app, never crashes, well organized", "Numbers": "249", "Date": "July 9, 2016"}, {"Content": "Good content I appreciate the wide range of content in each section. Doesn't crash as much as it used to. ETA: after posting this review, I still keep getting the \"Do you like me? Yes or no?\" pop-up after every single article that I read. asking me if I want to review it. Hope this pop-up goes away soon.", "Numbers": "250", "Date": "July 8, 2016"}, {"Content": "CRASH, CRASH, CRASH I never used to have a problem with app. The last few months it's been horrible. Opening the app causes an error and automatically closes the app. With each upgrade I get my hopes up and think this (and many others) will finally be addressed. Sadly, that isn't the case.", "Numbers": "251", "Date": "July 8, 2016"}, {"Content": "Meh Ok... So let me change this. It's a good app it works well and it hasent crashed on me. All though it is a little naggy to get you to review it. But I'm just not a fan of the huge bias towards the left the Huff has. Its too hard to find a more moderate and less biased News source now days.", "Numbers": "252", "Date": "October 10, 2016"}, {"Content": "Good news app It's mostly a good app. Sports coverage is extremely limited and NHL coverage is non-existent. Other than that most topics are covered well. Easy to set your favorite sections and rarely has issues with crashing.", "Numbers": "253", "Date": "July 10, 2016"}, {"Content": "It's aight. The entertainment tab is always crashing. Always. Otherwise, its a good way to stay abreast of current events around the world.", "Numbers": "254", "Date": "June 27, 2016"}, {"Content": "Asks me to rate the app every time I pull up an article. Then after a few articles, it crashes. Although the content is good, its not worth the hassle of the popups to use the app.", "Numbers": "255", "Date": "July 9, 2016"}, {"Content": "Finally got it right I can actually read Huffington without the app crashing", "Numbers": "256", "Date": "July 8, 2016"}, {"Content": "Preferred news source The content aligns with my views. But the app periodically crashes and the requests to write a review are relentless.", "Numbers": "257", "Date": "July 11, 2016"}, {"Content": "Huffington Post app Great app! Dependable, had never crashed on me. I appreciate their slant on the news. (They all have one, this one agrees with my politics.)", "Numbers": "258", "Date": "June 28, 2016"}, {"Content": "Like the app Would have given 5 stars, but it crashes a lot.", "Numbers": "259", "Date": "June 26, 2016"}, {"Content": "Huff app Good app. Works well. Doesn't crash. Good content.", "Numbers": "260", "Date": "July 6, 2016"}, {"Content": "Crashes too much. Great articles when it running properly.", "Numbers": "261", "Date": "July 9, 2016"}, {"Content": "Easy to use. No crashes The app is easy to use, never crashes and gives tailored updates on news I follow.", "Numbers": "262", "Date": "June 30, 2016"}, {"Content": "Stable on my Nexus This app helps me keep up with news without crashing my phone.", "Numbers": "263", "Date": "June 27, 2016"}, {"Content": "Galaxy Note 5 Works seamlessly for my phone without crashing", "Numbers": "264", "Date": "July 21, 2016"}, {"Content": "Great app No crashing, lots of stories. Updates frequently.", "Numbers": "265", "Date": "July 16, 2016"}, {"Content": "Great app sometimes crashes but love the content.", "Numbers": "266", "Date": "June 25, 2016"}, {"Content": "Bad update App crashes constantly since updating, half the articles or comments won't even load, and most videos don't play.", "Numbers": "267", "Date": "June 16, 2016"}, {"Content": "Unstable slow and crashes", "Numbers": "268", "Date": "November 25, 2017"}, {"Content": "Way too many annoying ads Annoying ads will delete. Too bad in the past there was an acceptable balance. used this app as main news source but recent release crashes every second tap. will be moving on to another one.", "Numbers": "269", "Date": "April 29, 2016"}, {"Content": "This app crashes upon opening notification. It also crashes when opened from the home screen.", "Numbers": "270", "Date": "March 1, 2019"}, {"Content": "Crashes all the time, annoying visual changes on updates that makes it hard to get use to a new version. News are always about the same thing on the front page (politics, politics, Kardashians). It used to be a different kind of newspaper but it's just another opinion based news site", "Numbers": "271", "Date": "April 3, 2016"}, {"Content": "This is my go-to app for news, so I'm a bit frustrated that since I updated (and restarted the phone), the app has crashed 3 time in one hour! Obviously I kept going back, but it's what's holding me back from giving it 5 stars.", "Numbers": "272", "Date": "April 5, 2016"}, {"Content": "Thanks for update! Thank you so much for updating. Can now watch the videos and doesn't crash", "Numbers": "273", "Date": "April 18, 2016"}, {"Content": "Keeps crashing Everytime I scroll up and down to read the various stories on the main page , the app crashes and my phone restarts!!!!", "Numbers": "274", "Date": "March 31, 2016"}, {"Content": "Great news but very buggy app for Android Crashes often, some news articles don't even open", "Numbers": "275", "Date": "March 23, 2016"}, {"Content": "Good app Sometimes crashes, sometimes wont load or play embedded video but works well enough.", "Numbers": "276", "Date": "March 24, 2016"}, {"Content": "Constantly crashing Can't even open it. Uninstalling", "Numbers": "277", "Date": "March 23, 2016"}, {"Content": "All it does is crash.", "Numbers": "278", "Date": "March 4, 2016"}, {"Content": "Frustrating Very buggy and frequently crashes.", "Numbers": "279", "Date": "March 1, 2016"}, {"Content": "CRASH Nice update! All it does now is crash. I thought updates were to make the app. a better experience? Sometimes it is better to leave things alone. Ever heard the statement \"If it isn't broken, don't try to fix it\".", "Numbers": "280", "Date": "December 27, 2015"}, {"Content": "Liked it before but screwing with tablet Have Galaxy tab 4. App keeps crashing, turning itself off, freezing, random blank screens and now freezing my tablet. Fix it please!", "Numbers": "281", "Date": "January 18, 2016"}, {"Content": "Bug hides bottom of story\nApp doesn't crash any more, but a new bug has crept in: the bottom of the viewable area will sometimes go blank, failing to render the last half of the news story. Refreshing doesn't help. It is possible that this may be caused by an interruption in the communication of the communication stream, but I am not sure.", "Numbers": "282", "Date": "January 12, 2016"}, {"Content": "CRASH....CRASH...CRASH Why put out an update for \"bug fixes\" right when your programmers are going on vacation? This update won't even open... just keeps crashing.", "Numbers": "283", "Date": "January 3, 2016"}, {"Content": "Crashes Crashes when try to read comments. It seems to switch to browser mode, then crashes. Haven't been able to read comments since the latest version.", "Numbers": "284", "Date": "December 26, 2015"}, {"Content": "Constantly crashes when I try to open app. Need to fix. Can't use at all. Use to be my favorite news source. Seems others are having same problem.", "Numbers": "285", "Date": "December 31, 2015"}, {"Content": "Favorite app for news Would give a higher rating if the app would function properly. I've had alot of dropped articles in the past 2 months, where screen goes black...or white, in the middle of reading, then kicks me back out to main menu or crashes the app entirely. LOVE THE CONTENT, PLEASE FIX THE APP!", "Numbers": "286", "Date": "February 20, 2016"}, {"Content": "Constant crashes A \"BUG FIX\" That introduces bugs I didn't previously have, since this update the app constantly crashes. Uninstalled and subscribing to a real news paper.", "Numbers": "287", "Date": "February 18, 2016"}, {"Content": "App used to be good What happen? I used to be able to read up on my news on this app, but now every time I open the app up, it just crashes, please fix ASAP!", "Numbers": "288", "Date": "January 21, 2016"}, {"Content": "Nothing but pop ups and crashing Was good for awhile, but now no matter how many times I uninstall and reinstall, it crashes. Constant pop ups sending me back to the play store. No thanks.", "Numbers": "289", "Date": "July 17, 2016"}, {"Content": "Love it but crashes Love the website and app, but now the app keeps on crashing upon opening it. Such a waste since this is where I usually get my news along with CNN and Business Insider! (using LG G4)", "Numbers": "290", "Date": "February 7, 2016"}, {"Content": "Constant crashes Cannot even open the app anymore. Immediately crashes. Why they messed with it I don't know. Incompetent development team, puts out buggy program. Congratulations you ruined the app.", "Numbers": "291", "Date": "December 28, 2015"}, {"Content": "Unusable Can't even open up the app without it crashing. My favorite source... Shame", "Numbers": "292", "Date": "January 30, 2016"}, {"Content": "Contents good, app keeps crashing I love the contents, but the app keeps crashing and I get messages saying it's slowing my Galaxy s6 down. Had to uninstall. Sorry. Please fix. I'll try again in a couple of months", "Numbers": "293", "Date": "January 29, 2016"}, {"Content": "Crashes all the time smh! This used to be my go to app for current affairs. Till it got updated. Not been able to open a single article for over a month. Time to uninstall.", "Numbers": "294", "Date": "January 13, 2016"}, {"Content": "Won't load. Just crashes immediately, even after being updated. It's also wonderful how no one ever responds, ever, when there's a problem. 5th time this year this app hasn't worked.", "Numbers": "295", "Date": "December 29, 2015"}, {"Content": "Crashes constantly now :-( I've had this app on my phone for nearly a year w/few to no problems. It started crashing constantly a few days ago. Will uninstall for now and hope that whatever happened will be fixed soon! I'll miss you, HuffPo!", "Numbers": "296", "Date": "January 22, 2016"}, {"Content": "I like Huffpost but HATE the app. It's always crashing, and for some reason it won't play any videos for me (I'm on a samsung galaxy)", "Numbers": "297", "Date": "January 15, 2016"}, {"Content": "Crashes on open The app used to be great, but now crashes on open. Literally unusable.", "Numbers": "298", "Date": "January 25, 2016"}, {"Content": "Frequent crashes, white screen, flashing screen... I have a Nexus 6P with the latest Android. Are you guys testing your app?", "Numbers": "299", "Date": "January 24, 2016"}, {"Content": "Crash like hell, unusable It crash just after opening. Not even reading a single article. Occur on my Xperia Z2 and Nexus 7 2013.", "Numbers": "300", "Date": "January 8, 2016"}, {"Content": "It keeps crashing Please take care of this problem. I am missing my reading😪", "Numbers": "301", "Date": "December 26, 2015"}, {"Content": "Crashes Has crashed since last upgrade. Worked great before that", "Numbers": "302", "Date": "December 29, 2015"}, {"Content": "Newest Update Crashes then Sucks Memory Nee update is not playing nice with Galaxy. Had to uninstall.", "Numbers": "303", "Date": "February 25, 2016"}, {"Content": "All it does is crash. New update just crashes on launch. That's all it does. No more, no less. Crash.", "Numbers": "304", "Date": "December 30, 2015"}, {"Content": "Keeps crashing It will keep crashing after trying to click on other categories, been like this for months.", "Numbers": "305", "Date": "January 23, 2016"}, {"Content": "Don't bother Crash, crash, crash. Great upgrade!", "Numbers": "306", "Date": "December 26, 2015"}, {"Content": "Android app sucks!!! Can't even get it to stay open, send error report, send crash report, CRASH!!!", "Numbers": "307", "Date": "December 25, 2015"}, {"Content": "Worst App ever. Constantly crashes or won't open. A mouthpiece for the party that has destroyed the US See about", "Numbers": "308", "Date": "December 30, 2015"}, {"Content": "Keeps crashing Malfunctions each time I try to read an article.", "Numbers": "309", "Date": "January 30, 2016"}, {"Content": "The app crashes It doesn't work! Keeps crashing.", "Numbers": "310", "Date": "February 9, 2016"}, {"Content": "Crashing Kept crashing, unistalled, re installed now I can't find news from Puerto Rico", "Numbers": "311", "Date": "December 28, 2015"}, {"Content": "Crash, crash, CRAAASSSSHHH!! Try to share something, I dare ya!! Keeps crashing nonstop when I attempt to share a post", "Numbers": "312", "Date": "January 27, 2016"}, {"Content": "Keeps crashing Every time I try to read an article, it crashes and closes.", "Numbers": "313", "Date": "December 29, 2015"}, {"Content": "After the last update it keeps crashing. I can't even launch the app.", "Numbers": "314", "Date": "January 5, 2016"}, {"Content": "Crashes Unstable update. Continually crashes. Needs a fix urgently", "Numbers": "315", "Date": "February 6, 2016"}, {"Content": "Crashes, error Says \"connection problems\". Crashes", "Numbers": "316", "Date": "January 28, 2016"}, {"Content": "Crashing since update Not good.", "Numbers": "317", "Date": "January 29, 2016"}, {"Content": "Crash I liked it. Then it stopped loading. Gerrrr.....", "Numbers": "318", "Date": "January 20, 2016"}, {"Content": "Crashes. Please fix", "Numbers": "319", "Date": "January 23, 2016"}, {"Content": "Crashing constantly.", "Numbers": "320", "Date": "December 27, 2015"}, {"Content": "Crashes instantly", "Numbers": "321", "Date": "January 4, 2016"}, {"Content": "Keep crashing", "Numbers": "322", "Date": "January 28, 2016"}, {"Content": "Keeps crashing", "Numbers": "323", "Date": "March 23, 2016"}, {"Content": "Crash Used to be my go to news app but can't even open it now. Was working for a few months but won't even open up now.", "Numbers": "324", "Date": "December 23, 2015"}, {"Content": "Crashes It will not stop crashing", "Numbers": "325", "Date": "December 19, 2015"}, {"Content": "Used to be great. Now it never loads\nI used to love this app/site but all it does now is crash. Not only does it never remember my favorite sections forcing me to reselect them every time, the app hasn't even loaded in days. Blank white screens are so much more fun than the news I actually wanted to read! The quality of writing has also really gone down hill as the site has grown. This is if you actually receive an article and not just a teaser headline and then a video. If I wanted video news I would not be in an app.", "Numbers": "326", "Date": "October 18, 2015"}, {"Content": "As of late it keeps crashing. It use to work just fine. Even tried to uninstall and reinstall but it still crashes. Every update I lose my settings and bookmarks. Uninstalling now. 😔", "Numbers": "327", "Date": "November 24, 2015"}, {"Content": "App constantly crashes but at this point it doesn't matter since the \"news\" is so slanted. Regardless of one's political stance news should be unbiased. The stories and opinion pieces seem to promote division from a liberal perspective. And that's coming from a liberal. Fix your editing and fix your app!", "Numbers": "328", "Date": "February 23, 2018"}, {"Content": "Crashes my phone Need I say more... Can view list pages but when I click to read an article my phone freezes for about a minute causing none of the buttons to respond. Age of my phone I hear you say? 3 months old, if that's old well.......", "Numbers": "329", "Date": "December 16, 2015"}, {"Content": "Keeps crashing whenever I open. Tried restarting the phone and force closing the app; still won't even start up.", "Numbers": "330", "Date": "October 7, 2015"}, {"Content": "Crashes too often. I can't even use the share to another app feature without it completely crashing my entire phone. This app used to work wonderfully, not sure what happened.", "Numbers": "331", "Date": "November 14, 2015"}, {"Content": "Crash, crashing, crashes, crashed. This social media application stuff is apparently beyond the Huffington Post's capabilities. That is troublesome since it is their platform....", "Numbers": "332", "Date": "November 13, 2015"}, {"Content": "Crashes all of the time I have had earlier editions of this app, which operate wthout a hitch. This current release crashes after reading a few articles.", "Numbers": "333", "Date": "October 11, 2015"}, {"Content": "Crash crash ads crash STOP \"HELPING\". Every \"Update\" needs to be fixed a month later. Hire a real tech team or hang it up", "Numbers": "334", "Date": "October 26, 2015"}, {"Content": "Crashington Post Crashes everytime I open. Stop updating the app. Worked just fine before.", "Numbers": "335", "Date": "November 4, 2015"}, {"Content": "Getting worse Loved this app when I first got it, now everything resets at every update plus I can barely read 5 articles before it freezes and crashes. Not sure how much longer I will keep this app if they don't fix it", "Numbers": "336", "Date": "November 22, 2015"}, {"Content": "Garbage Tried to use the app because I can no longer load comments in the webpage. Customized my feed and it crashes immediately on load. Guess Im just done with huff entirely.", "Numbers": "337", "Date": "December 2, 2015"}, {"Content": "Can't open this app Worked great until today, will not let me open any articles. Crashes every single time. Please fix", "Numbers": "338", "Date": "November 17, 2015"}, {"Content": "No longer useful...\nThis used to be an awesome app but now it's just annoying. Crashes 8 times out of 10, articles slow to load or don't load at all, videos rarely work, article links often are too small to read and are not zoomable. Articles need to refresh more often and comments need to come back to the app. We ALL want the old configuration back.", "Numbers": "339", "Date": "December 9, 2015"}, {"Content": "Crash data !!! This app worked great but after the last update, you're unable to open the app. A window with \"crash data\" info pops up and kicks you off. Very disappointing! Uninstalling!!!", "Numbers": "340", "Date": "November 5, 2015"}, {"Content": "Poor! This app gets worse with every update. It now crashes every time I try to read an article or go to other sections.", "Numbers": "341", "Date": "November 14, 2015"}, {"Content": "Fine when it works, which is seldom. It crashes two out of three times on my android phone", "Numbers": "342", "Date": "December 11, 2015"}, {"Content": "Too crashy Crashes every time I share without fail. On LG G4 on T-Mobile", "Numbers": "343", "Date": "December 11, 2015"}, {"Content": "crashing perpetually App is not usable, crashes on opening it. Nexus 6 Android 5.1.1 T-mobile build", "Numbers": "344", "Date": "October 14, 2015"}, {"Content": "Great when it works . . . sucks when it doesn't & it doesn't work most of the time App now crashes or doesn't load at all most likely of the the time.", "Numbers": "345", "Date": "November 10, 2015"}, {"Content": "I like the site on our desktop However the mobile app keeps crashing. I had this problem before and was hoping it was fixed when i reinstalled it this morning.", "Numbers": "346", "Date": "October 23, 2015"}, {"Content": "Crashes Last few week I've tried to use this app it crashed the second I try to open it.", "Numbers": "347", "Date": "November 20, 2015"}, {"Content": "Kinda buggy Crashes often, can't share to external networks. Fix it already! :(", "Numbers": "348", "Date": "October 8, 2015"}, {"Content": "App Doesn't Work! It always crashes when I try to open it. I am uninstalling. Horrible!", "Numbers": "349", "Date": "November 27, 2015"}, {"Content": "Constant Crashing Can't read any stories. All this app does is crash.", "Numbers": "350", "Date": "November 23, 2015"}, {"Content": "Awful The app constantly crashes after the latest update. Please fix it.", "Numbers": "351", "Date": "October 4, 2015"}, {"Content": "CRAAASHH Keeps crashing, contemplating uninstalling.. going back to Buzzfeed", "Numbers": "352", "Date": "December 4, 2015"}, {"Content": "Used to be a good app Now keeps crashing and restarting.", "Numbers": "353", "Date": "November 5, 2015"}, {"Content": "What Happened?! My app keeps crashing! Hopefully it'll be fixed soon!", "Numbers": "354", "Date": "November 13, 2015"}, {"Content": "Now crashes Now closes every time you open it.", "Numbers": "355", "Date": "October 15, 2015"}, {"Content": "Crashes This app that crashes 100% of the time.", "Numbers": "356", "Date": "October 11, 2015"}, {"Content": "Buggy Keeps crashing on nexus 5 with marshmallow.", "Numbers": "357", "Date": "December 15, 2015"}, {"Content": "Crashes Crashes when I try to access comments", "Numbers": "358", "Date": "October 10, 2015"}, {"Content": "Keeps crashing. App continually crashes.", "Numbers": "359", "Date": "November 14, 2015"}, {"Content": "Huff post Used to love this, now it crashes every time I open it.", "Numbers": "360", "Date": "November 14, 2015"}, {"Content": "It keeps crashing now", "Numbers": "361", "Date": "December 17, 2015"}, {"Content": "Love it But once in a while it crashes", "Numbers": "362", "Date": "November 22, 2015"}, {"Content": "Keeps crashing.", "Numbers": "363", "Date": "November 6, 2015"}, {"Content": "Keeps crashing", "Numbers": "364", "Date": "October 21, 2015"}, {"Content": "Enough is enough Uninstalling the app. It doesn't remember my section preferences and I can only have them in alphabetical order not the order that I want. Many updates have not fixed any issues that I can find. Now the app crashes shortly after opening.", "Numbers": "365", "Date": "October 1, 2015"}, {"Content": "Fix it Everytime I click on a section to try to read on the left pane, the app crashes.", "Numbers": "366", "Date": "October 1, 2015"}, {"Content": "Crashing Crashing when opening", "Numbers": "367", "Date": "October 1, 2015"}, {"Content": "Bad update made even worse! App refreshes itself randomly in the middle of articles. Don't try to look at photos or videos unless you want the app to crash. New design looks awful--you don't have to make it match material design, it looked great before.", "Numbers": "368", "Date": "August 25, 2015"}, {"Content": "Crashes like crazy now I used this app all the time, but recent update has made it unstable on my nexus 7. If fixed back to 5 stars..", "Numbers": "369", "Date": "September 9, 2015"}, {"Content": "After logging in with Facebook. Crash Login with Facebook, to save settings and favorites it will crash every time I try to open it. Can't even get back to settings to reset. Please fix this, it was my favorite new app.", "Numbers": "370", "Date": "September 14, 2015"}, {"Content": "Open = Crash\nEvery morning for quite a while I have read the news in my Huffington Post app; big part of my morning tea and start routine. Now the app crashes when I try to open it. Galaxy S5... I just took the hit when my favorites disappeared. I powered through when my section order was no longer my choice. Alas, I have nothing to let slide, because I can't even get the app to open. So disappointed.", "Numbers": "371", "Date": "September 30, 2015"}, {"Content": "Crashes constantly I used to love this app, had all my favourite pages in the order I liked. Now Im lucky if I can read half an article before it crashes.", "Numbers": "372", "Date": "September 7, 2015"}, {"Content": "Crashes; won't open Had worked great previously, now it will not let me open the app. Will have to uninstall if not fixed soon.", "Numbers": "373", "Date": "September 5, 2015"}, {"Content": "Crashes Crashes constantly using the widget. I'll stick with NPR and PRI. They have better programs anyway.", "Numbers": "374", "Date": "September 9, 2015"}, {"Content": "Crashes Crashes every time I use it on my humble Hudl and pricey Samsung S5. Corruption of news item list on RHS except for front page. Poorly implemented and very frustrating especially considering the internet is THE medium of communication for HP", "Numbers": "375", "Date": "September 13, 2015"}, {"Content": "Keeps crashing Whenever I go to change the edition, the app simply crashes and needs to be uninstalled and reinstalled. Please fix it.", "Numbers": "376", "Date": "September 27, 2015"}, {"Content": "Favorites getting deleted, app crashing Favorite sections keep getting deleted. Today started crashing upon opening app. Galaxy S5 5.0", "Numbers": "377", "Date": "September 10, 2015"}, {"Content": "Crashing on startup Samsung Galaxy note 4 - won't even boot up anymore", "Numbers": "378", "Date": "August 25, 2015"}, {"Content": "Update awful No longer remembers starred topics and crashes all the time. Uninstalling because it does not work.", "Numbers": "379", "Date": "September 1, 2015"}, {"Content": "Used to love it but crashes on opening Since the last update the app wont open it just crashes whenever i try", "Numbers": "380", "Date": "September 28, 2015"}, {"Content": "Crashes Upon Opening Major bugs apparently. Crashes whenever I try to start the app.", "Numbers": "381", "Date": "September 5, 2015"}, {"Content": "Crashes before anything Can't even load this app anymore. Garbage.", "Numbers": "382", "Date": "September 10, 2015"}, {"Content": "Stopped working! Always crashes on startup, so have uninstaled it!", "Numbers": "383", "Date": "September 9, 2015"}, {"Content": "App no longer works App crashes, won't open, won't work at all", "Numbers": "384", "Date": "September 17, 2015"}, {"Content": "Huffpost Crashes With every use application crashes", "Numbers": "385", "Date": "September 20, 2015"}, {"Content": "Crashes often especially when trying to view comments.", "Numbers": "386", "Date": "August 26, 2015"}, {"Content": "Doesn't work! Crashes every time", "Numbers": "387", "Date": "September 16, 2015"}, {"Content": "Crap Crashes every single time. Useless.", "Numbers": "388", "Date": "September 28, 2015"}, {"Content": "Needs update Crashes all the time", "Numbers": "389", "Date": "September 3, 2015"}, {"Content": "Crashes App crashes as soon as it opens", "Numbers": "390", "Date": "September 2, 2015"}, {"Content": "Keeps crashing and can't use it", "Numbers": "391", "Date": "September 21, 2015"}, {"Content": "Keeps crashing Constantly crashes", "Numbers": "392", "Date": "August 27, 2015"}, {"Content": "Crashes all the time!", "Numbers": "393", "Date": "September 16, 2015"}, {"Content": "Crashes constantly Uninstalling", "Numbers": "394", "Date": "September 10, 2015"}, {"Content": "Crash on load", "Numbers": "395", "Date": "September 10, 2015"}, {"Content": "Keeps Crashing Since the update I cannot view any galleries. Just like everyone else is writing, it crashes, asks if I want to send a report, says there is an error, then dumps me back at the beginning. Uninstalling my former favourite news app :(", "Numbers": "396", "Date": "August 17, 2015"}, {"Content": "Constantly crashes I'm very disappointed with this app. This used to be a great source of information. It still is, if you only want to read the articles. As soon as I try to follow links to photo galleries, CRASH. Every time. Wrote a report with NO return. I think I'll uninstall it very soon...", "Numbers": "397", "Date": "August 6, 2015"}, {"Content": "HTC One M9 running Android 5.1\nThe recent update has made this previously great app near impossible to use. I cannot share an article, I can only read it. When I try to share it the app crashes every time. Also, I cannot make videos full-screen anymore. I'm not sure if there's more problems, but if I find more I'll update this. I hope this info helps the devs fix these issues.", "Numbers": "398", "Date": "August 8, 2015"}, {"Content": "OK but crashes while loading sideshow With the updated version, every time I click on a slide show the app crashes. The report is \"sent\" to the server, apparently but I haven't seen any updates yet. Apart from that the app is good.", "Numbers": "399", "Date": "August 19, 2015"}, {"Content": "where are all the articles?! several categories only have a few. today lifestyle had only 3 articles. this USED to be my favorite app... crashes EVERY SINGLE TIME I try to use this app", "Numbers": "400", "Date": "August 5, 2015"}, {"Content": "Last update ruined app It was a great app until the last update several weeks ago, but now it crashes every time I try to access a slide show or picture content. Ridiculous. Fix it, please.", "Numbers": "401", "Date": "August 19, 2015"}, {"Content": "Terrible This used to be great but since the latest update, I can't follow a single link. Every time I try to, it crashes, tells me it's stopped and do I want to submit a report.", "Numbers": "402", "Date": "August 2, 2015"}, {"Content": "What the hell has happened? Did you even bother to test this app? Always crashing since last update. The colour scheme is dreadful. A great app gone bad. Poor show.", "Numbers": "403", "Date": "August 12, 2015"}, {"Content": "This new version of your app is terrible there are no videos it keeps crashing continually I'm so fed up with this new app that I am going to uninstall. Your old at was fantastic and you have ruined a really good thing is this something that you can do to fix this because I used to really really enjoy Huffington Post now you have made it an absolute disaster kid", "Numbers": "404", "Date": "August 11, 2015"}, {"Content": "Update ruined the app Using note 4 and everytime i click on a picture gallery the app crashes. Used to love huff post app but it's really annoying now.", "Numbers": "405", "Date": "August 8, 2015"}, {"Content": "If only I could see the content Constantly reloading to the top, crashes out of any linked article so I can't read them. It stopped saving the categories I want to read so I just don't anymore. Deleting this app soon if these latest updates aren't fixed. This was my go to news app.", "Numbers": "406", "Date": "August 18, 2015"}, {"Content": "What's the point? Can't open any links! Every time I try it crashes and closes the article. What a waste. Used to be great.", "Numbers": "407", "Date": "August 22, 2015"}, {"Content": "Don't fix what isn't broken Since this most recent update I can't open any slide shows because it crashes, and the hideous new green is distracting compared to the subtle green of the past. Most disappointed.", "Numbers": "408", "Date": "August 5, 2015"}, {"Content": "FIX IT NOW!!\nIn addition to the problem below, the app now crashes every time I try to open it. It's just about time to uninstall. This used to be my go-to app for news... USED TO BE. Now every single freaking time I fire it up, I have to reset my preferred sections. I'm sure sections like Global Motherhood are perfectly valid & relevant for many people... but not for me. PLEASE stop trying to ram these sections down our throats!", "Numbers": "409", "Date": "August 11, 2015"}, {"Content": "Was my favorite I have no idea what happened but the update is terrible...it keeps crashing", "Numbers": "410", "Date": "August 3, 2015"}, {"Content": "Marginally OK Running out of patience with what was once a great app. Jesus Huff. Crack open the purse and pay for coders who can build an app that doesn't crash every 5 minutes.", "Numbers": "411", "Date": "July 31, 2015"}, {"Content": "Used to work Crashes when I try to view a picture gallery since last update.", "Numbers": "412", "Date": "August 12, 2015"}, {"Content": "Keeps crashing. I love this website but it needs to be fixed to avoid crashes. Latest update unable to load latest news or maybe it does it automatically.", "Numbers": "413", "Date": "July 31, 2015"}, {"Content": "Keeps crashing Every time I click on a slideshow within an article, the app crashes and asks if I'd like to report the error. This has only happened since the last update. Not impressed!", "Numbers": "414", "Date": "August 6, 2015"}, {"Content": "I love this app! But I am having problems with it since the new update. I can't view any photo albums. The app crashes. Please advise.", "Numbers": "415", "Date": "August 6, 2015"}, {"Content": "Picture gallery crashes New update crashes the app every time I click on a picture gallery within a story. I uninstalled app and reinstalled and still getting error. :(", "Numbers": "416", "Date": "August 14, 2015"}, {"Content": "New update ruined it Latest update ruined the app. It crashes often, can never view photo galleries, color scheme is bad, etc. Can we not get any response from the developer that at least the stability issues are being addressed? I've deleted the app for now because it is so useless.", "Numbers": "417", "Date": "August 23, 2015"}, {"Content": "Ruined The newest updates have ruined this app completely. It's basically unusable now. Constantly crashes.", "Numbers": "418", "Date": "August 16, 2015"}, {"Content": "This used to be my go to application for my daily dose on news. The articles are varied and generally interesting, although there are a lot more articles on the WEB page than in the application. One of the negative for me is that some of the \"news\" items are really dumb, but I suppose you don't have to read article you don't like. HOWEVER, since the last update the application always crash when we open a picture gallery (and they have those in the majority of the articles). At first, I thought it was only my phone, but I see that everybody else is having the same problem. This should have been detected before publication. Here, nothing. No mention of the problem on the Google Play page and still no fix after close to a month. It worked before, so it shouldn't be too hard to fix, so either fix it or if your programmers are too incompetents, bring back the previous version, but there is no reasons to drag that problem for weeks. Until the problem is fixed, it's not worth installing.", "Numbers": "419", "Date": "August 25, 2015"}, {"Content": "Crashes Loved the old version... New version crashes every time you open pictures, links, or slideshows on articles", "Numbers": "420", "Date": "August 19, 2015"}, {"Content": "Now un-installed Since the last update this app crashes all the time. Un-installed and reinstalled it with no improvement. Sent numerous crash reports. Now un-installed permanently.", "Numbers": "421", "Date": "July 31, 2015"}, {"Content": "Unusable App crashes EVERY TIME I click on a link or photo gallery below an article. They are inaccessible.", "Numbers": "422", "Date": "August 13, 2015"}, {"Content": "Gone downhill After latest update it keeps crashing, an if you accidentally click download it just does it without asking and there's an ad banner you've to get rid of every time. Uninstalled.", "Numbers": "423", "Date": "August 1, 2015"}, {"Content": "Buggy. Every time I open an article through the widget, it asks me to set the default application. Constantly crashes when it isn't open, and creates the \"Unfortunately, Huffington Post has crashed.\" message that overlays any app you have open multiple time before it stops.", "Numbers": "424", "Date": "August 17, 2015"}, {"Content": "Can't view pics Used to be great but can no longer view pics ..crashes every time!", "Numbers": "425", "Date": "August 14, 2015"}, {"Content": "Poor app Is there a proof reader for this app? Amazed by the frequency of poor spelling or grammar but more importantly it crashes whenever any link is clicked, crap app 😨", "Numbers": "426", "Date": "August 4, 2015"}, {"Content": "Crashes everytime. .. Crashes everyone yo go to the pictures Gallery or click on links within a story. No fun. :( This has been since the latest update. Samsung 6", "Numbers": "427", "Date": "August 15, 2015"}, {"Content": "New update terrible I dislike the new update. It's so buggy and keeps crashing! !! Please fix!", "Numbers": "428", "Date": "August 4, 2015"}, {"Content": "Doesn't work Crashes constantly on my note 4 so is completely unusable.", "Numbers": "429", "Date": "August 21, 2015"}, {"Content": "This app sucks now Used to be my favorite and now it crashes all the time. Deleting it if there's not a update fix soon.", "Numbers": "430", "Date": "August 9, 2015"}, {"Content": "New update Since the new update it crashes every time I try to open something", "Numbers": "431", "Date": "August 4, 2015"}, {"Content": "What were they thinking? After last update it crashes whenever a slideshow link is selected. Galaxy Tab S 8.4", "Numbers": "432", "Date": "August 1, 2015"}, {"Content": "Update is not a good one Buggy, crashes, and the inability to arrange the sections as I want, this is frustrating!", "Numbers": "433", "Date": "August 2, 2015"}, {"Content": "How many times can an app crash? Every time I try look further into a story. Uninstalling.", "Numbers": "434", "Date": "August 9, 2015"}, {"Content": "Updates Awful update, constantly crashes whenever you wish to view the gallery or outside links. Uninstalling!", "Numbers": "435", "Date": "August 4, 2015"}, {"Content": "Crashes Since last update anytime i try to open a picture slideshow in an article it crashes. Very frustrating!", "Numbers": "436", "Date": "August 6, 2015"}, {"Content": "Worst app after the update Keeps crashing, can't rearrange sections to your liking fix it please.", "Numbers": "437", "Date": "August 11, 2015"}, {"Content": "Sort out the Image galleries I love the HuffPost and I read it daily but I can't open a single image gallery without it crashing! It needs sorting.", "Numbers": "438", "Date": "August 22, 2015"}, {"Content": "Keeps crashing Every time I try to open a sideshow it crashed. Becoming a useless app!", "Numbers": "439", "Date": "August 1, 2015"}, {"Content": "Update ruined app Links to articles and sideshows constantly crash. App is mostly unusable. Please fix.", "Numbers": "440", "Date": "August 23, 2015"}, {"Content": "Disastrous Update Every time I try to open a slide show it crashes.", "Numbers": "441", "Date": "August 4, 2015"}, {"Content": "Horrible redesign. Keeps crashing when trying to look at picture slides. Fix this app!", "Numbers": "442", "Date": "July 31, 2015"}, {"Content": "Crashes I have enjoyed the app in the past, but lately (for the last long while) it crashes when I try to get content. Boo.", "Numbers": "443", "Date": "August 18, 2015"}, {"Content": "Keeps crashing When a gallery is selected the app crashes. Fix needed asap.", "Numbers": "444", "Date": "August 10, 2015"}, {"Content": "Latest update is buggy. I'm now unable to open picture galleries or links without the app crashing.", "Numbers": "445", "Date": "August 11, 2015"}, {"Content": "Ever since the last Android update this app constantly crashes.", "Numbers": "446", "Date": "August 19, 2015"}, {"Content": "Keeps crashing when loading in-story articles are clicked", "Numbers": "447", "Date": "August 14, 2015"}, {"Content": "Used to love this appeal now it crashes constantly. Truly disappointing.", "Numbers": "448", "Date": "August 18, 2015"}, {"Content": "Problems / crashes Upgrade is causing the app to timeout at random", "Numbers": "449", "Date": "August 1, 2015"}, {"Content": "Uninstall and install app fixes some of crashing.", "Numbers": "450", "Date": "August 22, 2015"}, {"Content": "Always Crashes Linked articles cause it to crash.", "Numbers": "451", "Date": "August 19, 2015"}, {"Content": "The update It was a great app to read all the news the new update crashes to much and doesn't work as it should!", "Numbers": "452", "Date": "August 3, 2015"}, {"Content": "No good anymore keeps crashing", "Numbers": "453", "Date": "August 18, 2015"}, {"Content": "Sad I love Huffington but it keeps crashing, even after I reinstalled it.", "Numbers": "454", "Date": "August 5, 2015"}, {"Content": "Fantastic Keeps crashing ..fix it or I'm leaving", "Numbers": "455", "Date": "August 12, 2015"}, {"Content": "Crash every time", "Numbers": "456", "Date": "August 8, 2015"}, {"Content": "Crashes frequently", "Numbers": "457", "Date": "August 4, 2015"}, {"Content": "Crashes suddenly", "Numbers": "458", "Date": "August 22, 2015"}, {"Content": "Deleted twice, reinstalled, hopefully it will work. I have been a fan for years, but the continual crashes, stupid headlines (do I really need to see creepy Disney for 4 days? Nothing else is happening? ) and poor headlines have made me weary. I won't reinstall next time.", "Numbers": "459", "Date": "July 18, 2015"}, {"Content": "Irritating Every day I have to reset my sectiobs. At times, I can't pin articles that I desire. It crashes repeatedly. And the content is becoming ridiculous. Huffington Posy needs serious work!", "Numbers": "460", "Date": "July 17, 2015"}, {"Content": "Crash! The app has decided that it doesn't want to open any story, with the exception of the lead story. What's the point of even attempting any other story when all it does is crash then ask if I'd like to send a report.", "Numbers": "461", "Date": "June 27, 2015"}, {"Content": "just crashes. media and slideshow now crashing the app and mobile buzzes about 10 times while sending bug report. so had to delete.sorry loved it but after several emails the app has gotten worse.", "Numbers": "462", "Date": "July 31, 2015"}, {"Content": "Crashing constantly! Had this app for over a year like many others and LOVED it, more recently (after last update) it has become unusable. Stories were taking forever to load, and now I can't open any story. What is going on???", "Numbers": "463", "Date": "June 28, 2015"}, {"Content": "Weird interface and crashes Pulls lots of graphics on opening page and I have limited bandwidth. It also crashes. I am uninstalling. Simpler would be better.", "Numbers": "464", "Date": "July 31, 2015"}, {"Content": "CRASH CONSTANTLY LoveD Huff Post. But....until bugs are fixed I will uninstall. Crashes on just about every single article I click on, SEVERAL times. *Aquos Crystal Sharp", "Numbers": "465", "Date": "June 28, 2015"}, {"Content": "Updating my review to reflect my new device. I still enjoy the articles very much and the crashes and commenting seems to be working normally. My issue now is that each time I open an article it requests to know which application i want to open it with. Obviously I want this app to open it as that is where I am opening it from.", "Numbers": "466", "Date": "July 11, 2015"}, {"Content": "loosing my patience please tell me why my sections list randomly changes and if it can be fixed...but that won't even matter if the app keeps crashing before it loads.", "Numbers": "467", "Date": "June 28, 2015"}, {"Content": "Was 5 now 1 Every article I tap makes the app crash. Cannot read any news at all.", "Numbers": "468", "Date": "June 28, 2015"}, {"Content": "Was a decent app.... Was a good app. Now all it does is crash and push ad banners. Pathetic...dont was your time", "Numbers": "469", "Date": "June 28, 2015"}, {"Content": "Updates introducing major bugs Last update removed comments, and opening any bookmarked story immediately crashes the app, with no error thrown or any indication of what is going on", "Numbers": "470", "Date": "June 17, 2015"}, {"Content": "Hate it Used to be one of my favorite apps. Now it constantly crashes. Hate the new ad bars too.", "Numbers": "471", "Date": "August 19, 2015"}, {"Content": "Latest update crashes with every attempt. Strange lines appear on the list of stories, the app freezes & crashes - every damned time", "Numbers": "472", "Date": "July 5, 2015"}, {"Content": "Crashes every attemp Since the last update the app crashes whenever I open an article", "Numbers": "473", "Date": "June 28, 2015"}, {"Content": "ALWAYS crashing can't even read an article. Had this app for a long time now I can't even use it.", "Numbers": "474", "Date": "June 28, 2015"}, {"Content": "Crashes This started crashing yesterday. Where's the fix? Do you not care?", "Numbers": "475", "Date": "June 28, 2015"}, {"Content": "Crashes Every time I open an article, it closes.", "Numbers": "476", "Date": "June 28, 2015"}, {"Content": "Why isn't the news updating?!!\nUpdating my post... WTH, Huffpost? Where is the U.S. news?? Your update hosed the entire app. Videos and images don't open, different articles show up than the one I click on, app crashes, and the worst...news DOESN'T UPDATE!! Articles in News section are fluff and they update MAYBE every two days. Terrible. Please respond to all these complaints from long-time users. I will update review when issues fixed. Thku.", "Numbers": "477", "Date": "July 18, 2015"}, {"Content": "Hate the new layout! Crashes alllll the time.", "Numbers": "478", "Date": "August 18, 2015"}, {"Content": "Have loved this app but now crashes when I try to open an article.", "Numbers": "479", "Date": "June 28, 2015"}, {"Content": "Update Constantly crashing now", "Numbers": "480", "Date": "June 27, 2015"}, {"Content": "Crashes constantly!!!! See above. Useless app!", "Numbers": "481", "Date": "August 6, 2015"}, {"Content": "New update Crash crash crash", "Numbers": "482", "Date": "August 20, 2015"}, {"Content": "Not the best Changing review from 3 to 1. App updated this week, and began crashing every time I tried opening comments. This morning I reinstalled the apps and comment option is gone completely. The most entertaining (and sometimes informative and thought-provoking) aspect of HP is gone.", "Numbers": "483", "Date": "May 30, 2015"}, {"Content": "Fix this\nSince it was first introduced several years ago this app has gotten progressively worse with each release to the point where it's now barely usable. How do you not notice that clicking on 'comments' crashes the app 100% of the time? Edited: Another update another step in the wrong direction. Faced with the app crashing every time you click 'comments', HP's solution is to take away the option to view comments. Problem solved!! LOL", "Numbers": "484", "Date": "May 31, 2015"}, {"Content": "Huff POor!!! You \"fix\" the comment crash problem by removing comments all together? Really!?", "Numbers": "485", "Date": "May 31, 2015"}, {"Content": "Comments crashed for over a week and now there is no comments section. Removing the app.", "Numbers": "486", "Date": "June 1, 2015"}, {"Content": "Bad update No commits. Crashes every so often", "Numbers": "487", "Date": "June 1, 2015"}, {"Content": "Love the app- hate the crashes Suddenly dissappeared from my home page, then crashes every time I open the comments section- tried uninstalling and reinstalling.. Running Kit Kat 4.4.2 on LG G3 plz help", "Numbers": "488", "Date": "May 29, 2015"}, {"Content": "Force closes and crashes Before the new update it was a great app now it's always force closing and won't even work properly. Please fix asap", "Numbers": "489", "Date": "October 13, 2014"}, {"Content": "Widget buggy The widget is buggy and crashes randomly. Does not hold default setting for using huff post to view article. Every article you go into you have to select which app to use to open it.. very tedious. Tried uninstall and reinstall on S3", "Numbers": "490", "Date": "November 3, 2014"}, {"Content": "Lately it has serious problems. Crashes, stalls, slow, unpredictable and unreliable. Other than that, a great product.", "Numbers": "491", "Date": "January 11, 2015"}, {"Content": "Fixed. It's Google forcing crashes. Googles android webview update is crashing lots of apps. It's not HuffPo. Uninstalled update, apps work fine.", "Numbers": "492", "Date": "April 26, 2015"}, {"Content": "So. Many. Crashes. I enjoy HuffPo but this app can't handle a lot of the linked content. Your dev group needs to get its act together.", "Numbers": "493", "Date": "February 24, 2015"}, {"Content": "Crashes constantly The new update crashes whenever I try to access the menu or select articles.", "Numbers": "494", "Date": "October 17, 2014"}, {"Content": "Could be better This app tends to crash a lot.", "Numbers": "495", "Date": "January 16, 2015"}, {"Content": "I can't use it It keeps crashing. I don't know if using the UK version is the problem. It stops and exits. Please sort it out.", "Numbers": "496", "Date": "August 8, 2016"}, {"Content": "It's crashing like cray Fix it!", "Numbers": "497", "Date": "December 20, 2014"}, {"Content": "Crashes often", "Numbers": "498", "Date": "April 5, 2015"}, {"Content": "UI issus and ads make it annoying Some times I can't even read news because the popups keep on directing it to my browser. Crashes from time to time as well. I'd gladly pay for the app if the annoying ads will be gone", "Numbers": "499", "Date": "September 22, 2014"}, {"Content": "Not working anymore. Reloaded It was working nicely. Now it crashes as soon as i select the second news. It is going on from some months. New updates came but it is still buggy on my toshiba. Since huffpost is just an online news site it is just embarrassing how little they care about the app working or not", "Numbers": "500", "Date": "January 22, 2015"}, {"Content": "Suddenly crashing This app was one of my most used until last week. Now it crashes every time I attempt to navigate away from HuffPo's homepage. Please fix.", "Numbers": "501", "Date": "April 28, 2015"}, {"Content": "Stalls, freezes, crashes, will not refresh. Multi media content often broken. Better off using mobile browser. This is a case of developers adding more extraneous functionality when they should be just delivering solid core functionality. Update 3/26/2017. Installed again a few months back. Does not crash so much, but if you play any media in it, then bring another app to the forground, huffpo app still plays the media, and the keeps playing more media. You can't see it but you can hear it. Uninstall!", "Numbers": "502", "Date": "March 27, 2017"}, {"Content": "A mini grexit discrimination? ;)\nI wanted to open an article of the German edition, but it's constantly crashing if try. This problem seems to be only there(I tried to open articles from different editions randomly and they were all working fine). Would be great if that problem could get fixed. Otherwise it's a great app, prefer the articles over different newsapps and it's well arranged.", "Numbers": "503", "Date": "June 29, 2015"}, {"Content": "Crash burn App kept crashing. I uninstalled it and then tried to reinstall it but am unable to reinstall. Hope this is fixed soon this is my favorite news app.", "Numbers": "504", "Date": "June 28, 2015"}, {"Content": "Unstable *updated* working great again Latest update causing constant crashes and will not open up any articles. HTC one m8 *update* back to working, best news source on the net", "Numbers": "505", "Date": "May 1, 2015"}, {"Content": "Great. Please install Adobe Flash before using this app.\nThe installation of this app either needs to tell you that you need to have Adobe Flash installed separately or automatically install it for you. Of course Flash is discontinued for Android so what do we do? I've manually installed Flash so it works some but crashes a good bit and still loads blank pages. Well, I still like the articles…", "Numbers": "506", "Date": "December 30, 2014"}, {"Content": "Comments Crash, Editors MIA\nIndeed as others have said, Trying to read or write comments garners constant crashes. Quality of material, especially headlines, has continued to deteriorate since the Editors abandoned HP for more visible talking head positions in Cable News broadcasts. Finally had to uninstall. Trying so hard to constantly coerce clicks. You will end up in the end with none.", "Numbers": "507", "Date": "July 28, 2015"}, {"Content": "Crashing endlessly Tecs, what did you do? Adrianna will have your heads.", "Numbers": "508", "Date": "June 28, 2015"}, {"Content": "Was the best, now just sucks... Crashes whenever an article is clicked on. Who was behind this app - the same people who made the this American life app?", "Numbers": "509", "Date": "June 28, 2015"}, {"Content": "Crashes fixed After repeating install and delete it seems to be working. My favorite news source....glad to have it back", "Numbers": "510", "Date": "June 29, 2015"}, {"Content": "Can't open any articles This app was great, now it's broken. Tapping on an article either crashes the app or takes you back to the main page. Fail! I can't read your articles!", "Numbers": "511", "Date": "April 25, 2015"}, {"Content": "Great articles, terrible app Love the articles. Great job on this. But app evaluation is mediocre. It crashes all the time and usability hasn't been updated and improved since launched.", "Numbers": "512", "Date": "July 17, 2015"}, {"Content": "Awful\nThis app is garbage. Not only are the majority of news articles uninteresting, it crashes all the time. The search feature is completely useless and causes the app to crash almost everytime. Shouldn't updates make the app better? It's pretty embarrassing when you continually make your product worse everytime you put your hands on it.", "Numbers": "513", "Date": "June 1, 2015"}, {"Content": "Crashing Turns out it was a Google update causing the crashes. Not a Huff Po issue.", "Numbers": "514", "Date": "April 26, 2015"}, {"Content": "crashed I have an LG g3 and this app is blank. settings work and that's about it.", "Numbers": "515", "Date": "October 22, 2014"}, {"Content": "Constantly Crashing I loved the app, but now in the tech section when i open articles, the app crashes everytime. Please fix this bug. Thanks.", "Numbers": "516", "Date": "June 29, 2015"}, {"Content": "Constantly crashes I can't give a better rate as the app crushes constantly since the latest update.", "Numbers": "517", "Date": "April 26, 2015"}, {"Content": "Crash and burn! Test your freaking updates b4 release will you?! every story link crashes with new release. sloppy sloppy sloppy QA.", "Numbers": "518", "Date": "June 28, 2015"}, {"Content": "New update = Constant crashes Had this app for a long time without problems....and now it is unusable", "Numbers": "519", "Date": "June 28, 2015"}, {"Content": "Crashing every time I used to love this app, but after last update it crashes every time I open it", "Numbers": "520", "Date": "April 29, 2015"}, {"Content": "Love the website conten App just sucks. Looks nice crashes all the time. If not crashing freezing. Fix it!!!", "Numbers": "521", "Date": "October 8, 2014"}, {"Content": "Good content; app still buggy Love the news & editorials but app can be slow and still crashes at times.", "Numbers": "522", "Date": "June 27, 2015"}, {"Content": "Keep Crashing Self explanatory.", "Numbers": "523", "Date": "June 27, 2015"}, {"Content": "What happened? This was my favorite news app, but recently it started crashing advert clicking on any article. It is now impossible to use.", "Numbers": "524", "Date": "June 28, 2015"}, {"Content": "Now buggy with few story updates I used to like this, but recently it crashes, and the stories remain the same for days. HP, you have 1 week to get this fixed or i am uninstalling", "Numbers": "525", "Date": "July 17, 2015"}, {"Content": "Usable Glitches and crashes all the time, has for the last couple years, but I still use it nearly every day so it can't be all that bad right?", "Numbers": "526", "Date": "November 19, 2014"}, {"Content": "Crashing all the time One of my top apps is now crashing constantly.", "Numbers": "527", "Date": "June 28, 2015"}, {"Content": "Ugh! Now constantly crashing. Headlines are updated but the actual stories aren't. Many stories with missing videos. Images missing from stories. What the fawk!? Fix the damn thing.", "Numbers": "528", "Date": "July 7, 2015"}, {"Content": "Crashes every time Has stopped working correctly - worthless!", "Numbers": "529", "Date": "June 28, 2015"}, {"Content": "Garbage! The old app was full of gliches but now it crashes constantly. I can't read the news at all now.", "Numbers": "530", "Date": "November 22, 2014"}, {"Content": "App crashed, then no comment section on my phone. Uninstalling.", "Numbers": "531", "Date": "June 1, 2015"}, {"Content": "So many bugs and crashes Used to be ok but its a useless app now. Need to uninstall.", "Numbers": "532", "Date": "September 26, 2014"}, {"Content": "Crashing As of this morning the app crashes when I try to open any article.", "Numbers": "533", "Date": "June 28, 2015"}, {"Content": "Crashing When opening any news story, it crashes.....please fix☺, thank you. galaxy S4.", "Numbers": "534", "Date": "June 28, 2015"}, {"Content": "I've used it every day for years. It is now unusable as it always crashes.", "Numbers": "535", "Date": "April 18, 2015"}, {"Content": "Terrible! Worst news ever freezes,crashes no updates absolute rubbish!!!", "Numbers": "536", "Date": "May 2, 2015"}, {"Content": "Crash Since the creation of this app, all it does is crash.", "Numbers": "537", "Date": "June 27, 2015"}, {"Content": "Impossible to use Crash on start up after last update", "Numbers": "538", "Date": "July 20, 2015"}, {"Content": "Italian version Keep Crashing when opened. Unusable.", "Numbers": "539", "Date": "July 28, 2015"}, {"Content": "Crashes all the time Open an article it crashes", "Numbers": "540", "Date": "June 28, 2015"}, {"Content": "Crashes all the time or just simply won't open articles.", "Numbers": "541", "Date": "July 6, 2015"}, {"Content": "Love it Getting irritated!! Love this news source but it won't let me open articles it keeps crashing! Update please!!!!!", "Numbers": "542", "Date": "June 28, 2015"}, {"Content": "Crashing Will not open crashes.", "Numbers": "543", "Date": "June 28, 2015"}, {"Content": "When it doesn't crash or stops updating articles, I enjoy using this app.", "Numbers": "544", "Date": "July 21, 2015"}, {"Content": "Uninstalled n reinstalled. ..FIXED!!! No more problems with crashing n got the white background I wanted!!!!!!", "Numbers": "545", "Date": "June 27, 2015"}, {"Content": "Update Update crashes the app.", "Numbers": "546", "Date": "April 28, 2015"}, {"Content": "Constant crashes", "Numbers": "547", "Date": "June 28, 2015"}, {"Content": "It has become a mess When I originally downloaded the HuffPost for my Android Galaxy phone, it was one of the better designed news apps I had come across. Recently after updates and changes in design, it has become a buggy mess that crashes more often than it works.", "Numbers": "548", "Date": "August 7, 2014"}, {"Content": "App crashes Clicking on certain articles consistently causes the app to fail back to its home screen. Sometimes the app crashses completely. Does not generate an error report. This started after a recent update.", "Numbers": "549", "Date": "August 12, 2014"}, {"Content": "Keeps crashing Only certain stories work. POS imo", "Numbers": "550", "Date": "August 8, 2014"}, {"Content": "Works again UPDATE: Huffpo works again. It is sometimes very slow, until the ad proxy crashes, then it works fine. The page flipping thing doesn't happen for me anymore.", "Numbers": "551", "Date": "November 23, 2014"}, {"Content": "Crashes CONSTANTLY Crashes when opening. Crashes when access notifications. Crashes when you press the back button. About the only time it doesn't crash is when you submit an error report after the previous time it crashed.", "Numbers": "552", "Date": "July 1, 2014"}, {"Content": "After a recent update it now crashes all the time.. It used to be good", "Numbers": "553", "Date": "August 9, 2014"}, {"Content": "Suddenly got crap Keeps crashing, loads of adverts on video, munched my data allowance on unpausable video ads", "Numbers": "554", "Date": "August 4, 2015"}, {"Content": "Don't know why keep to crashing and I need to force close.", "Numbers": "555", "Date": "May 9, 2015"}, {"Content": "used to work great This app used to work great until the last update now it all it does is crash", "Numbers": "556", "Date": "August 14, 2014"}, {"Content": "Buggy Crashes a lot on my casio.", "Numbers": "557", "Date": "August 7, 2014"}, {"Content": "Used to be great. 80% of the articles won't open and cause the app to crash. Really hope they fix this soon.", "Numbers": "558", "Date": "August 13, 2014"}, {"Content": "Crashes a lot", "Numbers": "559", "Date": "June 22, 2014"}, {"Content": "Almost perfect Love the app and am happy with the frequent updates. Another plus is thay the app never crashes. The only problem I have is that the refinery29 articles NEVER open up. It's a totally blank screen. Stop running their articles or fix it please becasue no other links act up.", "Numbers": "560", "Date": "May 15, 2014"}, {"Content": "Slow, buggy Huffpo\nI like having the Huffington Post on my phone. I really do. However, the app is huge, slow, and bloated. It uses system resources like no other, and it crashes regularly. Many videos don't ruin on my older phone. Maybe it's fine if you own the top of the line. If you own a regular phone, though, you're SOL.", "Numbers": "561", "Date": "April 29, 2014"}, {"Content": "Disappointing :( App crashes on startup every single time. Can't get it to open at all. Never had issues before the latest update. Please fix...", "Numbers": "562", "Date": "April 29, 2014"}, {"Content": "Excellent app until recently. It now causes the system to crash. The app looks like a strobe light, then locks up. I've removed it from the tablet.", "Numbers": "563", "Date": "May 6, 2014"}, {"Content": "Fine until my last upgrade! I'm using the S3 and overall I enjoy the app. That was until a recent upgrade somehow effected the system and it began to crash. Currently redownloading the app.", "Numbers": "564", "Date": "April 30, 2014"}, {"Content": "Messed up Content does not display, frequent crashes, a 5 star app is now a generous 2 star app. It has become quite frustrating.", "Numbers": "565", "Date": "May 15, 2014"}, {"Content": "Keeps crashing The title says it all. I had it installed, was great but kept crashing. I uninstall, wait a few weeks, reinstall... Still crashing. Fix the glitches!!", "Numbers": "566", "Date": "May 19, 2014"}, {"Content": "Great but... Crashed after installing but I will try downloading again. I love the online version so won't give up without a fight.", "Numbers": "567", "Date": "May 8, 2014"}, {"Content": "Crashed on the start I cleared cache and data. I uninstalled. Snd then reinstalled the software and it still crashes on a galaxy note 2.", "Numbers": "568", "Date": "April 29, 2014"}, {"Content": "It worked fine until the most recent update. Now it crashes, so I'm redownloading it.", "Numbers": "569", "Date": "May 5, 2014"}, {"Content": "Keeps Crashing Like the app but refuses to open on my Nexus 7. And despite the recent update (4/28) it continues to crash.", "Numbers": "570", "Date": "April 30, 2014"}, {"Content": "Crashes It crashes every time I open it.", "Numbers": "571", "Date": "May 9, 2014"}, {"Content": "I use to be able to get the Huff post on here now it just wont load at all it just crashes at start up. I have a galaxy2 10.1. I miss it", "Numbers": "572", "Date": "May 5, 2014"}, {"Content": "Unusable Doesn't open, crashes immediately.", "Numbers": "573", "Date": "May 2, 2014"}, {"Content": "Crash crash crash... uninstall.", "Numbers": "574", "Date": "May 8, 2014"}, {"Content": "Today app started crashing every single time I try to use it....every time. Before today, April 27, it worked fine.", "Numbers": "575", "Date": "April 29, 2014"}, {"Content": "Update makes it crash Hasn't worked at all since the update.", "Numbers": "576", "Date": "April 29, 2014"}, {"Content": "Crashes on my galaxy s3 mini", "Numbers": "577", "Date": "April 29, 2014"}, {"Content": "Keeps crashing on my Note 3 Crashes when I launch the app.", "Numbers": "578", "Date": "April 27, 2014"}, {"Content": "I like app layout and news site.. But application keeps crashing..", "Numbers": "579", "Date": "April 27, 2014"}, {"Content": "Constantly crashes or won't open.... The content is what I expect, if I can get to it.", "Numbers": "580", "Date": "April 2, 2014"}, {"Content": "Love it! This app is really awesome for when I want to read the news but I'm not around my PC. It never crashes or anything and I've never had a problem using it. The only bad thing is it takes up a little more space than I'd like it to. But other than that 5 stars.", "Numbers": "581", "Date": "February 14, 2014"}, {"Content": "Installs but crashes on open. Installed and uninstalled twice. Keep selecting force close and report. Android 10.1 Galaxy Tab. Sorry to report. Works well on my android smart phone.", "Numbers": "582", "Date": "February 21, 2014"}, {"Content": "Great content but unstable Just have a lot of crashes, and doesn't always load story", "Numbers": "583", "Date": "January 30, 2014"}, {"Content": "Great content, but the app is SO SAD\nI love the content but... the app fails to render content consistently and works as if you were surfing the web back in 1990s. Videos rarely load. Links don't work 50% of the time. Slideshows rarely work, and if they do, the app often crashes or locks. You end up having to open up each article in another browser. This app is so sad.", "Numbers": "584", "Date": "January 3, 2014"}, {"Content": "bad update? Since latest update, app no longer loads past the opening title screen and immediately crashes. worked wonderfully before update. Update: recent fix has improved functionality and can even play videos again. thank you.", "Numbers": "585", "Date": "January 28, 2014"}, {"Content": "Updated but can no longer take all of these glitches. Uninstalling now. Like the news. Crashes constantly.", "Numbers": "586", "Date": "January 22, 2014"}, {"Content": "Keeps crashing! Used to love the app but now it just crashes constantly.", "Numbers": "587", "Date": "September 29, 2014"}, {"Content": "Crashes on JB Please fix!", "Numbers": "588", "Date": "December 20, 2013"}, {"Content": "Crashes constantly Every time I use this app ir freezes and crashes. It sucks.", "Numbers": "589", "Date": "November 27, 2013"}, {"Content": "Crashes every time I try to start the app.", "Numbers": "590", "Date": "November 18, 2013"}, {"Content": "Crashes, a lot Old versions worked fine, now most stories will not open.", "Numbers": "591", "Date": "November 26, 2013"}, {"Content": "No longer working This app when it did work was pretty decent. Good content. Now for some reason it constantly crashes. Nothing has changed on my phone.", "Numbers": "592", "Date": "October 20, 2013"}, {"Content": "Broken Was a great app until the update. Crashes on sgs4 and new nexus 7. I'll update review when fixed.", "Numbers": "593", "Date": "October 19, 2013"}, {"Content": "Crashes. Force closes on the nexus 7, was this bug tested at all before release?", "Numbers": "594", "Date": "October 19, 2013"}, {"Content": "Yay Finally the update fixed the crashes! Thank you!", "Numbers": "595", "Date": "October 19, 2013"}, {"Content": "Huffpo Crashes constantly", "Numbers": "596", "Date": "October 25, 2013"}, {"Content": "ehh crashes a lot", "Numbers": "597", "Date": "November 2, 2013"}, {"Content": "Constant poor updatrs One update takes all the pages, gets fixed, next update causes app to crash every time it's opened. Do you even bother testing? When it does work it has some good stuff, mixed in with the bad.", "Numbers": "598", "Date": "October 18, 2013"}, {"Content": "Crashes Latest version crashes on opening. Was it not tested before being released? Nexus 7 2013", "Numbers": "599", "Date": "October 12, 2013"}, {"Content": "Crashes Since being updated it now won't open - please fix. Sony Xperia V", "Numbers": "600", "Date": "October 11, 2013"}, {"Content": "New upgrade - Galaxy S2 App crashes when opened, this is the 2nd bad update. Uninstalling this time", "Numbers": "601", "Date": "October 16, 2013"}, {"Content": "Works fine for me No crashes yet, but I can't sign in with google + like on the real website? What's up with that? HTC Rezound", "Numbers": "602", "Date": "October 17, 2013"}, {"Content": "Always crashes. Goes to white screen. Wish it worked like before. Used to be great", "Numbers": "603", "Date": "October 17, 2013"}, {"Content": "Awful No longer works on Nexus 7. It switched to UK version. US version won't install. The web version constantly crashes on the tablet.", "Numbers": "604", "Date": "October 14, 2013"}, {"Content": "Good news app. Those that are getting the app crashing on startup. Just clear the app data.", "Numbers": "605", "Date": "October 11, 2013"}, {"Content": "Used to work Now keeps crashing to extent can't be opened. Experia U.", "Numbers": "606", "Date": "October 14, 2013"}, {"Content": "Crashes Packs up on opening. Won't even start up..rubbish!", "Numbers": "607", "Date": "October 13, 2013"}, {"Content": "Poor Crashes when I try opening..fix.", "Numbers": "608", "Date": "October 13, 2013"}, {"Content": "Simply stopped working App won't open, just crashes continually", "Numbers": "609", "Date": "October 11, 2013"}, {"Content": "Broken Latest update crashes on opening. Useless and uninstalled.", "Numbers": "610", "Date": "October 12, 2013"}, {"Content": "Constant crashes, unusable", "Numbers": "611", "Date": "October 17, 2013"}, {"Content": "Won't open since update Crashes before it opens since latest update on Galaxy Note 2", "Numbers": "612", "Date": "October 12, 2013"}, {"Content": "Was great Until tonight. First the announcement that anonymity was going away. Now the app keeps crashing!! Edit: un/re installed twice. Stopped crashing. No clue why but happy! Fix the comment format and profile access for mobile users and you'd have a fantastic app again!", "Numbers": "613", "Date": "August 27, 2013"}, {"Content": "The ads cause white screen and constant crashing.", "Numbers": "614", "Date": "September 11, 2013"}, {"Content": "Terrible Crashes all the time.", "Numbers": "615", "Date": "August 28, 2013"}, {"Content": "Crashes everytime I use it.", "Numbers": "616", "Date": "September 9, 2013"}, {"Content": "Love the website, but the ap crashes Need to reinstall all the time. ..", "Numbers": "617", "Date": "September 2, 2013"}, {"Content": "Crashes every time now I have android 2.2.1 . No longer works. Please roll back to earlier version. Tried reinstalling. No joy", "Numbers": "618", "Date": "August 20, 2013"}, {"Content": "Fail App crashes all the time with new update. do not install", "Numbers": "619", "Date": "August 16, 2013"}, {"Content": "Like site hate app Were to begin. It crashes s lot, hogs space, can't be moved to ed card, forgets my login I'd, too many off site articles and movies.. Im thinking of uninstalling..", "Numbers": "620", "Date": "January 1, 2014"}, {"Content": "Earns a 3star report App crashes videos dont load comments load slowley half the time wont even post..", "Numbers": "621", "Date": "December 28, 2013"}, {"Content": "Keeps crashing and can't see pictures I don't know what they did with their last update, but huffpo is now worse. App keeps crashing and almost all images give the message about not being formatted for my device. When I try to view a slides how, I can't see any images at all. Fix ASAP!", "Numbers": "622", "Date": "August 9, 2013"}, {"Content": "Too frustrating App crashes when you view slide shows and on a tablet you cant exit the slide show.", "Numbers": "623", "Date": "August 12, 2013"}, {"Content": "Crashes too much Great app until it started crashing and stopped loading all together.and the slideshows wont show all pics, most times it wont even load at all... :-(", "Numbers": "624", "Date": "August 15, 2013"}, {"Content": "Crashes on Nexus 7", "Numbers": "625", "Date": "August 8, 2013"}, {"Content": "Great news app Great app, flexible styles and doesn't crash!", "Numbers": "626", "Date": "August 13, 2013"}, {"Content": "Latest update crashed it Using app on Galaxy Tab for months, no problem. Update in mid-July killed it completely. White screen, crash, force close.", "Numbers": "627", "Date": "July 18, 2013"}, {"Content": "If it ain't broke... App worked fine before the latest update. Now it crashes constantly on Galaxy S2", "Numbers": "628", "Date": "July 18, 2013"}, {"Content": "Crashes whenever I attempt to submit a comment What a piece... don't release an app if the basic features fail...", "Numbers": "629", "Date": "May 30, 2013"}, {"Content": "Keeps crashing I can't log in. Had to uninstall", "Numbers": "630", "Date": "May 15, 2013"}, {"Content": "Good layout, but crashes Latest update improved the look and feel of the app, but it also crashes my phone. Their website update has same bugs", "Numbers": "631", "Date": "June 19, 2013"}, {"Content": "Awful It was a 5* app back in the day, but it constantly crashes and gives the \"uh oh...something went wrong\". Uninstalled for good", "Numbers": "632", "Date": "May 8, 2013"}, {"Content": "BMC Many crashes and now the app no longer works. Good bye to my most read app. Please fix this update problem", "Numbers": "633", "Date": "May 16, 2013"}, {"Content": "Some good content, lots of issues\nMixed bag of good news and total trash. Too many articles on Kim K and other useless celebrities (I can get that from TMZ), but still a good source for news. Lots of errors/crashes over the last year with multiple versions. Resolved the \"oops\" error that started yesterday by clearing the cache for the app. HP needs to step it up on the quality of this product.", "Numbers": "634", "Date": "May 8, 2013"}, {"Content": "Never should of updated Ever since the new format the app crashes, won't load photos, and error messages all day", "Numbers": "635", "Date": "May 8, 2013"}, {"Content": "update ruined this great app widgets no longer work, and the main app crashes to a blank screen constantly.", "Numbers": "636", "Date": "May 24, 2013"}, {"Content": "Please fix! Since most recent update, constantly crashes. And sooooo many videos don't play.", "Numbers": "637", "Date": "May 9, 2013"}, {"Content": "Crash city gs3 Love the ap but it constantly crashes/freezes. Also video amd pictures rarely load. Possible fix in update?!?", "Numbers": "638", "Date": "August 10, 2013"}, {"Content": "Fix the problem, please Every time I open the bookmark, the app crashes.", "Numbers": "639", "Date": "May 15, 2013"}, {"Content": "Update crash! Ever since the update it won't even open.", "Numbers": "640", "Date": "May 12, 2013"}, {"Content": "New version=bad Never works. Crashes all the time. Would rather see more content and less images (faster loading times). Fix it please.", "Numbers": "641", "Date": "May 6, 2013"}, {"Content": "Uh-oh something went wrong I accidently updated it when I forgot there were bad reviews about the app crashing and it says uh-oh something went wrong. Don't update!", "Numbers": "642", "Date": "May 8, 2013"}, {"Content": "Keeps crashing Works fine for a couple of weeks then crashes every time till I reinstall.", "Numbers": "643", "Date": "April 25, 2013"}, {"Content": "Keeps crashing I have a Samsung galaxy note 2 and this app works after re-installtion for a few days and then crashes and I have to un-install it and re-install it again! Frustrating! I didn't have any issues with huffpost app on my old iPhone though!", "Numbers": "644", "Date": "March 24, 2013"}, {"Content": "Excellent! New update is excellent. The new update exceeds expectations and the version hasn't crashed after over a few days of use. Last version was unusable. The new interface is sleek, minimal and a joy to use. By far the best news app for Android.", "Numbers": "645", "Date": "March 21, 2013"}, {"Content": "Vastly Improved, But...\nThe initial revamp in March ran smooth on my S3, since the most current update ran, it's been crashing. Other than that... Without the option to sign in under Yahoo, being able to comment and interact is unavailable to me. As well, it is missing a link to HuffPost Live. All of this is solved by utilizing my device's browser, but then, that defeats the point of the convenience of the app!", "Numbers": "646", "Date": "March 15, 2013"}, {"Content": "Horrid update.. please do better.. I loved the Huff app until this new update. I have an HTC EVO and it crashes nearly every time I try to use it.", "Numbers": "647", "Date": "March 30, 2013"}, {"Content": "Awful after update!!! Please bring back the old version!!!! Keeps crashing and I have to force close!!! Why u guys mess with a good thing?! It was fine before!!!", "Numbers": "648", "Date": "March 28, 2013"}, {"Content": "App is a joke Only half of pics load. Vids won't play on 2.0. App gets laggy after too much use. Sometimes crashes. Front page articles are a joke, half are about celebreties, WHO CARES!?", "Numbers": "649", "Date": "June 20, 2013"}, {"Content": "Great update ! The app looks great, easy to read, play videos and it does not crash. I like the slick interface and big news photos. Well done Huffington Post!", "Numbers": "650", "Date": "March 26, 2013"}, {"Content": "Used to be my fav news app Now it crashes within a few moments. I'm sticking with Google currents from here on out.", "Numbers": "651", "Date": "April 12, 2013"}, {"Content": "This app sucks! This app sucks! It keeps crashing. POS!", "Numbers": "652", "Date": "March 26, 2013"}, {"Content": "Could be better Crashes continuously and could have more options and functions.", "Numbers": "653", "Date": "March 30, 2013"}, {"Content": "Update looks dumb & crashes", "Numbers": "654", "Date": "July 14, 2013"}, {"Content": "New update The new update seems really cool but I'm unable to read any of the articles.. it takes so much time for them to load and its not the internet that's working slow. I am unable to sign in using Twitter and when I try to sign in with Facebook the app crashes. Very dissapointing.", "Numbers": "655", "Date": "March 8, 2013"}, {"Content": "Update is a total disaster Thus was one of my favorite news sources until this update. If you want news and not sensationalism this is no longer the place to get it. Guess selling to AOL was not such a good idea. Images too big and it crashes as you open it. Goodbye Huff post it was fun while it lasted.", "Numbers": "656", "Date": "March 11, 2013"}, {"Content": "Force closes and crashes my phone The previous version started to cause my phone to crash. So I thought the update would fix that but now it won't even start up and force close every time. I guess I'm going to have to uninstall it. That's a shame because I love the huff post.", "Numbers": "657", "Date": "March 7, 2013"}, {"Content": "This is why I hate updates. What a crappy update. App hasn't worked in days, only getting a repetitive message about \"crash data\". Huffpost-- Quit ignoring all of this negative feedback and fix it already!", "Numbers": "658", "Date": "March 11, 2013"}, {"Content": "Why change? The previous app worked great. Crash crash crash! The update is horrible.", "Numbers": "659", "Date": "March 7, 2013"}, {"Content": "Crashes all the time For the last few months I have had major challenges accessing my Huffington Post app. I have had to uninstall and reinstall many times and my last 5 attempts have been entirely unsuccessful - I am ready to give up.", "Numbers": "660", "Date": "March 9, 2013"}, {"Content": "Worse than a beta version CPU use at 45% on a Galaxy S2. Crashes all the time. Doesn't load all pages. This app is getting worse with every version. Dropping my rating from 2 to 1 Star.", "Numbers": "661", "Date": "March 7, 2013"}, {"Content": "Uggghhh I really miss the old version now. All I get is a blank white page and a message whether or not I want to inform the developer about the crash. I have a Google nexus. Uninstalling and re-installing helped.", "Numbers": "662", "Date": "March 8, 2013"}, {"Content": "Terrible Every time I try to launch the app now it just crashes my phone", "Numbers": "663", "Date": "March 7, 2013"}, {"Content": "Used to work great - now crashes all the time After the last update, the program crashes with nearly every use. Please fix.", "Numbers": "664", "Date": "March 10, 2013"}, {"Content": "Sucks Only worked one time. Now it just crashes every time I try to open it. Nexus 7.", "Numbers": "665", "Date": "March 13, 2013"}, {"Content": "App wont work This uses to be the best app out there. Now you cannot even see the headlines. It crashes constantly and keeps getting worse with more and more errors. I have re installed it multiple times with no improvement. The tech team seems clueless.", "Numbers": "666", "Date": "February 20, 2013"}, {"Content": "Crash Crash Crash into a ditch\nI am a huge fan of this app. However, since I upgraded to the new version it crashes consistently, won't load photos or articles. Again I want to reiterate I absolutely love this app. Please fix it or revert back to the previous verson until all of the bugs are worked out. Thank you! Samsung Galaxy S3", "Numbers": "667", "Date": "December 25, 2012"}, {"Content": "Broken For Days Now I don't get it. No updates recently, yet both the Android and Apple apps just crash over and over. I used to read dozens of articles daily. Now I'm debating uninstalling. FIX THIS ALREADY!!!", "Numbers": "668", "Date": "February 20, 2013"}, {"Content": "Not worth the frustration ! Used to love this app however, lately it hasn't been preforming well at all. Videos will not play, articles do not load, and app crashes regularly. The time has come to uninstall and find a new news source for my mobile phone.", "Numbers": "669", "Date": "March 6, 2013"}, {"Content": "Disappointed Very buggy, crashes a lot, and some of the content doesn't show up (slideshows don't load at all.) I thought it would be better on android than it is on iphone but it's worse.", "Numbers": "670", "Date": "January 1, 2013"}, {"Content": "What Happened???? This app used to bee my most used app.... Now the pictures don't load and it constantly crashes.... Can you all please fix this or at least tell us what is going on.. I am un-installing until I hear it is doing better.", "Numbers": "671", "Date": "January 29, 2013"}, {"Content": "Crashes Keeps going blank like everyone else. Its my go-to-rage news app. At the moment its not working very well. 4 stars when it does work.", "Numbers": "672", "Date": "February 20, 2013"}, {"Content": "Always crashes I've tried using this app many times and it crashes after about 5 articles every single time. Too bad since I love the Site.", "Numbers": "673", "Date": "January 6, 2013"}, {"Content": "Going downhill Crashes a lot lately, taking my whole phone down with it. I reinstalled and now the stories appear for a second then disappear. How about we roll back a version or two?", "Numbers": "674", "Date": "February 20, 2013"}, {"Content": "Goes blank for me too This was the last thing that worked for me to read HuffPo. Their webpage is insufferable on a mobile device and their tablet app crashes constantly. Now the phone app goes blank right after opening. Uninstalling and giving up on HuffPo altogether.", "Numbers": "675", "Date": "February 20, 2013"}, {"Content": "Used to be great With recent updates now hangs or crashes all the time with my SS3. Piece of crap! Avoid!", "Numbers": "676", "Date": "January 24, 2013"}, {"Content": "Keeps crashing And also takes forever to load need to find New news app", "Numbers": "677", "Date": "February 6, 2013"}, {"Content": "Crash fest Crashes often... sometimes the articles won't load. Really disappointed with the technology.", "Numbers": "678", "Date": "February 20, 2013"}, {"Content": "Almost unusable So buggy with frequent crashes it's nearly unusable", "Numbers": "679", "Date": "January 28, 2013"}, {"Content": "Crashes all the time It used to be a pretty good app but now all it does is crash every time I try to use it!", "Numbers": "680", "Date": "January 29, 2013"}, {"Content": "Wtf? Can't read articles.... Crashes all the time :(", "Numbers": "681", "Date": "January 24, 2013"}, {"Content": "Incredibly buggy Works terrible with Samsung GS3, frequent crashing, failure to load, etc. Content pretty good, wish I could see more", "Numbers": "682", "Date": "February 20, 2013"}, {"Content": "Uhhhh Constantly crashes to white screen", "Numbers": "683", "Date": "February 20, 2013"}, {"Content": "Crashes!!! I open it and it crashes. Please fix.", "Numbers": "684", "Date": "February 20, 2013"}, {"Content": "Arghhh. please fix. Crashes and poor loading.", "Numbers": "685", "Date": "February 5, 2013"}, {"Content": "! Garbage, constant crash.", "Numbers": "686", "Date": "February 20, 2013"}, {"Content": "Keeps crashing Fix it!", "Numbers": "687", "Date": "February 20, 2013"}, {"Content": "Not quite right. Crashes after \" back \" button used to return to main threads. And slideshows often open without content/photos and/or crashes. Fix issues and I will give five (5) plus stars. Huffpost is great for my generation (X) and all others.", "Numbers": "688", "Date": "December 1, 2012"}, {"Content": "This stupid app keeps crashing Fixx it", "Numbers": "689", "Date": "December 18, 2012"}, {"Content": "Needs work Excellent news but the program keeps crashing.", "Numbers": "690", "Date": "November 27, 2012"}, {"Content": "Doesn't work anymore Crashes every time I use it, slow to load when it is working. Droid Razr", "Numbers": "691", "Date": "October 12, 2012"}, {"Content": "C'Mon! I religiously read this app but the constant crashing is getting annoying! What gives?", "Numbers": "692", "Date": "October 17, 2012"}, {"Content": "Terrible. Crashes all the time, articles won't load, generally just not a functional app.", "Numbers": "693", "Date": "October 27, 2012"}, {"Content": "Crashes Constantly It would be a great app if it wad always closing \"unexpectedly.\"", "Numbers": "694", "Date": "November 4, 2012"}, {"Content": "Ok Was pretty good, but the widget keeps crashing/force closing now", "Numbers": "695", "Date": "October 1, 2012"}, {"Content": "Seems nice but crashes everytime I try to exit application Using a galaxy s2", "Numbers": "696", "Date": "September 27, 2012"}, {"Content": "always crashes since my s2 update to ice cream it crashes 7-10 times on start up. massively annoying. great content the and or if it works.", "Numbers": "697", "Date": "September 15, 2012"}, {"Content": "Huff Post Used to be my favorite app. Now it crashes 90% of the time, it's become useless. Please fix. Galaxy sIII", "Numbers": "698", "Date": "November 13, 2012"}, {"Content": "Fix please Would get a 5 star rating if it didn't crash every time I go on, which is several times a day! Please fix the constant crashing!", "Numbers": "699", "Date": "September 4, 2012"}, {"Content": "Force Close! This would be a great app if it was reliable. It crashes regularly and a force close is needed. Very disappointing.", "Numbers": "700", "Date": "July 30, 2012"}, {"Content": "Love this news app Just uninstalled CNN, ABC and CBS...wasn't impressed...two of them I couldn't post stories to Facebook one just crashed a lot. So far I'm really liking this Huffington Post news app.", "Numbers": "701", "Date": "September 15, 2012"}, {"Content": "Crashes all the time One of my favorite apps. Now I can barely use it. Bummer", "Numbers": "702", "Date": "September 25, 2012"}, {"Content": "Fix it Used to be my go to for news, but now ot just crashes i cant even open an article bc it just goes blank.", "Numbers": "703", "Date": "February 20, 2013"}, {"Content": "love it...but not today i use this app daily...but it is crashing and only showing a blank white screen. fix it asap...", "Numbers": "704", "Date": "August 5, 2012"}, {"Content": "Crashes on Nexus 7 Never got to use it at it crashed every time I tried to use it.", "Numbers": "705", "Date": "July 20, 2012"}, {"Content": "Keeps crashing on Nexus 7 Can't read anything crashes as soon as you click an article. FIX PLEASE", "Numbers": "706", "Date": "July 20, 2012"}, {"Content": "Crash crash crash Absolutely useless. On nexus 7.", "Numbers": "707", "Date": "July 21, 2012"}, {"Content": "Another Big improvement latest update is great. Less crashes. It saves my favourites no problem still and I'm glad the widgets are sorted. widget opening in the app would be better alright, but the app is getting more solid with each update.", "Numbers": "708", "Date": "June 8, 2012"}, {"Content": "Used to be good Constantly resets my favorites, doesn't maintain scroll position anymore. Crashes more often, too. Getting buggier and buggier with each update.", "Numbers": "709", "Date": "June 9, 2012"}, {"Content": "Useless This app has become useless. When it's not crashing, it's resetting my settings. Really disappointing. Scrap this failed project and start all over. Maybe that will be more useful.", "Numbers": "710", "Date": "May 17, 2012"}, {"Content": "Latest Update Samsung GTab does not like the new update. I can no longer open Aticles when offline. App is crashing with every use!!", "Numbers": "711", "Date": "May 18, 2012"}, {"Content": "Latest updates crash app every time it opens. Put it back to the way it was", "Numbers": "712", "Date": "May 29, 2012"}, {"Content": "Constant and predictable crashes When scrolling through articles, the app will freeze and crash about half way down. If you wait, the app will recover, but it's annoying and doesn't allow for smooth reading. Slideshows and videos also don't work. Previous version was better, at least the articles didn't freeze the app.", "Numbers": "713", "Date": "March 23, 2012"}, {"Content": "One Star Crashing Trash!\nGlad I'm not the only one that app constantly crashes on. Get it fixed! Should be 5 stars but since I can't even finish an article or browse headlines without crashing literally every minute or so, it's 1. Read this and everyone else's similar issue and fix it Huffpost. I'm tired of constantly having to Force Close or choose Wait to get the program back to running. One of the worst apps I've used. I'll have to keep using CNN since I can't finish even a single article.", "Numbers": "714", "Date": "April 22, 2012"}, {"Content": "Glitchy, always crashing and freezing on android. The videos never work, and the captions on the slideshows always get out of sync w the pictures.", "Numbers": "715", "Date": "May 16, 2012"}, {"Content": "Good content poor app Slideshows don't work and frequently crashes. Like the content though", "Numbers": "716", "Date": "April 18, 2012"}, {"Content": "App crashes constantly. Won't let me post to FB, keeps crashing. Please fix.", "Numbers": "717", "Date": "March 1, 2012"}, {"Content": "This app sucks It crashes my phone constantly and the slideshows virtually never work.", "Numbers": "718", "Date": "February 29, 2012"}, {"Content": "I should have never updated. Crash crash crash crash crash force close force close. Crap.", "Numbers": "719", "Date": "January 18, 2012"}, {"Content": "This was an awesome app before the slideshow crash. How about, until they're fixed, don't post articles totally reliant on slideshows!?", "Numbers": "720", "Date": "January 2, 2012"}, {"Content": "Slideshows & most video links cause app to crash on droid eris. Not quite fixed.", "Numbers": "721", "Date": "March 13, 2012"}, {"Content": "Useful but stalls and then crashes phone If I didn't have Advanced Task Killer on my G2x I would have removed this app long ago. Gets stuck in a loop and wont load, or just shows The White Screen of Death [WSOD]. Really needs fixing...", "Numbers": "722", "Date": "December 23, 2011"}, {"Content": "Application freezes and crashes when attempting to open articles. HTC Aria. Thank you for allowing users to disable the finger swipe feature.", "Numbers": "723", "Date": "January 2, 2012"}, {"Content": "Used to be better. Crashes constantly, most slideshows and videos don't work. Getting worse and worse. Glad I keep the old ones backed up.", "Numbers": "724", "Date": "May 9, 2012"}, {"Content": "CRASH New version installed on 9/15. Crashed my Moto Photon on first use. Never had problems with older builds.", "Numbers": "725", "Date": "September 16, 2011"}, {"Content": "App crashes, won't load This app is unreliable on my G2. Crashes, or won't load, stalls badly when certain ads come up. Too bad, layout is better than the website.", "Numbers": "726", "Date": "December 8, 2011"}, {"Content": "Buggy, slow, images in galleries don't load, or maybe 2 of 5 pics will load. Freezes/crashes regularly. This app needs major work, but gets ignored.", "Numbers": "727", "Date": "August 5, 2011"}, {"Content": "keeps crashing, and force closing. Used to be good, but gets worse with each update. Also automatically downloads files displayed through ads.CRAP", "Numbers": "728", "Date": "July 5, 2011"}, {"Content": "Crashes non stop on my Droid incredible. I have tried month after month this app is Garbage. Love the site hate the app.", "Numbers": "729", "Date": "July 2, 2011"}, {"Content": "Endless crashes in newer versions.", "Numbers": "730", "Date": "June 18, 2011"}, {"Content": "It appears everyone, not just me, experiences constant freezes, crashes and lags. Glad it is not my phone's fault, sad to uninstall.", "Numbers": "731", "Date": "May 7, 2011"}, {"Content": "Good content. But buggy and crashy and unstable app. Ad strip annoying. Would pay $ if ad free and stable. HTC Incred.", "Numbers": "732", "Date": "May 6, 2011"}, {"Content": "Used to be so good. Now it crashes everytime i open it on my G2...sssuuuuccckkksss!", "Numbers": "733", "Date": "June 2, 2011"}, {"Content": "Love the stories. Love the politics. Hate the app. It runs slowly or crashes on open all the time on my DROID X.", "Numbers": "734", "Date": "June 8, 2011"}, {"Content": "Crashes a lot ever since they added the ads at the bottom of the screen. C'mon guys AOL is backing you now. Fix it!", "Numbers": "735", "Date": "April 24, 2011"}, {"Content": "Hate this app, uninstalling, which is a shame. Every single time I use it, it lags and inevitably crashes my phone- Samsung Mesmerize.", "Numbers": "736", "Date": "April 18, 2011"}, {"Content": "This app hard crashes my HTC incredible almost every time I run it. You'd think a reputable company like huffpo would have a decent app. But, nope.", "Numbers": "737", "Date": "May 12, 2011"}, {"Content": "Crashed after launch. Droid 1 with 2.2", "Numbers": "738", "Date": "June 1, 2011"}, {"Content": "Better Update from last bad review. Got a razor and it works without crashing.", "Numbers": "739", "Date": "November 11, 2012"}, {"Content": "I love HuffPo, but the thing crashes too often. How 'bout some bloggers' posts as well?", "Numbers": "740", "Date": "May 7, 2011"}, {"Content": "crashes about once per session", "Numbers": "741", "Date": "May 26, 2011"}, {"Content": "Great content but crashes alot. Used to be better...", "Numbers": "742", "Date": "May 16, 2011"}, {"Content": "Constantly crashes my atrix...", "Numbers": "743", "Date": "June 4, 2011"}, {"Content": "Crashington Post", "Numbers": "744", "Date": "May 7, 2011"}, {"Content": "Last update crashed. Nothing but bank screen. Uninstalled and reinstalled and still a blank page.", "Numbers": "745", "Date": "April 11, 2011"}, {"Content": "Crashes Droid 2 Last update seems to have been developed entirely by a disgruntled employee -- loads slowly and routinely freezes the app and entire phone. Pulling the battery has been the only way to restart Droid 2. Time to uninstall. Goodbye HuffPo, Hello BBC.", "Numbers": "746", "Date": "June 16, 2011"}, {"Content": "Was good before the update. Now it crashes all the time. Samsung galaxy. Fix please. Did aol ruin my app?", "Numbers": "747", "Date": "February 25, 2011"}, {"Content": "Not bad. Haven't seen any of the crashes, and the ads don't bother me. Would be better if the headlines didn't get cut off though. Sprint Hero 2.1", "Numbers": "748", "Date": "February 28, 2011"}, {"Content": "crashes constantly. scrolling down has to be done very gingerly because any left-right movement takes you to the next story, which is infuriating", "Numbers": "749", "Date": "March 30, 2011"}, {"Content": "Don't like the ads and the app has frozen and crashed twice in the past few days.", "Numbers": "750", "Date": "February 20, 2011"}, {"Content": "Crashes way too often.", "Numbers": "751", "Date": "February 21, 2011"}, {"Content": "I'd give more stars, but app crashes a lot. Pls fix, huffpost!", "Numbers": "752", "Date": "February 5, 2011"}, {"Content": "Crashes and forces closed EVERY time. Slideshows don't load and crash regardless. My fave app but I can't take it anymore...uninstalling.", "Numbers": "753", "Date": "January 27, 2011"}, {"Content": "Good app but it keeps crashing on Droid Eris. Photos don't load fully either. Needs work", "Numbers": "754", "Date": "November 7, 2010"}, {"Content": "Love it when it works. Crashes multiple times a day.", "Numbers": "755", "Date": "December 2, 2010"}, {"Content": "Crashes frequently. Fix it!", "Numbers": "756", "Date": "November 24, 2010"}, {"Content": "Crashed all the time. -evo", "Numbers": "757", "Date": "December 10, 2010"}, {"Content": "Crashes and freezes too much", "Numbers": "758", "Date": "December 9, 2010"}, {"Content": "Love the content but crashes constantly... Seriously, the most unstable AP I have.", "Numbers": "759", "Date": "September 7, 2010"}, {"Content": "Crashes far too often. Freezes on loading screen. Very rarely opens to homepage. Widget is useless - never loads. Extremely unstable app. Moto Droid.", "Numbers": "760", "Date": "September 20, 2010"}, {"Content": "Crashes on my Droid", "Numbers": "761", "Date": "September 1, 2010"}, {"Content": "This is absurd: the application still crashes, and at times, the widget doesn't load properly. Will the problems ever get resolved?", "Numbers": "762", "Date": "November 30, 2010"}, {"Content": "Crashes nexus one pls pls pls fix", "Numbers": "763", "Date": "August 3, 2010"}, {"Content": "Great app, but overly sensitive when it comes to switchin stories. Also it crashes or hangs frequently.", "Numbers": "764", "Date": "May 21, 2010"}, {"Content": "Content is good, but it crashes all the time.", "Numbers": "765", "Date": "June 11, 2010"}, {"Content": "After last update it keeps crashing and freezing my phone so I need to restart it every time I'm trying to run the prog", "Numbers": "766", "Date": "April 12, 2010"}, {"Content": "Doh, last update crashes while fetching comments and some stories. My phone is a nexus one.", "Numbers": "767", "Date": "April 1, 2010"}, {"Content": "Mistake I foolishly left my auto-update feature on. The app no longer works on my phone - crashes instantly. From the layout I see in the preview, even if it does work, it seems inferior to the previous version.", "Numbers": "768", "Date": "March 7, 2013"}, {"Content": "Crash prone and won't install to sd. Regular Huffpo reader thought this would be good to have. I've got better uses for my internal device memory than a pos like this that doesn't even honor my \"install on sd card by default\" setting!", "Numbers": "769", "Date": "July 19, 2012"}, {"Content": "A junk app Frequently logs you out. Confusing to navigate. Crashes when trying to post a comment. If you are happy just reading whatever the top story is, you might like it. Searching for a subject or article, or trying to join discussions is not worth the frustration.", "Numbers": "770", "Date": "November 17, 2013"}, {"Content": "The app seems to have been causing my phone to crash about once a day. Since uninstalling it I don't have any issues. Full of heavy ad tech, unnecessarily confusing UI. Clickbait headlines make it hard to navigate. I like this news org but can't even with the application.", "Numbers": "771", "Date": "February 28, 2017"}, {"Content": "After reinstall it seemed to work but again crashes constantly. UINSTALLED It has become very buggy and freezes constantly for me and others as the comments lately agree. Please fix. I used to really enjoy HuffPost. 10/5 I've reinstalled the app and it seems like it is working fine now. Will continue to to monitor.", "Numbers": "772", "Date": "October 9, 2018"}, {"Content": "Endless bugs The Huff Post is essential reading. But this app has more bugs, stalls, and crashes thanks any other. Read the many other bad reviews of this app. Those who produce it just don't seem to care. Uninstall and wait for a reliable version.", "Numbers": "773", "Date": "May 31, 2013"}, {"Content": "Consistently (update after update on apple & even more on android) it is always full of bugs (pop up \"cannot whatever pdf msg\"... + crashing often + sucky video playback). It gets 2 stars cuz i like the content. It is a pity. Technically speaking it could be a zero star .... sorry being so negative about .... a lot of time i just use browsers ...", "Numbers": "774", "Date": "May 6, 2018"}, {"Content": "Works great up until recently I keep trying to open the app, and it continuously crashes, to where I can't even get the home page open. Also, that new green color isn't doing you any favors. It's ugly. Fire your graphic designer who picked that color.", "Numbers": "775", "Date": "July 31, 2015"}, {"Content": "Uninstalling for good After this last update I've gotten crashes almost every time i try to switch the category. Then i reinstall and it works for about 5 minutes and crashes and doesn't open again. Over the frustration.", "Numbers": "776", "Date": "March 14, 2013"}, {"Content": "App keeps crashing!! I am resorting to reinstalling the app every day to keep from it crashing on me. Love the format, but please fix the bugs!", "Numbers": "777", "Date": "April 16, 2013"}, {"Content": "Used to work great, now I had to uninstall it to stay sane! Recent update makes the app crash 80-90% of the time. Fix it and I'll reload. Otherwise, I'm getting buzzfeed.", "Numbers": "778", "Date": "August 13, 2014"}, {"Content": "App was great until last update. Since then slideshows keep crashing the app. Uninstalled and reinstalled twice, still not working. Used to be my go to app for news, now it's my stay away from app.", "Numbers": "779", "Date": "August 18, 2015"}, {"Content": "Was a favorite I loved this app and used it daily for 6 months. It started crashing everyday so I tried to reinstall it but can't. It had an error every time. I hope they fix it soon!", "Numbers": "780", "Date": "June 28, 2015"}, {"Content": "Utterly Terrible Update Keeps crashing since update. They just can't get it right!", "Numbers": "781", "Date": "October 11, 2013"}, {"Content": "Huffington Post Used to be my favorite application. Crashes/forced closure every time now.", "Numbers": "782", "Date": "August 22, 2013"}, {"Content": "What happened? Worked great but something happened a couple months ago...now it crashes constantly. Uninstalled. It's too bad because it was my go-to news app.", "Numbers": "783", "Date": "February 4, 2013"}, {"Content": "Used to be a great app Please fix this app! I used to love HuffPost. I uninstalled due to pages not loading & app continually crashing. It's horrible now.", "Numbers": "784", "Date": "January 21, 2013"}, {"Content": "Stopped working I loved this app until it stopped working recently. It keeps crashing. I've tried uninstalling and reinstalling but all the same. It's a shame.", "Numbers": "785", "Date": "April 21, 2015"}, {"Content": "Constant crashes Soooo done with this app. Problems for weeks now. I love huff post's layout but I can't stand the crashes anymore. Maybe I'll try back in a few months.", "Numbers": "786", "Date": "May 8, 2013"}, {"Content": "Once good now sucks Crashes constantly. Recent updates & fixes render this app unusable.", "Numbers": "787", "Date": "October 27, 2015"}, {"Content": "Beautiful.......when it works As already mentioned, it crashes on Transformer Prime making it unusable. Fix that - you get 5 stars.", "Numbers": "788", "Date": "November 10, 2012"}, {"Content": "Crash crash crash Wouldn't open... always crashed", "Numbers": "789", "Date": "May 6, 2014"}, {"Content": "Crashes frequently Any scrolling causes the app to terminate. I hope the next version is more stable.", "Numbers": "790", "Date": "December 29, 2012"}, {"Content": "Crash and Burn... App crashes when I choose a story to read....have had this app since the beginning and I would hate to uninstall...", "Numbers": "791", "Date": "June 28, 2015"}, {"Content": "Keeps crashing Keeps crashing forcing me to uninstall and re install. This app used to be amazing.", "Numbers": "792", "Date": "May 9, 2013"}, {"Content": "Shabby Glitchy to the point of unusable. Suprisingly thin on content, or is it just that it crashes before you find anything?", "Numbers": "793", "Date": "August 12, 2015"}, {"Content": "Repeatedly Crashes I like reading the news in the app. Over the last 2 weeks it would crash if I tried to tweet an article, now will not even open without a crash.", "Numbers": "794", "Date": "August 29, 2015"}, {"Content": "Crashing Recently this app has been crashing every time I open it. Even when I close everything and try to restart, the app will crash. I've also been having issues with some videos. Please fix it!", "Numbers": "795", "Date": "September 5, 2015"}, {"Content": "Crasherific As of the most recent update: crashes every time I fav' a comment; doesn't display all comments; submitted comments are randomly \"lost\" when submitted. Uninstalled until this gets fixed.", "Numbers": "796", "Date": "December 15, 2013"}, {"Content": "Tried to change edition, app crashed and needed to be reinstalled. Not my favourite feature in a news app.", "Numbers": "797", "Date": "October 23, 2018"}, {"Content": "Constantly crashes after last update. Cannot finish reading articles. Very annoying.", "Numbers": "798", "Date": "October 23, 2018"}, {"Content": "Keeps crashing!! Half the time the story won't open that I click on and lately it has been crahsing over and over to the point where I have to uninstall it and then reinstall it. Grrrrrr!!", "Numbers": "799", "Date": "December 11, 2013"}, {"Content": "Crashing page The screen keeps going white. Won't load pages at all. Tried uninstalling and redownloading several times with no success.", "Numbers": "800", "Date": "February 24, 2013"}, {"Content": "Doesnt work anymore, keeps crashing everytime i try open an article", "Numbers": "801", "Date": "July 1, 2017"}, {"Content": "No idea what you all have done but now it crashes on my S7 or takes forever to load articles", "Numbers": "802", "Date": "July 13, 2017"}, {"Content": "Very poor update Since the update, it crashes and freezes. Forced to uninstall.", "Numbers": "803", "Date": "March 14, 2013"}, {"Content": "Crash, crash, freeze, crash, freeze Since a recent update the app had not been stable. Very disappointing.....and yes I've reported the issues.", "Numbers": "804", "Date": "December 19, 2012"}, {"Content": "App now crashing Used app for some time and was used frequently , now crashing several times in one viewing now removed app", "Numbers": "805", "Date": "August 9, 2015"}, {"Content": "Please fix! Since update, this app crashes frequently & all photos are absent. I miss my HuffPo!", "Numbers": "806", "Date": "December 27, 2012"}, {"Content": "The app keeps crashing, says there are pages for articles that are no longer available for reading.", "Numbers": "807", "Date": "June 28, 2015"}, {"Content": "IT CRASHED! For the first time, I updated it and the app crashed. I have an LG 505.", "Numbers": "808", "Date": "March 26, 2013"}, {"Content": "Great app until recent update. Crashes on loading. Uninstalled.", "Numbers": "809", "Date": "August 21, 2017"}, {"Content": "BUGS!!! Audio from videos continue to play after closing the app. Home page crashed all the time.", "Numbers": "810", "Date": "November 14, 2015"}, {"Content": "App keeps crashing No longer works on my phone", "Numbers": "811", "Date": "March 7, 2013"}, {"Content": "Can't leave comments Crashes a lot , can't comment. This app sucks, I uninstalled. it", "Numbers": "812", "Date": "August 26, 2015"}, {"Content": "Crap app Crashes and poorly written articles. Kim kardashian over substance.", "Numbers": "813", "Date": "November 14, 2012"}, {"Content": "This new app is rubbish keeps crashing", "Numbers": "814", "Date": "October 28, 2018"}, {"Content": "New release crashes on HTC hero when pressing menu button", "Numbers": "815", "Date": "November 22, 2009"}, {"Content": "Crashes frequently. No response from Huff, so UNINSTALLED", "Numbers": "816", "Date": "November 6, 2017"}, {"Content": "Crashes Won't even open anymore. Have uninstalled", "Numbers": "817", "Date": "October 15, 2013"}, {"Content": "Buggy... Every time I click on an article the app crashes.", "Numbers": "818", "Date": "August 10, 2015"}, {"Content": "Keeps crashing ! Can someone look into this crashing constantly ?", "Numbers": "819", "Date": "November 15, 2015"}, {"Content": "Keeps crashing after new update Worked fine until it updated a few days ago. Now it will not open.", "Numbers": "820", "Date": "October 12, 2013"}, {"Content": "Constantly crashes on me. On my Samsung GS3", "Numbers": "821", "Date": "January 28, 2013"}, {"Content": "Crashes a lot On Galaxy Tab 10.1 / Android 3.2", "Numbers": "822", "Date": "June 28, 2012"}, {"Content": "Just crashed when you try to read an article. Uninstalled.", "Numbers": "823", "Date": "September 13, 2018"}, {"Content": "It used to work fine but now it just crashes even after trying to reinstal on various devices", "Numbers": "824", "Date": "August 21, 2017"}, {"Content": "Keeps crashing Crashing and reloading all the time", "Numbers": "825", "Date": "January 18, 2016"}, {"Content": "Won't open. Crashes every single time.", "Numbers": "826", "Date": "August 31, 2015"}, {"Content": "Need to be fixed Crashes constantly on Samsung S5", "Numbers": "827", "Date": "October 11, 2015"}, {"Content": "App keeps crashing upon opening this morning", "Numbers": "828", "Date": "September 8, 2015"}, {"Content": "Crashes a lot. Won't even work now.", "Numbers": "829", "Date": "October 12, 2018"}, {"Content": "Constantly crashing since recent update.", "Numbers": "830", "Date": "September 23, 2018"}, {"Content": "Crash! It would not open some of the articles and also crashes it after", "Numbers": "831", "Date": "June 28, 2015"}, {"Content": "Crap It started crashing today", "Numbers": "832", "Date": "February 20, 2013"}, {"Content": "Not good Keeps crashing!", "Numbers": "833", "Date": "March 8, 2013"}, {"Content": "Crashes Unable to load app. Crashes at load", "Numbers": "834", "Date": "December 29, 2015"}, {"Content": "Cool app App is cool, when it is not crashing every 5 minutes.", "Numbers": "835", "Date": "November 11, 2012"}, {"Content": "New version crashes New version crashes", "Numbers": "836", "Date": "May 21, 2012"}, {"Content": "Crashes fixed :)", "Numbers": "837", "Date": "December 12, 2017"}, {"Content": "Best app around. Never crashes.", "Numbers": "838", "Date": "March 10, 2018"}, {"Content": "Keeps crashing", "Numbers": "839", "Date": "October 31, 2015"}]