[{"Content": "always crashes everytime im going to edit my photo...", "Numbers": "1", "Date": "February 17, 2019"}, {"Content": "today 01/28/19 the app is crashing i have uninstalled and reinstalled and keeps crashing. whats going on?? Please help. if this hasn't happened i would have rate your app with 5 stars couse is good", "Numbers": "2", "Date": "January 29, 2019"}, {"Content": "Love the effects but it crashes about half the times i go to get a photo from my gallery. all seems to be fixed now!!", "Numbers": "3", "Date": "January 23, 2019"}, {"Content": "The crashes [shortly after tapping the 'DOWNLOADED' button] have stopped, but nothing shows up in the 'My Vimages' section of the app. I'll try creating more content to see if that issue has been fixed.", "Numbers": "4", "Date": "December 20, 2018"}, {"Content": "The colours completely change when you export the animation. Because of this, I tried emailing support to cancel my account before the 7 day trial expiry but several days later, still no reply. The app crashes as soon as I click on the upgrade panel, and then it fully disappears after that making the panel fully untraceable. Not sure if it's intentional to make more sales or a bug. I hope they refund me if they don't cancel my account before the expiry date. Would really appreciate a reply!", "Numbers": "5", "Date": "January 11, 2019"}, {"Content": "don't waste your time downloading this. would be a great app if it didn't crashed continuously. won't be going ahead after free trial for sure", "Numbers": "6", "Date": "January 14, 2019"}, {"Content": "app is constantly crashing. images not saving 😡😠😡😠😡😡😡😡😡", "Numbers": "7", "Date": "December 21, 2018"}, {"Content": "I bought the pro version and loved the app, however since the update it continually crashes, I have sent log files of crashes and even emailed the developer from the email address here in play store and have not even had the courtesy of a reply. Please get the app fixed ASAP please.", "Numbers": "8", "Date": "November 30, 2018"}, {"Content": "App crashes as soon as it gets past the splash screen. Device Used: Xiaomi Mi Mix", "Numbers": "9", "Date": "November 6, 2018"}, {"Content": "Just suddenly stopped working. Keeps crushing and crushing - very frustrating. upd. crashes with every version, crashes at the very opening step", "Numbers": "10", "Date": "January 19, 2019"}, {"Content": "crashing on my nokia 7 plus", "Numbers": "11", "Date": "October 14, 2018"}, {"Content": "App would be nice if it would work. All it does is crash. What fixes ...Still Broken.", "Numbers": "12", "Date": "September 12, 2018"}, {"Content": "It's a great app I've used it for 3 days then last night it started to crash and freeze, i already installed it 5 times but it keeps on crashing and freezing, pls fix it, I would love to use this app more so pls fix it,", "Numbers": "13", "Date": "September 5, 2018"}, {"Content": "really disappointed...bought subscription and the app keeps crashing! Cancelled subscription . Such a shame as the app was perfect", "Numbers": "14", "Date": "October 2, 2018"}, {"Content": "The app keeps crashing. Cant do anything. Always stops working when I try to open a picture to edit", "Numbers": "15", "Date": "September 10, 2018"}, {"Content": "Boring and buggy .. Crashers alot and something off settings not even working.. 🙄", "Numbers": "16", "Date": "August 31, 2018"}, {"Content": "Crashed after processing the first tutorial Picture", "Numbers": "17", "Date": "August 19, 2018"}, {"Content": "Amazing app however currently it's crashing not able to import photo nor take a pic, the app just restarts. I deleted and downloaded again but no change. Please fix asap I love this app", "Numbers": "18", "Date": "August 14, 2018"}, {"Content": "The app is not just crashy, but also forces the user to watch some 15second advert before enabling the \"save\" option. That's of course on top of the intrusive watermark.", "Numbers": "19", "Date": "October 31, 2018"}, {"Content": "Crashes after ever ad. wont ever let you save because of the crash. complete waste of time. of it didnt crash I would be hyped!", "Numbers": "20", "Date": "February 14, 2019"}, {"Content": "How am I supposed to use this? Crashes as soon as I go into gallery to select images. Every time. Of course it didn't do this before I bought the app...", "Numbers": "21", "Date": "October 7, 2018"}, {"Content": "App keeps crashing every time I try to pick a photo from my gallery.", "Numbers": "22", "Date": "October 14, 2018"}, {"Content": "It crashes immediately. I can't even complete the tutorial.", "Numbers": "23", "Date": "September 14, 2018"}, {"Content": "App Crashes every 2 sec. Xiaomi Mi 5", "Numbers": "24", "Date": "December 25, 2018"}, {"Content": "It opens and it shuts..There is something wrong with it..It simply crashes..Is there a bug?", "Numbers": "25", "Date": "October 25, 2018"}, {"Content": "why my app always crash? I purchased already, but I can't use it!!!!!!!", "Numbers": "26", "Date": "September 28, 2018"}, {"Content": "I like it its a good concept but it keeps crashing on me.", "Numbers": "27", "Date": "August 12, 2018"}, {"Content": "It crashes!", "Numbers": "28", "Date": "November 5, 2018"}]