[{"Content": "Loved it at first. With new auto update it keeps crashing on every entry", "Numbers": "1", "Date": "January 24, 2019"}, {"Content": "Good, works well Downloaded this after my favourite list app started crashing, after searching for ages for an alternative and almost giving up I found this. Thank you for making that alternative!", "Numbers": "2", "Date": "November 8, 2018"}, {"Content": "Love this app, much more than a to do list I have a to do, shop list, a list of questions to ask at various meetings, even a freezer inventory. I think I just got organised thanks to this app", "Numbers": "3", "Date": "November 30, 2018"}, {"Content": "Super easy to use. Can easily change order of tasks up and down. Hasn't crashed at all. Easy to mark completion.", "Numbers": "4", "Date": "September 18, 2018"}, {"Content": "It worked for the first week. Now I can't add a task without it crashing.", "Numbers": "5", "Date": "August 30, 2018"}, {"Content": "I've been looking for an app to use in place of Wunderlist (due to its eventual demise), and thus far, this feels the most promising. Two major elements I'd like to see are having shared lists and being able to order sublists. I found quite quickly that if I wanted sublists in a particular order, I'd have to be sure to create them in that order. (Edit: It also keeps crashing here and there. Not a major issue thus far, but an issue nonetheless.)", "Numbers": "6", "Date": "April 17, 2018"}, {"Content": "I just installed it, created some task lists, then my phone crashed and I lost my task lists ... is there a way to recover the lost task lists? Thanks Steve for replying to me...looking forward to maybe this app be able to link to the cloud", "Numbers": "7", "Date": "March 18, 2018"}, {"Content": "This is the simple Material design task app I've wanted forever! Any plans to incorporate sync with Google Tasks? Would happily pay for that functionality in such a clean app.Also, it's currently a little difficult to tap on the date and time for a reminder to modify it. I tend to just accidentally disable and enable it a few times before I can actually bring it up to edit. Also also, on my Pixel on 8.0 beta the local backup button currently causes a crash.", "Numbers": "8", "Date": "August 16, 2017"}]