[{"Content": "I want to like it... but it keeps crashing every time I try to choose an event to purchase on my Huawei Mate SE.", "Numbers": "1", "Date": "January 18, 2019"}, {"Content": "Why require customers to download an app to retrieve their tickets in the first place? Its unnecessary, and the cherry on top is that it didnt even work after downloading. The app just kept trying to log me in, but any time I'd attempt to it would just freeze up. I spent over 30 minutes trying to retrieve my tickets with this app and eventually had to call customer service. All told it took me over an hour to finally get my tickets. I will not be using this service again, and unless you dont value your time id suggest finding somewhere else as well.", "Numbers": "2", "Date": "May 27, 2018"}, {"Content": "The app hasn't crashed yet, but it's nothing exciting either. The swiping between your tickets is often frustrating because the pull down to refresh gets in the way. Seat Geek as a whole, sucks. Their policies and procedures are dumb and unhelpful. Even if you give them a credit card, they will make you send a picture id to verify and add a bank account if their garbage system can't do it online for whatever reason. And then they require two business days turnaround on that. So good luck if you want to set up on Friday to sell tickets for that weekend. Their system won't allow you to actually remove tickets from your account. When you send them, they stay in your account, and to receive them, you have to make an account and then you can't remove them from that account even if you download them. Their customer service is a bunch of canned email replies. Their fees are higher than stub hub. Their only nice feature they have is scan into the games, but guess what? You can scan into the games with your pdf tickets too. So, to summarize: Seat Geek sucks.", "Numbers": "3", "Date": "May 6, 2018"}, {"Content": "Quick and easy to use. Helps me find nice seats for a flexible price. Still has a lot of room for improvements though. And the app crashes not often but it happens.",
  "Numbers": "4", "Date": "November 17, 2017"}, {"Content": "Extremely high fees, tickets were purchased in error due to the app malfunctioning and I reached out to SeatGeek customer service and was told too bad and that I could try to resell the tickets which will result in me losing over $100 between fees and commission charged by SeatGeek for tickets that I did not want and were purchased due to the SeatGeek app crashing.", "Numbers": "5", "Date": "November 16, 2017"}, {"Content": "The app is fine with the exception that it crashes repeatedly on my LG K20 V.... I just purchased MLB playoff tickets and was hoping to use the app but it routinely crashes when I try to access my tickets. Looks like I'm printing out tickets now... Hopefully they fix this.", "Numbers": "6", "Date": "October 12, 2017"}, {"Content": "When I click on an event, it starts to load. Then the app crashes. Please fix this.", "Numbers": "7", "Date": "August 16, 2017"}, {"Content": "Was good but crashes now Seat geek is great but the app will not open. It's shows the symbol and then crash", "Numbers": "8", "Date": "November 5, 2016"}, {"Content": "Not good!😠 I tried to go on the app but then the app would show the logo then crash!! Please fix seat geek!", "Numbers": "9", "Date": "November 7, 2016"}, {"Content": "Will not open As other users have noted, the app only displays the logo for a second then crashes.", "Numbers": "10", "Date": "November 7, 2016"}, {"Content": "Crashing App was great but now does not open", "Numbers": "11", "Date": "November 6, 2016"}, {"Content": "Can't view tickets\nI recently purchased tickets to a game. I found the app really helpful in finding ticket prices and knowing where my seats would be, but now that I have purchased tickets, I can't view them in the app. Every time I try, the app crashes. I've reported this several times on my old phone (galaxy s5) and just got the S6 edge and am experiencing the same problem.", "Numbers": "12", "Date": "December 26, 2015"}, {"Content": "Not responding When I look tickets up it freezes. And tells me the app isn't responding.", "Numbers": "13", "Date": "December 11, 2015"}, {"Content": "New version still crashes New version doesn't work. After selecting an event, the seat map appears and the app crashes.", "Numbers": "14", "Date": "November 10, 2014"}, {"Content": "Keeps crashing", "Numbers": "15", "Date": "October 6, 2014"}, {"Content": "Junk I don't understand the high ratings. Galaxy Note 3. I can search for and find events, but every time I click on an event it crashes.", "Numbers": "16", "Date": "October 4, 2014"}, {"Content": "Good app. Bad performance App keeps crashing. Overall good ticket information", "Numbers": "17", "Date": "April 26, 2014"}, {"Content": "Works good Sometimes it freezes on me and I have to start over... Other than that... Its OK", "Numbers": "18", "Date": "January 14, 2014"}, {"Content": "App sucks If I could give zero I would the app crashes won't even open", "Numbers": "19", "Date": "November 10, 2016"}, {"Content": "Crashes App crashed every time I tried to open it, so I couldn't show my barcode...", "Numbers": "20", "Date": "April 16, 2016"}, {"Content": "Crash Won't open. Uninstalled.", "Numbers": "21", "Date": "October 25, 2016"}, {"Content": "Used to work great, now crashes everytime I open. Android 5", "Numbers": "22", "Date": "October 21, 2016"}, {"Content": "Crashes", "Numbers": "23", "Date": "October 6, 2017"}]