[{"Content": "I love the tingles app. It's my go to when my mainstream ASMRtists haven't posted on YouTube. The app is fantastic but I think the overall UI could use some fine tuning. For example looking at specific triggers, only 15 videos show up when I believe the whole archive should be showing. That may need a fixing. As well app crashes when Facebook is open. Weird but reoccurring. Otherwise awesome app!", "Numbers": "1", "Date": "December 2, 2018"}, {"Content": "It crashed once, but it is a new app. I love asmr and being able to listen in the background is worth it my friends. Give tingles another chance.", "Numbers": "2", "Date": "October 17, 2018"}, {"Content": "Great app but after update the app won't even open it just crashes instantly please help", "Numbers": "3", "Date": "October 9, 2018"}, {"Content": "Crashes a lot.", "Numbers": "4", "Date": "October 8, 2018"}, {"Content": "My videos never buffer or freeze its better than watching ASMR on YouTube", "Numbers": "5", "Date": "August 9, 2018"}, {"Content": "This app was amazing...BUT now it crashes anytime I try and read a book. Also lots of popular ASMR-ist are not exsisting. I don't know what happend but this app is going down hill.", "Numbers": "6", "Date": "May 28, 2018"}, {"Content": "Its keeps crashing", "Numbers": "7", "Date": "May 13, 2018"}, {"Content": "Has potential, but seems to freeze repeatedly.... Oh, it just froze again. I'm very close to giving up on it 😕", "Numbers": "8", "Date": "April 20, 2018"}, {"Content": "I used this app for a really long time, it was working great and it helped a lot until one update came and I started getting errors, I reinstalled the app several times and every time I went on my homepage it would give me random artist that I did not follow nor have I heard about, when I did unfollow the artist the app would crash and when I would re-open it it would say there was an error with loading data. Unfortunately I had to uninstall the app and change my rating as the app does not work anymore.", "Numbers": "9", "Date": "March 15, 2018"}, {"Content": "Very good, but often the video will stop after about 8 minutes and the app ask me to try again(crash?)", "Numbers": "10", "Date": "July 17, 2017"}]