[{"Content": "I was excited to try using this app with my Pixel C and it shuts down before opening. I've tried sending feedback of the crashes, I even wiped my tablet to see if there was something causing a problem. This app continues to be a dud with very little support. I am very disappointed.", "Numbers": "1", "Date": "October 15, 2017"}, {"Content": "Crashes more often than it works Updated version has not changed my review The app won't load the folders I need. It just crashes. If I didn't have to use this for work, I wouldn't. I am lucky if I can get this app to work just long enough for me to report a project status successfully before it crashes.", "Numbers": "2", "Date": "February 19, 2016"}, {"Content": "App works. Not a single crash yet. One wish is to have more features from the web app onto the mobile app, such as gantt charts. Update: Description of task doesn't save and very often, fails to load. Quite frustrating.", "Numbers": "3", "Date": "September 2, 2015"}, {"Content": "Good integration between desktop and mobile Wrike continues to get better. Still a couple of bugs every once in a while and the service crashes even more rarely but all in all a great product", "Numbers": "4", "Date": "September 2, 2015"}, {"Content": "Crashes Constantly This has been crashing every single time I view an individual task. I tried uninstalling / re-installing with no luck. It's all but useless to me at this point. Once this is fixed, I'll re-rate.", "Numbers": "5", "Date": "August 12, 2015"}, {"Content": "Mobile version crashes too often The mobile version crashes whenever I hit the add task (+) button.. The browser version is fine though.", "Numbers": "6", "Date": "May 12, 2015"}, {"Content": "Much Improved App much happier with this app than the old one. Have Bern using it a few days and no crashes. Widgets are great. Will done :)", "Numbers": "7", "Date": "January 30, 2014"}, {"Content": "Wrike is project management tool. But Wrike can easily be also #1 *task* manager tool. And even #1 note taking tool. It's already better than 99.99% of the countless softwares in the market in every possible way. How ever the free version is not enough. And the paid plans are way too expensive for 1 user that only need about half of the great features. I would pay 10$ a month for 1 user extended plan if you would have one. I would pay 20$ a month (!) if you will have: 1. Multiple Folder filtering 2. Possibility to \"freeze\" depented tasks and hide them from the list&board views 3. Possibility to set dependencies without dates. 4. On top of all the other task management features that you have ...... But I will not pay 50$ a month for unlimited subprojects and unlimited subtasks. And I will not pay 125$ a month for costum fields and costum statuses.. please consider the fact that if you would implement 1 user paid plans you will have much more than 100 k downloads on the google store. Many more costumers in all the platforms and from all over the world! Happy new year", "Numbers": "8", "Date": "January 1, 2018"}, {"Content": "Good but... Adding file attachment from google drive crashes app on droid maxx", "Numbers": "9", "Date": "March 8, 2014"}]