[{"Content": "Great to have an app that allows me to send articles to instapaper (including multiple pages) so I can read on my kindle. However, it's not good reading experience since it crashes whenever you reopen it (read article, go YouTube, reopen instapaper, crash). Crash has existed for more than a year (and seen on multiple devices). Also frequently fails to show articles (blank page). Lean for Instapaper or Pocket are better alternatives!", "Numbers": "1", "Date": "September 17, 2018"}, {"Content": "First it didn't open anymore then I received unlimited premium for free but is fine since the company split then it didn't work for two months in europe and now when I touch Premium to pay it crashes.", "Numbers": "2", "Date": "August 21, 2018"}, {"Content": "I use this app twice daily during my commute.minus 1 star for daily crashes. I send feedback but it never gets fixed.minus 1 star for erasing words as it reads to me. It used to not do this, it used to just highlight as it reads to me. But now it erases the words as it reads and it's very buggy and doesn't look good. I much preferred the highlighting method. Minor annoyance is that it can't read big numbers very well. With these things fixed this app would be a five-star favorite.", "Numbers": "3", "Date": "March 1, 2018"}, {"Content": "Extremely useful app with way too many rough edges. When I use the web app and then reopen the mobile app on my pixel 2 xl, it crashes immediately. When loading content with math, it almost always gets it wrong (math text is usually duplicated or missing, depending on the source). I really want to give it five stars, and I think the design is much better than Pocket. But for the time being, it's just barely worth it.", "Numbers": "4", "Date": "March 1, 2018"}, {"Content": "Update 4.33 and 4.34 Fc (crashes) on marshmellow; went back to the excellent old 4.1 version and the app content can not be moved to SD maxing out internal space. As is: it's totally useless! The api for moving content to external sd exists since lolipop: \"action_open_document_tree\" intent allows users to grant sd access without root. You had couple of years to implement this but failed. - a very said state of affairs. Erik.", "Numbers": "5", "Date": "December 7, 2017"}, {"Content": "Keeps crashing It keeps crashing all the time if I try to open an Arabic article or if I try to search with Arabic word. It crashes with error: unfortunately instapaper has stopped working. please fix this annoying error. I can't use the app!", "Numbers": "6", "Date": "October 3, 2017"}, {"Content": "Consistently crashes on launch.", "Numbers": "7", "Date": "February 13, 2018"}, {"Content": "The concept is great. Certain areas I need to go where I'd like to read at times have terrible signal. Instapaper solves that by downloading them to my phone. It works really well... ...mostly. I don't know about the latest update, but until today, it crashes whenever Android unloads it from memory. It's irritating. But its support for IFTTT makes it killer. I pointed it at my favorite tech news site's RSS feed and it takes care of the rest.", "Numbers": "8", "Date": "April 4, 2017"}, {"Content": "While it is works when it works, it does have a tendency to regularly crash which is annoying. Recently, they made a change that u can't copy text which is horrible and am writing this here in the hopes that they will return that capability. Please.", "Numbers": "9", "Date": "April 23, 2017"}, {"Content": "I don't want to be negative, but I couldn't open the app yet. It crashes every time, literally. Nexus 5X (7.1.1)", "Numbers": "10", "Date": "April 4, 2017"}, {"Content": "Pros: very beautiful, no ad Cons: badly optimized for small RAM phone (e.g. my Nexus 5X with 2G RAM) -- it is not hearable when app is not in front screen; it's easy to crash after I switch to another app for a while then switch back.", "Numbers": "11", "Date": "August 8, 2017"}, {"Content": "Best offline reader I ever used but images in my articles keeps on crashing I think an update should created with a redownload all image feature the update of instapaper should automatically create instapaper folder in our galleries the folder should contain all the downloaded images in our articles so that we can view them within instapaper an out of instapper I have been waiting for the feature for a very longtime because I really love instapaper, instapaper will always remain number offline reader if my suggestion is added as a feature in all updated versions of instapper", "Numbers": "12", "Date": "June 11, 2017"}, {"Content": "Crashes every time it's opened.", "Numbers": "13", "Date": "August 2, 2017"}, {"Content": "Instapaper as a service is wonderful, but this application is very buggy. The application has problems predicting length when using pagination, and cropping content if it's to large. More critically, the update mechanism is very unreliable. Some articles suddenly show up again after being moved/archived/deleted, and occasionally requesting an update will start and hang indefinitely. If the app crashes in this hung state, or the user closes the app from this hung state it will crash. After such a crash the user must forcibly uninstall and reinstall the application in order to get it to launch again.", "Numbers": "14", "Date": "March 6, 2017"}, {"Content": "I love instapaper and I was an original backer years ago. However the current iteration crashes consistently on my Motorola X pure Edition Android marshmallow. I really need it back over pocket because if it's Kindle functionality which I use daily. Please update.", "Numbers": "15", "Date": "March 2, 2017"}, {"Content": "5 ⭐'s for the app, one star for stability. The app keeps crashing on startup on my OnePlus 3 running Android 7.0, even after reinstalling. I'll try Pocket until they improve the reliability. Unless Pocket turns out to be awesome, then nevermind. 😁", "Numbers": "16", "Date": "February 11, 2017"}, {"Content": "This App just keep crashing on my Android phone as soon as I open It but works perfectly on my iPhone, I recently shifted from iOS but the experience in Android is not very satisfactory to me, I hope the developers make more effort for its stability, I am more of a reader so this application is very much important to me, any way you guys are doing a really good job, I really hope that the bugs or whatever technical term you guys use gets fixed soon. I really love this app. Thank You", "Numbers": "17", "Date": "February 17, 2017"}, {"Content": "I used to love Instapaper, but it's been clear for some time now that Android is on the back-burner when it comes to development, if it's on the list anywhere at all. It got frustrating when about every other article I tried to tap on would load with a blank page — now, on my tablet, we've just gone the route of every single article telling me the page is unavailable in reading mode, and would I like to open it in the browser? Yes, I will, thanks. And I don't need Instapaper for that. Even the free premium service isn't worth it - now, if you have the app, switch to another app and switch back, it crashes. Stick with Pocket.", "Numbers": "18", "Date": "February 13, 2017"}, {"Content": "Love the app but it crashes constantly on my Moto G4, even after upgrading to Nougat. It's literally unusable for me in its current state.", "Numbers": "19", "Date": "March 20, 2017"}, {"Content": "Love the app, but it's constantly crashing. I've got a Nexus 6P that can easily handle most apps, but instapaper will no longer open and immediately crashes instead. This needs to be repaired asap. I'll keep the app and wait for an update, but if its still broken by then I'm uninstalling", "Numbers": "20", "Date": "March 6, 2017"}, {"Content": "Broken after using the app only once it no longer will open on my phone or my tablet it just crashes when click the app icon. Works great on my desktop but not on my android devices.l", "Numbers": "21", "Date": "January 25, 2017"}, {"Content": "Is great to use, when it works. And the times that it does work are few and far between. After experiencing constant crashes, reinstalling, and only for it to crash again, I'm turning away from Instapaper and looking for an alternative.", "Numbers": "22", "Date": "March 7, 2017"}, {"Content": "The app is crashing a lot frequently and user is forced to re-install the app. Not a consistent experience. I suggest to use \"pocket\" instead this app to save yourself from the pain of having the app crashes.", "Numbers": "23", "Date": "February 2, 2017"}, {"Content": "I am disappointed with Instapaper as they are not fixing any bug. The app shows an empty header while making highlights. Then 90%of the time app crashes during boot. My current rating is Junk app.", "Numbers": "24", "Date": "April 1, 2017"}, {"Content": "Crashes Love this app. Have had it for some time. Although, lately, it keeps crashing on open. ??? Please create a fix for this. I use a Galaxy Note 5.", "Numbers": "25", "Date": "January 15, 2017"}, {"Content": "Crashes on Night Mode in Nougat. Love the app. But dark mode is an essential feature of the app and it being broken is sad. Please fix it.", "Numbers": "26", "Date": "January 15, 2017"}, {"Content": "Has been crashing as of late on Android 7. No longer properly loads many articles and locks up the app instead. Basically unusable now.", "Numbers": "27", "Date": "January 26, 2017"}, {"Content": "For all the people suffering from crashes in newer updates of this otherwise magnificent app: just enable location permission for instapaper on your device and you're good to go. Heard it from the team and felt obliged to share it! And, yes, it works.", "Numbers": "28", "Date": "February 12, 2017"}, {"Content": "Great, use it on my iPad mini and my android phone. Just on my android I'm having crashes and can't start the app at the moment", "Numbers": "29", "Date": "February 15, 2017"}, {"Content": "Crash 1 star for app crashed for long time without fixing", "Numbers": "30", "Date": "January 16, 2017"}, {"Content": "Crashes constantly. Otherwise I liked it. I can't use it however because it won't run.", "Numbers": "31", "Date": "February 8, 2017"}, {"Content": "crashes figured out it crashes only after enabling night mode", "Numbers": "32", "Date": "January 5, 2017"}, {"Content": "..used to work fine (and could rate it almost 5 stars); after latest update constantly crashes when started at my Xperia Z Ultra..fix the app, please..I have a lot stuff saved there..", "Numbers": "33", "Date": "February 13, 2017"}, {"Content": "After update crash, only 2 new article left, all other just gone.", "Numbers": "34", "Date": "February 10, 2017"}, {"Content": "Version 4.3.4 crashes immediately after opening on Oneplus3 with Oxygen OS 3.2.8. Waiting for a fix.", "Numbers": "35", "Date": "February 12, 2017"}, {"Content": "Keeps giving me error I was hoping this was better than READ LATER? Can't tell as it keeps crashing?", "Numbers": "36", "Date": "February 9, 2017"}, {"Content": "Crashes after start. Clean data and reregister helps for short time...", "Numbers": "37", "Date": "February 15, 2017"}, {"Content": "Does not launch This app does not launch, and it crashes even when not running.", "Numbers": "38", "Date": "January 6, 2017"}, {"Content": "Either update if or remove it keeps crashing", "Numbers": "39", "Date": "March 13, 2017"}, {"Content": "I can't start it anymore. It just crashes on start-up.", "Numbers": "40", "Date": "March 5, 2017"}, {"Content": "It keeps crashing upon start-up- PLEASE fix this!", "Numbers": "41", "Date": "March 7, 2017"}, {"Content": "Constantly crashes and unable to even open the majority of the time.", "Numbers": "42", "Date": "March 5, 2017"}, {"Content": "Can't even open it. Keeps crashing.", "Numbers": "43", "Date": "February 16, 2017"}, {"Content": "Crashes upon Android 7.1 update", "Numbers": "44", "Date": "January 9, 2017"}, {"Content": "Crashed Not working", "Numbers": "45", "Date": "January 12, 2017"}, {"Content": "Crashes on Google Pixel", "Numbers": "46", "Date": "January 27, 2017"}, {"Content": "Crashed", "Numbers": "47", "Date": "February 12, 2017"}, {"Content": "Best of the lot\nI've tried out Diigo, Pocket, Delicious, and Instapaper is the best because of its simple and clean UI, multiplatform support for Chrome, Android, Web, and integrations with Facebook and Twitter, among others. There is one major problem that takes away one star from the rating. The app will crash and not launch if the night mode option is selected", "Numbers": "48", "Date": "November 29, 2016"}, {"Content": "App crashes\nLooks like lots of people experience this issue and you only reply to some of the comments. Very selective. My app constantly crashes and doesn't run at all. I've got a whole lot of articles saved in it and unable to access them, not to mention save more articles. All permissions have been granted. Pls advise how to make the app run.", "Numbers": "49", "Date": "July 16, 2016"}, {"Content": "Crashes when doing anything right now. Completely unusable.\nDoesn't function at all, lately. Crashes constantly. Can't even launch app or save an article to it after first install and login. Have tried reinstalling, removing data, clearing cache... After login, app always crashes. Whether open or not. Really love Instapaper, but this needs to be fixed. It's been going on for like, a month now. I'm paying money for a subscription. You're going to lose money if your app is literally unusable by your users.", "Numbers": "50", "Date": "March 15, 2016"}, {"Content": "Crashing App. Don't know why.\nI am a very old user of this app and I like it verry much. There is some bug in this app that I don't know why it is happening. So here is what it is happening, I logged in to my account and minimise it and stopped using. After some time it starts crashing. First I get the popup when I am on other app and when I start the app from my home screen same popup comes up. Don't know why it is happening. And also when I clear app data from settings it runs again fine.", "Numbers": "51", "Date": "January 2, 2017"}, {"Content": "After the last update the app just keeps crashing every time I try to open it! // As a premium user, I use it every single day on my phone, tablet and laptop. I save tons of articles and read them later in a clear and easy-to-read format. Love Instapaper!", "Numbers": "52", "Date": "May 18, 2016"}, {"Content": "One bug, not enough to spoil a great app\nCame to Instapaper after getting frustrated with Pocket's intrusive recommendations in articles. Only to be frustrated by content crashing of this app. My first review, yesterday was a 1⭐ stinker. Now, having found a way past that bug (DO NOT ENABLE automatic dark theme option), I'm loving the app. Probability of going back to Pocket is dropping by the hour. Thank you!", "Numbers": "53", "Date": "November 1, 2016"}, {"Content": "[Workaround found] Crashes on launch\nUpdate: to fix the crash go to the app settings and enable location. After logging in into my account successfully, the app just crashes on launch (it looks like the crashes happen in background as well). Android version should be taken more seriously: obviously iOS counterpart receives much more care. Doesn't make sense, Android users pays as much as iOS users do. Hope to see state of things to change. I'd like to not be forced to switch to Pocket.", "Numbers": "54", "Date": "May 20, 2016"}, {"Content": "Would love this app if it didn't crash immediately. Haven't even gotten a full 24 hours of use, and I'm unable to even open it anymore w/o it crashing immediately. Uninstalled & reinstalled repeatedly, & after an hour of use the same thing happens again. Very disappointed.", "Numbers": "55", "Date": "February 6, 2017"}, {"Content": "Bugs need to be fixed It's of course a good app but I need to catch attention. Since the last update, Instapaper crashes after only using it once. It doesn't work if I try to reopen it. Even when I reinstall the problem occurs again. So this needs to be fixed.", "Numbers": "56", "Date": "December 23, 2016"}, {"Content": "What Now? Re: Crashes\nI re-downloaded the app after years away because they've enabled premium features (according to the email I received), but the app crashed within minutes of its download and would not restart. I can't attest whether rebooting my phone will solve the issue due to my current workload, but that is a vastly inadequate solution either way. It appears to be an ongoing issue. Let's hope it's resolved quickly or it'll be many more years before I think about the app.", "Numbers": "57", "Date": "November 3, 2016"}, {"Content": "Keeps crashing when I open it. Reinstalling works but only the first or second time I open it, after which it crashes again and again. It's an otherwise fine app, I love using it (had it for years on other android and ios devices). I feel sad having to look elsewhere for reading later.", "Numbers": "58", "Date": "June 27, 2016"}, {"Content": "Constant crashing makes Instapaper completely unusable. I was so excited to try this out again after I read an article about Pinterest's acquisition of Instapaper. Looks like I'll be sticking with Pocket for now.", "Numbers": "59", "Date": "November 3, 2016"}, {"Content": "Crashes Does not work at all on Nexus 6p with Nougat. App crashes as soon as it is launched. On a Nexus tab with KitKat, there is no facility to read in landscape mode. Was impressed with the app on iOS, but highly disappointed with the Android version.", "Numbers": "60", "Date": "October 1, 2016"}, {"Content": "Crashes continuously I really like the fonts, the tilt scroll seems promising, but the app is unusable on my phone (Xperia Z5 compact). It repeatedly crashes while using it, and after a while it simply doesn't open anymore. Uninstalled. I hope it improves, as it has so many good features going for it.", "Numbers": "61", "Date": "May 31, 2016"}, {"Content": "Was really looking forward to checking this out Unfortunately, this app instantly crashes upon opening. Guess I'll wait to the next version to give it a try.", "Numbers": "62", "Date": "January 29, 2016"}, {"Content": "Crashing in background if new N beta 3\nDespite the crashing the app doesn't deserve 1 star for having occasional bugs, it's the app I spend most of my time on when using my phone. it's brought high quality content and actual long form reading back to my Internet usage after years of ADD headline skimming and junk content (see reddit). So thanks to the developer. Regarding the bug, it happens whenever I turn on background syncing. it turns into crashy pants and won't even let me share articles to it until I reinstall.", "Numbers": "63", "Date": "June 18, 2016"}, {"Content": "Keeps crashing The moment you attempt to open the app it crashes. Haven't been able to use it for several months now, since the update.", "Numbers": "64", "Date": "April 10, 2016"}, {"Content": "Beautiful - when it works. Needs amoled support\nSwitched to a paid Instapaper acc from Pocket recently and everything about it is just so much nicer. Unfortunately it's also one of the least stable apps on my phone. It'll run perfectly for a few days then I'll get a message the app has crashed, which will then appear every time I try to launch. The only solution is to uninstall/reinstall, which buys me a few more days. Annoying, but the app is good enough when it works to be worth it. Also, can I request a 'true black' mode for amoled screens", "Numbers": "65", "Date": "August 9, 2016"}, {"Content": "Instapaper is a wonderfully simple and clean web service, but their app is unusable in Nougat. Even when given all possible permissions, every other article opens to a blank page that freezes and often leads to a crash. Sign out, clear cache, delete and reinstall: no improvement. Months of reviews here (many from paid premium users!) mention the same problems, but the developers do nothing. Since Instapaper’s purchase by Pinterest granted premium status to all users (though app settings only intermittently reflect this), the developers now have even less reason to fix these issues. It’s enough to drive users to resource-hogging Pocket.", "Numbers": "66", "Date": "May 25, 2017"}, {"Content": "Crashing all the time on my new Tab S2 Love the app and use it daily on my iPhone or iPad w/o problems. Just got a new Samsung Tab S2 with Marshmallow and the app crashes constantly. I am a premium subscriber. Please help.", "Numbers": "67", "Date": "August 7, 2016"}, {"Content": "Keeps crashing This app used to work. Now it crashes every time I try to open it. Why?", "Numbers": "68", "Date": "September 3, 2016"}, {"Content": "Does nothing but crash Such a shame, it looks great, but unfortunately completely unusable. It even crashes after it has already crashes.", "Numbers": "69", "Date": "May 8, 2016"}, {"Content": "Keeps crashing I was able to run it for lest than 5 minutes. After that just kept crashing. Using nexus 5x. I hope they fix it soon.", "Numbers": "70", "Date": "April 15, 2016"}, {"Content": "Crashes on My Galaxy S6 I like the look and usefulness of the app but didn't seem to work on my android. Works great on iPad and Chrome desktop.", "Numbers": "71", "Date": "December 24, 2016"}, {"Content": "For those who found the app constantly crashing on 6.+ android version . It can be fixed if you switch on the location permission via Settings - Application Manager - Instapaper - Permission Manager. Find approximate location permission in the list and approve. Or you can switch off automatic night mode in internal app settings.", "Numbers": "72", "Date": "December 19, 2016"}, {"Content": "Crashes on start Latest updates broke the app and it doesn't start. EDIT: After talking to support, the solution is to uninstall and then reinstall. The app started asking for location data in a recent update and crashes if you deny that permission.", "Numbers": "73", "Date": "February 13, 2016"}, {"Content": "Good but keeps crashing untill reinstall I like the app but once it crashes, a reboot of the app nor the phone helps. I need to reinstall it entirely.", "Numbers": "74", "Date": "April 8, 2016"}, {"Content": "Used to be my fav app , now IT IS THE WORST ! DON'T UPDATE\nThe app was very useful really and it was just perfect , then suddenly it stopped adding new article , whenever i save one from my browser it says saved as usual then i don't find it !!! I deleted some articles from it ( i only have 80 articles , not that much but anyway i deleted some of them ) yet the problem wasn't fixed .... then i decided to update it , and that turned ot to be the stupidest decision i made !!! The app crashes and doesn't open and i can't reach my saved articles anymore , the app doesn't open at all !!!!!! I want my saved articles what can i do ?????!!! Plz fix the app it was really amazing and simple , i don't want to switch to other apps ,i liked that app vety much really but u r forcing me to do that !", "Numbers": "75", "Date": "September 19, 2016"}, {"Content": "Current version doesn't work Echoing others, the most recent version eventually gets stuck in a crash loop. The only way to fix is uninstall and reinstall. Please fix!", "Numbers": "76", "Date": "November 11, 2016"}, {"Content": "Crashes Constant crashes, even when not using it on Nexus 6 and Nexus 9. Pretty much unusable.", "Numbers": "77", "Date": "June 2, 2016"}, {"Content": "Crashes constantly. Never used to have problem but can't use it at app now.", "Numbers": "78", "Date": "September 24, 2016"}, {"Content": "Fix for non functioning app\nIt seems that going into app settings and allowing location permissions does fix the automatic crashing but this is quite frustrating and seemingly the opposite of user friendly as most users would like to use the dark mode feature. Why doesnt the app simply ask for this permission when datk mode is enabled? That seems like a fairly simple workaround seeing as this app is useless for a lot of android users otherwise. At least post this workaround on the help page of your website so people can find it.", "Numbers": "79", "Date": "November 11, 2016"}, {"Content": "Crashes on start Haven't ever been able to open the app, crashes every time", "Numbers": "80", "Date": "November 1, 2016"}, {"Content": "Crashes every time Unusable. A crash on just opening. if fixed then will re-visit review", "Numbers": "81", "Date": "February 27, 2016"}, {"Content": "Refuses to open Worked fine for the first few times but now the app just crashes at startup", "Numbers": "82", "Date": "April 6, 2016"}, {"Content": "Went from stable to unstable. Since the latest update the app constantly crashes.", "Numbers": "83", "Date": "May 17, 2016"}, {"Content": "Loved the app, but why do you need location? Disable location and the app crashes at launch. Why do you need location?", "Numbers": "84", "Date": "January 3, 2017"}, {"Content": "Frequently Crashes Doesn't even open up, instantly Crashes on my Moto g3 & Nexus 6.", "Numbers": "85", "Date": "February 17, 2016"}, {"Content": "This app was last updated on January 25, 2016? Wow. Just wow. It does not work on Nougat. Crashes on every attempt to share to it or open it. From the looks of it, no updates are coming so it's best to just dump it.", "Numbers": "86", "Date": "November 4, 2016"}, {"Content": "App super buggy App constantly crashes after initially opening and logging in. It seems a lot of people are having the same issue with this ancient February '16 build.", "Numbers": "87", "Date": "November 9, 2016"}, {"Content": "Unusable Constantly crashes on launch. Nexus 6 running Android nougat 7.0", "Numbers": "88", "Date": "December 4, 2016"}, {"Content": "After the most recent update, the app keeps crashing. I will change this rating to 4 stars if it starts working like before.", "Numbers": "89", "Date": "July 23, 2016"}, {"Content": "Need to be fixed on Android N The app keeps crashing on Android N, please fix it.", "Numbers": "90", "Date": "August 29, 2016"}, {"Content": "Needs update Keeps crashing in the background. No updates in almost a year.", "Numbers": "91", "Date": "December 4, 2016"}, {"Content": "Crashes constantly Crashes while running in background, and crashes if you try to share anything to it. Pixel C. Android 7", "Numbers": "92", "Date": "November 2, 2016"}, {"Content": "A very good app in terms of UX but It crashes on my Nexus 7 (2013) tablet with latest available Androind onboard. Re-install of the app does help, but it is rather temporary fix.", "Numbers": "93", "Date": "August 1, 2016"}, {"Content": "Crashes every time On a Galaxy Note 7 running marshmallow. Can't even get it open!!", "Numbers": "94", "Date": "October 1, 2016"}, {"Content": "Crashing. Please Fix . The best app ever used , but from last update Crashing at every single time I open it. Moto G3 - Marshmallow 6.0.1.. please Fix .", "Numbers": "95", "Date": "November 12, 2016"}, {"Content": "Crashes on install I've tried three devices, doesn't work on any of them", "Numbers": "96", "Date": "December 17, 2016"}, {"Content": "Good but now crashes It worked wonderfully but recently i find rhat when i try to open it it crashes", "Numbers": "97", "Date": "June 21, 2016"}, {"Content": "Crashes every time I start it. Have reported it twice, but still broken.", "Numbers": "98", "Date": "December 13, 2016"}, {"Content": "What happened ?! The application keep crashing", "Numbers": "99", "Date": "December 11, 2016"}, {"Content": "Update ruined the experience After update the app crashes Everytime I open it", "Numbers": "100", "Date": "September 27, 2016"}, {"Content": "Crashes every time I try to launch it. I use a Moto X Play", "Numbers": "101", "Date": "December 21, 2016"}, {"Content": "Crashes frequently, lost all account information and all the pages that were saved.", "Numbers": "102", "Date": "February 7, 2016"}, {"Content": "Crashes all the times Crashes every time, i delete it as soon as a install it.", "Numbers": "103", "Date": "November 5, 2016"}, {"Content": "Crashing Constantly. Like every 2 minutes. For the past month, at least.", "Numbers": "104", "Date": "March 10, 2016"}, {"Content": "Constant crashin App constanly crashes too bad it could be a great app for long flights.", "Numbers": "105", "Date": "October 14, 2016"}, {"Content": "Crashing everytime After the latest update the apps keeps on crashing on launch...", "Numbers": "106", "Date": "February 29, 2016"}, {"Content": "New update crashes all the time. 😠", "Numbers": "107", "Date": "December 27, 2016"}, {"Content": "App crashes every time I open it", "Numbers": "108", "Date": "December 12, 2016"}, {"Content": "Potential But constantly crashes on OnePlus 3 :(", "Numbers": "109", "Date": "August 10, 2016"}, {"Content": "Keeps crashing Unfortunately, Instapaper has stopped", "Numbers": "110", "Date": "May 14, 2016"}, {"Content": "Crashed Can't even open into the app", "Numbers": "111", "Date": "November 6, 2016"}, {"Content": "Crash at start Always crashes and even won't start", "Numbers": "112", "Date": "December 14, 2016"}, {"Content": "Can't even open the app. It crashes.", "Numbers": "113", "Date": "October 26, 2016"}, {"Content": "Love it Last update won't load :( Crashes on start up unfortunately. Love this app otherwise UPDATED: A reinstall fixed it.", "Numbers": "114", "Date": "September 6, 2016"}, {"Content": "crashes can't open the app at all", "Numbers": "115", "Date": "October 3, 2016"}, {"Content": "App keeps crashing App keeps crashing every time", "Numbers": "116", "Date": "October 27, 2016"}, {"Content": "Crash crash crash - Sony Z5", "Numbers": "117", "Date": "November 7, 2016"}, {"Content": "crashs constantly too bad, had the potential to be very useful", "Numbers": "118", "Date": "May 19, 2016"}, {"Content": "Crashes The app crashes", "Numbers": "119", "Date": "February 17, 2016"}, {"Content": "Why the app crash?", "Numbers": "120", "Date": "September 27, 2016"}, {"Content": "I like it when it doesn't crash and I can use it, which seems to be rare.", "Numbers": "121", "Date": "November 6, 2016"}, {"Content": "Crashes on opening Sad", "Numbers": "122", "Date": "May 9, 2016"}, {"Content": "Crashes all the time", "Numbers": "123", "Date": "November 15, 2016"}, {"Content": "It is crashing consistently...", "Numbers": "124", "Date": "March 19, 2017"}, {"Content": "Crashing Lots", "Numbers": "125", "Date": "November 3, 2016"}, {"Content": "Keeps crashing", "Numbers": "126", "Date": "September 20, 2016"}, {"Content": "Crashes on start", "Numbers": "127", "Date": "November 25, 2016"}, {"Content": "Constant crashes", "Numbers": "128", "Date": "May 25, 2016"}, {"Content": "Crashes on open", "Numbers": "129", "Date": "October 2, 2016"}, {"Content": "Crashes at start", "Numbers": "130", "Date": "February 8, 2017"}, {"Content": "Crashes on open", "Numbers": "131", "Date": "February 7, 2016"}, {"Content": "Crashes on start", "Numbers": "132", "Date": "April 2, 2016"}, {"Content": "It works no crashes", "Numbers": "133", "Date": "January 30, 2017"}, {"Content": "Crashes", "Numbers": "134", "Date": "November 3, 2016"}, {"Content": "Love the service, but the app crashes It just doesn't work on my Nexus 6. Crashes on open every time. It will not run.", "Numbers": "135", "Date": "January 25, 2016"}, {"Content": "Not working with ma tab 10.1 Crashes everytime when I try to save any article in my tab Samsung tab 10.1, and shows a message, 'unfortunately instapaper has stopped working'", "Numbers": "136", "Date": "November 1, 2015"}, {"Content": "It just crashes all the time.", "Numbers": "137", "Date": "November 21, 2016"}, {"Content": "App crashing App crashing too often. It's irritating..", "Numbers": "138", "Date": "November 2, 2016"}, {"Content": "Still crashes frequently. I have therefore moved to using Pocket instead.", "Numbers": "139", "Date": "February 15, 2017"}, {"Content": "Just installed it, crashes on start...", "Numbers": "140", "Date": "November 3, 2016"}, {"Content": "Ok, but... Constantly crashes even though I'm not even using the app. Going to uninstall.", "Numbers": "141", "Date": "September 21, 2014"}, {"Content": "Constant background FC Good app, works well, but really unstable on Moto X. Crashes in the background multiple times per day.", "Numbers": "142", "Date": "October 10, 2014"}, {"Content": "Crashes repeatedly", "Numbers": "143", "Date": "July 18, 2014"}, {"Content": "good app, terrible crash bug\nIt's a good app, except that it crashes constantly on my Nexus 7. It seems to happen whenever it goes out of range of a wi-fi access point, connected or not. I like to read on the bus to work, and unless I turn off wi-fi (which is annoying, as I will have to turn it back on later) it will crash more than ten times in half an hour as the bus passes various wi-fi access points,", "Numbers": "144", "Date": "January 17, 2014"}, {"Content": "Crashing on Kit Kat Repeated messages that Instapaper stopped working. Cleared all messages and cache, un/re install did not help. Support not to be found for paid app. Makes tablet unusable with repeated error messages every 10minutes or so.", "Numbers": "145", "Date": "January 27, 2014"}, {"Content": "Crashes constantly I bought this app to read articles on the bus. It crashes while reading articles unless I put my tablet in airplane mode. You'd think for the price they could figure how to delay network calls when there is no connection, every other app in the market has.", "Numbers": "146", "Date": "January 9, 2014"}, {"Content": "Crashes repeatedly when viewing articles.\nI really wanted this app to work, but every time I try to open an article it crashes. I've sent numerous support requests -- not unreasonable, it's a paid app -- but have had no meaningful response -- friendly but ineffectual. As it is unusable and taking up space, I'd give it no stars if it were possible. EDIT After a few weeks the developers got in touch and resolved the issue, and now I'm very happy...", "Numbers": "147", "Date": "November 2, 2013"}, {"Content": "Crashes every time I try to go into settings Jelly Bean. Settings are broken. Also, not a fan of the look. It's tired on iOS and worse here. Papermill is a much better app.", "Numbers": "148", "Date": "July 12, 2012"}, {"Content": "Crashes on the new nexus No matter what I do, it crashes. Completely unusable on the nexus, I want it fixed or my money back :(", "Numbers": "149", "Date": "July 5, 2012"}, {"Content": "Does all I want it to do I've been waiting forever for Instapaper to be ported to Android, and I have nothing to complain. No crashes or the like, smooth desktop browser integration with the \"Read Later\" bookmarklet, very readable formatting.", "Numbers": "150", "Date": "July 12, 2012"}, {"Content": "Happy to see this, missing core iOS interactions\nAs a longtime user of multiple mobile platforms, I'm happy to see an official Instapaper app that I could use on my Android devices. I was disappointed, however, to find that this version of Instapaper is missing several key interactions from the iOS version: 1) Pagination! 2) Resume last reading location when starting the app 3) Go back to article list on archive 4) Hiding toolbar while reading I also had a crash already, but that happens on the iOS version too. :]", "Numbers": "151", "Date": "June 4, 2012"}, {"Content": "Crashes constantly on Pixel. Have to uninstall and reinstall only to have it work once or twice before I have to repeat uninstall. Is anyone looking after this app? Instapaper is too critical to let this app die on the vine.", "Numbers": "152", "Date": "March 15, 2017"}, {"Content": "Crashes but good idea Nice simple reader that syncs to the web app for free. Unfortunately, it crashes both in opening from my home screen and in sharing to it from chrome. I'll update this when I've tried the newest android security patch.", "Numbers": "153", "Date": "September 23, 2016"}, {"Content": "Tasted on a Lenovo tab. Android 4.4.2 It crashed a lot when I was exploring the apps settings. A total bummer for me. Maybe it runs better with more recent versions of Android.", "Numbers": "154", "Date": "April 17, 2016"}, {"Content": "Crashing constantly Although this app is pretty much what I was looking for, the fact that I cannot even open it on the phone makes it impossible to use", "Numbers": "155", "Date": "August 26, 2016"}, {"Content": "Crashes Really love this app but I'm not going to use it until they fix the crash issue. Crashes Everytime i open it", "Numbers": "156", "Date": "November 4, 2016"}, {"Content": "Free aggravation First, app does not download comments in a blog post. Second, app crashes frequently. FREE? This app is too expensive. I wouldn't use it again if they paid me.", "Numbers": "157", "Date": "November 6, 2016"}, {"Content": "Crashes every time After sync the app crashes while opening. I was thinking to switch from Pocket as I like the simplicity, but I read mostly on my phone.", "Numbers": "158", "Date": "March 4, 2016"}, {"Content": "Needs work\nTLDR; I'm disappointed I bought this, I expected something that resembled the quality iOS experience. Pros: I can read my instapaper articles Cons: Crashes all the time (can't open the settings on my Galaxy Nexus w/o a FC), Needs the iOS fonts, Needs Sepia mode, needs page flip mode, no featured articles.", "Numbers": "159", "Date": "July 6, 2012"}, {"Content": "Crash on start up After the last update the app crashes as soon as you run it and even after you reboot your phone.", "Numbers": "160", "Date": "February 1, 2016"}, {"Content": "ICUR Cycle Install, Crash, Uninstall, Reinstall Repeat. I was hoping to replace Evernote for articles, but I can't trust the app to launch.", "Numbers": "161", "Date": "July 24, 2016"}, {"Content": "Please fix ASAP! The app crashes before it can even open on my S7 Edge.", "Numbers": "162", "Date": "January 15, 2017"}, {"Content": "Crashes on startup This app just doesn't work on my Android 4 phone.", "Numbers": "163", "Date": "February 14, 2013"}, {"Content": "What a frustrating app. It just crashes everytime I try to save something", "Numbers": "164", "Date": "February 23, 2017"}, {"Content": "Constant Crashing! Would be good if it worked.", "Numbers": "165", "Date": "October 3, 2016"}, {"Content": "Can't open without crashing Upgraded to premium version and haven't been able to use it once without crashing.", "Numbers": "166", "Date": "October 8, 2016"}, {"Content": "Not ready for primetime Crashed three times within the first 10 minutes of downloading the app. Also didn't update with an article I sent to it. Going back to readability.", "Numbers": "167", "Date": "July 16, 2012"}, {"Content": "Crashes Android every time on a share from chrome or stock browser.", "Numbers": "168", "Date": "November 3, 2015"}, {"Content": "Doesn't work on Android. It will crash.", "Numbers": "169", "Date": "March 2, 2017"}, {"Content": "Cannot copy text from articles. Crashes.", "Numbers": "170", "Date": "December 5, 2017"}, {"Content": "Crashes That's all it does.", "Numbers": "171", "Date": "November 2, 2016"}, {"Content": "I really like this app but it's so crashy", "Numbers": "172", "Date": "December 26, 2016"}, {"Content": "Crashes on launch", "Numbers": "173", "Date": "December 26, 2016"}, {"Content": "Can't use it, crashes constantly", "Numbers": "174", "Date": "November 14, 2016"}]