[{"Content": "Ever since the update, my app is delaying messages by almost 30 minutes if not opened. Checked the servermanagement and the background connection on my blackberry keyone. Application also crashes and sometimes wont even open until i repeatedly close it. Network Connection also causes it to log out at times.", "Numbers": "1", "Date": "January 8, 2019"}, {"Content": "OK but crashes a lot", "Numbers": "2", "Date": "December 7, 2018"}, {"Content": "Old version was buggy and crashed. The new version lacks features but is getting better .", "Numbers": "3", "Date": "September 29, 2018"}, {"Content": "Crashing", "Numbers": "4", "Date": "July 28, 2018"}, {"Content": "This was a great app but now tbh it's useless! Constantly have trouble sending pictures, loss of connection, the app crashing etc it's starting to get abit boring having all these problems now. Sort it out wickr before we all sack you off for something more reliable!", "Numbers": "5", "Date": "June 9, 2018"}, {"Content": "Crashing again, not able to start app, even after last update, get this fixed asap!!!", "Numbers": "6", "Date": "May 24, 2018"}, {"Content": "Worked fine for two days and now will not load. Crashes immediately. Garbage app", "Numbers": "7", "Date": "May 22, 2018"}, {"Content": "App can't even open since last update, immediate crash - hotfix this garbage NOW", "Numbers": "8", "Date": "May 23, 2018"}, {"Content": "Frequent app crashes on opening the app. Only lets you share 1 picture at a time. Fix these issues and I'll add one star. Otherwise OK secure messenger.", "Numbers": "9", "Date": "May 15, 2018"}, {"Content": "Crashes every time i try to open it", "Numbers": "10", "Date": "May 8, 2018"}, {"Content": "Usually its great but recently will NOT open or stop crashing. Needs fixing guys im sending urgent and important messages using it and it needs to be more reliable. Will give 5 stars when this is sortes.", "Numbers": "11", "Date": "March 23, 2018"}, {"Content": "Stopped working have to uninstall and install to make it work for a bit then crashes again. Please fix this", "Numbers": "12", "Date": "March 22, 2018"}, {"Content": "Was great until last 2 updates. Can't even open now. Just crashes over and over", "Numbers": "13", "Date": "March 1, 2018"}, {"Content": "App crashes quite regulary and messages get lost in the system somehow.. the amount of times people send me a message and i get a notification but the message doesnt show up on my phone and i have to get them to resend the messagr is scary. This also happens when i send messages sometimes too. Not happy wickr. Will be switching to signal private messenger as that app works perfectly", "Numbers": "14", "Date": "February 16, 2018"}, {"Content": "This app seems to have a ton of bugs at the moment making it very hard to use effectively. For example, I cannot look at messages from contacts by clicking on the conversation . I have to find their contact in the contacts list then open the conversation from there. In addition, the search seems to crash regularly.", "Numbers": "15", "Date": "January 14, 2018"}, {"Content": "This app is absolutely awful and runs badly on the Samsung Galaxy s7 on Android N and the Asus Zenpad S 8.0 with Android M. Every time you open the app to view a new message, it will sit there with a black screen for 10 seconds and eventually crash. Force close, reopen, then you can finally see the message. When the app does work, it constantly has to log itself in when opening it. This app is garbage, low-quality software. Even their Windows desktop app is a hot mess, poorly designed and looks ugly. These people don't know what they're doing and are terrible software developers.", "Numbers": "16", "Date": "February 5, 2018"}, {"Content": "I've been using this app for a couple of months. It's a great secure messaging solution and I love it. The latest update has a few major issues though which is why I'm rating it two stars. I no longer receive any notifications for new messages. Occasionally I'll send a message that dissappears from the log within seconds, leaving me unsure of whether it sent or not. The app is also constantly crashing. I have to wait for the not responding notice to click on close in order for it to actually restart and begin working properly. I can't simply close the app from the window switcher. It just goes back to the unresponsive app. Those are the only reasons I'm giving Wickr this rating. Aside from that it's great and I will update this review once the issues are fixed. Please do this soon Wickr! Notifications being the main one. Those are pretty important in order to get back to someone in a timely manner.", "Numbers": "17", "Date": "February 17, 2018"}, {"Content": "No longer operational. Freezes upon launch, uninstalled and reinstalled. Nothing. Please update the bugs!", "Numbers": "18", "Date": "January 24, 2018"}, {"Content": "Absolutely terrible. Worked for 2 days and now it crashes when I try to open it.", "Numbers": "19", "Date": "February 9, 2018"}, {"Content": "Cant even get past the register or login screen. It just freezes. This is on my note 8", "Numbers": "20", "Date": "February 2, 2018"}, {"Content": "It looks good but my friend couldn't save what I sent and when I tried to send a video it crashed.", "Numbers": "21", "Date": "December 12, 2017"}, {"Content": "Keeps crashing all the time.", "Numbers": "22", "Date": "January 2, 2018"}, {"Content": "Crashes constantly", "Numbers": "23", "Date": "December 31, 2017"}, {"Content": "It glitches ALL THE TIME, but all my friends use it so I'm stuck putting up with it. Notifications never work and it crashes every other time I send a message. I have a galaxy s7, not sure if that has anything to do with the constant shutting down.", "Numbers": "24", "Date": "December 6, 2017"}, {"Content": "Keeps crashing. All the freaking damn time. Its infuriating and frustrating. Fix ur bugs or whatever. Not happy.", "Numbers": "25", "Date": "November 29, 2017"}, {"Content": "Crashes all the time.", "Numbers": "26", "Date": "December 9, 2017"}, {"Content": "App you to work phenomenally before the most recent major update (that added new UI) New update always crashes, logs me out occasionally, and fails to send notifications when they are enabled.", "Numbers": "27", "Date": "October 26, 2017"}, {"Content": "This app would be perfect, but crashes are a daily occurrence. It is very frustrating.", "Numbers": "28", "Date": "October 22, 2017"}, {"Content": "Was a great intact I would go as far as saying it was the best secure messanger on the market but with the new UI some things are better but it crashes more but the absolute wort thing is group messaging is limited to just 10 people this for me all the other improvements worthless as I would trade them all for larger group size", "Numbers": "29", "Date": "November 13, 2017"}, {"Content": "Horrible. It crashes constantly and slows my new note 8.", "Numbers": "30", "Date": "November 21, 2017"}, {"Content": "Used to work great but can't open it anymore on my Moto E4. Crashes on startup", "Numbers": "31", "Date": "October 30, 2017"}, {"Content": "Used to be great. Now crashes on startup.", "Numbers": "32", "Date": "November 13, 2017"}, {"Content": "Crashes daily... Please fix. App could be amazing.", "Numbers": "33", "Date": "October 31, 2017"}, {"Content": "crashes way too much", "Numbers": "34", "Date": "October 31, 2017"}, {"Content": "This app would be a godsend if it didn't crash Everytime I open it or send a message. Nothing more aggravating then typing out an entire message and upon hitting the send button the app crashes and message is lost. You start at square one again. Boooo! This app is super buggy.", "Numbers": "35", "Date": "October 19, 2017"}, {"Content": "Absolute garbage since the update. Crash, bugs, the lot. Get signal instead.", "Numbers": "36", "Date": "October 21, 2017"}, {"Content": "Avoid Since the new wickr me the app is unusable , crashes all the time. But worst is that you can't delete messages . This is on going problem that wickr team seems not to care .", "Numbers": "37", "Date": "October 11, 2017"}, {"Content": "Was working good until the last big update. Now notifications don't work half the time. Crashes on opening half the time. \"Delete chat and all data\" just adds a message at the bottom saying \"room deleted\" but leaves the full convo in tact. Switching to Signal.", "Numbers": "38", "Date": "October 10, 2017"}, {"Content": "Update ruined it. It's buggy now. Often crashes or freezes. Other problems: 1. Screen shots are now allowed. Why would you do that? Like many, I liked that feature that blocked screen shots. Sure someone could in theory get it anyway (picture with another device, cast screen, etc ) but it was a good deterrent. @Wickr You guys had a great product with the old version. If you wanted to charge for it, I would have gladly paid for it (or make a free version and paid gets extra options or something) However this current version is atrocious.", "Numbers": "39", "Date": "September 26, 2017"}, {"Content": "Before the forced update, except for some stability issues, Wickr was PERFECT! The new version, even with succeeding updates, is just crappy. -pictures takes long to load, timer starts as soon as message is tapped, not when it is displayed; a pic timed for 1 minute will never be displayed -the functionality press and hold to view pix is gone (can you perhaps make this an option?), -timed authentication is gone (switching from Wickr to another app then back to Wickr would require you to re-login), -recalling messages makes the app crash each and every time, and will sometimes fail to recall on the other side or across devices, -screenshot notification is gone, -sender no longer has control of message, receiver may be able to export file (doesn't this defeat the purpose of transient messages in the first place? If i wanted the receiver to save the file, I would have emailed it or use viber/whatsapp), -app crashes a lot more than the old version (tested on Oreo and Marshmallow)", "Numbers": "40", "Date": "September 27, 2017"}, {"Content": "Since the latest update the app won't even open. Crashes during launch.", "Numbers": "41", "Date": "September 26, 2017"}, {"Content": "app seems to be very unstable, constantly crashing.", "Numbers": "42", "Date": "September 25, 2017"}, {"Content": "It used to be the best, but the update that changed the GUI destroyed it. Default destruction settings are gone, the app crashes frequently, the cache takes 80+ MB more in data use every day. They took something that was good and made it a pain to use.", "Numbers": "43", "Date": "September 20, 2017"}, {"Content": "New update make the app become worse than ever Frequent crash ,unable to delete message at will....", "Numbers": "44", "Date": "September 22, 2017"}, {"Content": "Sooo buggy. Only 1 time in 100 can I manage to read my messages without the app crashing. Takes a day or so to tell me I've got a message - if at all.. It's just painful. Get it right fellas.", "Numbers": "45", "Date": "September 12, 2017"}, {"Content": "Have to reboot my Note5 *every* *single* *time* I send or receive a message on latest version as the app crashes whenever it is subsequently started. Force stop doesn't help nor does clearing the memory using Smart Manager or Android Assistant.", "Numbers": "46", "Date": "September 14, 2017"}, {"Content": "Ive used this app for a couple years and it has been good right up until the last update... Once the update was completed i became locked out of my account for 24hrs because the app crashed whilst logging in. After being able to log in, the app crashes every time i run the app, after about 4seconds. Using a samsung galaxy s7 edge and have been since release. Ive had wickr on this device also since.", "Numbers": "47", "Date": "September 16, 2017"}, {"Content": "The app is constantly crashing/not responding as soon as I try to open a message or send a message the app will crash and boot me out causing me to log back in again. Also the app makes my phone run slow.. this app is basically unusable", "Numbers": "48", "Date": "September 9, 2017"}, {"Content": "Could put up with the bugs and crashes for the end to end encryption but now I cannot delete old conversations I'm about to stop using it unless this is fixed in a not too distant update", "Numbers": "49", "Date": "September 15, 2017"}, {"Content": "Keeps crashing on ZTE Zmax Pro running Android 6.0.1. Would be great if it wasn't so buggy.", "Numbers": "50", "Date": "September 11, 2017"}, {"Content": "Even flakier than the previous version, crashing all the time", "Numbers": "51", "Date": "September 13, 2017"}, {"Content": "Constantly crashes on start. Renders it unusable", "Numbers": "52", "Date": "September 15, 2017"}, {"Content": "It keeps crashing on HTC One M9+", "Numbers": "53", "Date": "September 16, 2017"}, {"Content": "Crashes every time I use it", "Numbers": "54", "Date": "September 15, 2017"}, {"Content": "App used to be great. Since update it crashes every time you switch focus away from the app without being inside a convo. Have to restart, potentially multiple times, to get it to stop crashing back to home screen when attempting to open a conversation.", "Numbers": "55", "Date": "September 8, 2017"}, {"Content": "This app became garbage after this last update. Unstable across the board and more vulnerable than ever. Enduring 40+ crashes a day. Go use signal until it's stabilized or if they add 2FactorAuthentication.", "Numbers": "56", "Date": "September 9, 2017"}, {"Content": "Absolutely useless. Wickr fails to log in 9 out of 10 times, it crashes all the time and its even crashing when I don't have the app open at all. You guys seriously ruined Wickr with this new update. Not recommended at all. Switching to signal as it actually works. Thanks for nothing.", "Numbers": "57", "Date": "September 8, 2017"}, {"Content": "New update has made the app become useless, won't sign in and if I do manage to it crashes every time I try to read a message. What a waste of an app. Everything worked fine before this update.", "Numbers": "58", "Date": "September 4, 2017"}, {"Content": "Used to be 4/5 with a few bugs but now its really bad, logging in 15 times beacuse of constant crashes, you're able to see chats when prompted to login for about 1 second, worst privacy", "Numbers": "59", "Date": "September 6, 2017"}, {"Content": "Ruined a great app. Doesnt notify me when new messages come in, and crashes all the time. Why havent you fixed it yet?", "Numbers": "60", "Date": "September 5, 2017"}, {"Content": "New update renders the entire app useless. Pitted with bugs and glitches. I'm struggling to log in and if I'm lucky enough to get past that stage, it'll most likely crash.", "Numbers": "61", "Date": "September 3, 2017"}, {"Content": "POS.. constantly crashes.. now says suspended... And contact admin. With no way to contact admin. Junkie messenger, lost all my communications. Horrible.", "Numbers": "62", "Date": "September 8, 2017"}, {"Content": "New update is horiffic. Can't message friends that haven't updated and keeps crashing. Why wreck a good thing?!", "Numbers": "63", "Date": "September 3, 2017"}, {"Content": "Use to be a great app. Now it crashes all the time and struggles to login. Goodbye to a great app", "Numbers": "64", "Date": "September 7, 2017"}, {"Content": "Please fix keeps crashing im using lg g3", "Numbers": "65", "Date": "September 7, 2017"}, {"Content": "I really liked this app until the latest update...now it crashes every time I get a message. I have tried uninstalling and reinstalling and it still crashes. I'm trying to bear with it until these bugs get fixed, but it literally crashes every time i open the app and every time I get a message, the app unexpectedly has to close and restart. This is just a little more than ridiculous...please get this fixed! It was just fine before the update and I've had nothing but problems since.", "Numbers": "66", "Date": "August 29, 2017"}, {"Content": "This app is HORRIBLE do not use it. I have been using it for 3 years and this update they did a few weeks ago is the worst ever! The app crashes every time. I have family traveling abroad in the morning so I'm glad I checked this app tonight..its garbage. Now I have to find a new app tonight and learn it and then teach them before they fly in the morning. I recently sent a message to wickr telling them their \"suppprt\" is embarrassing and to remove the option. I see they did that because there is no way to message them now. The file shredder option is gone too and so is the voice recorder option. These need to come back ASAP. This app has gotten so bad since the CEO Nico Sell left a few years back. Skip this trash.", "Numbers": "67", "Date": "August 30, 2017"}, {"Content": "new update crash after sending any msg. it logs automatically in, even its disabled. no general setting for autodestruct. huge steps back regarding security! please fix it or lose all users...", "Numbers": "68", "Date": "August 24, 2017"}, {"Content": "EDIT: ok so it’s not so bad, I actually like it. But there are still a few big oopsies, namely stuff like erratic auto login, and the screenshot thing. I also wish self-destruct and burn on read were the same amount by default... I’m not usually one to complain on big updates, I understand there’s a lot that goes into the changes. But this update really is 2 steps backward. Agree with the sentiment of another commenter; old app felt safe, this does not. Wickr was unique for its features over Signal or its ilk and now those are compromised, notably auto logout, and especially burn on read. Without those, even if slightly inconvenient or “uncool” for new users, this is just another E2EE flashy messaging app. Guys, please consider reverting back at least the features (the new look is good), because that and ONLY that are what set wickr apart. Oh and yes, it STILL crashes.", "Numbers": "69", "Date": "August 24, 2017"}, {"Content": "ADDITIONAL REVIEW: Wickr has done two \"updates\" since the forced update on 8/12. Not sure what has changed to improve the app, it still sucks! The forced update completely destroyed a good app. Developers, please read the reviews and listen to the users. PLEASE ROLL BACK TO PREVIOUS VERSION!! I wish I could leave zero stars! This update is horrific! Most of the changes suck and removes privacy! • Screen shots should not be permitted. •Using the app with my phone in landscape positioning is no longer possible. •Not being able to crop or edit a picture is unthinkable. •Not being able to send a video longer than 5 seconds is ridiculous. Plus, it needs to be an in app option, like a taking a pic. •Not being able to remain logged in stinks. You have no option to remain logged in. •App still crashes!! •Why does the notification display who the message is from?? No good! •New messages shouldn't open all at once when receiving multiple messages from one person. The timer starts immediately on all messages! •Need to be able to select a notification sound and not have to use my device's default sound. •Why must it vibrate when a new message is received?? Not quiet! •The timer options of message destruction are a joke! There's 10 seconds, 1 minute and 10 minutes plus longer ones. How about something inbetween 1 and 10 minutes?? •The previous version may have crashed all the time but it was better than this garbage. •ROLL BACK TO THE PREVIOUS VERSION!!", "Numbers": "70", "Date": "August 25, 2017"}, {"Content": "Since the update, this application continues to crash on Android. I've reinstalled, cleared dalvik cache, etc to no avail...", "Numbers": "71", "Date": "August 24, 2017"}, {"Content": "New update is super buggy. Keeps crashing whenever trying to send a message.", "Numbers": "72", "Date": "August 24, 2017"}, {"Content": "New update sucks crashes all the time and screen constantly loads and freezes", "Numbers": "73", "Date": "February 1, 2018"}, {"Content": "Crashing Crashes since the last update", "Numbers": "74", "Date": "August 28, 2017"}, {"Content": "Unlike most, I prefer this so far. Wickr always looked ugly and crashed. It definitely looks better, I'll see how it works. Big problem, thiugh--I see no option to turn off notification sounds. I'm either blind, or someone was just insane for not offering that.", "Numbers": "75", "Date": "August 17, 2017"}, {"Content": "Good update wickr. Crashes on launch this app has been amazing. Until 4:16pm on August 15, 2017... After reinstalled it worked for a few hours. Then same error occured. Again reinstalled and fixed it. We will see how long it works again. The app itaelf is useful and I like it. These crashes are tiresome.", "Numbers": "76", "Date": "August 17, 2017"}, {"Content": "Crashes every time I attempt to tske a photo. No video options. Now allows receiver to take screenshots, definitely not secure any more. I would prefer to go back to the original version", "Numbers": "77", "Date": "August 17, 2017"}, {"Content": "The newest update ruined the app. EDIT: It crashes as soon as I press the app icon. This happens both on my XCover 2 and Huawei Mediapad.", "Numbers": "78", "Date": "August 17, 2017"}, {"Content": "seems pretty secure, but everything has it's weakness. crashes a lot, but recovers very rapidly after self restart. one missing feature (maybe I just haven't found it again in the settings) with the latest update - custom sound notification! my alerts sound just like every other default alert. need to add feature again if missing. interface kinda sucks, but it's pretty functional once you can find things.", "Numbers": "79", "Date": "August 20, 2017"}, {"Content": "Complete rubbish!!!! Use to be OK. Then the updates made it so unstable that it crashed all the time. Other end didn't receive messages and so on....... I mean all the time. Well now I can't even contact my friends if they have not updated the app.", "Numbers": "80", "Date": "August 17, 2017"}, {"Content": "Crashes a lot. Before the update i would never get notifications even though notifications were turned on in both setting for the app and my phone settings. Since the new update i cant even open the app. Keeps saying the app keeps stopping.", "Numbers": "81", "Date": "August 17, 2017"}, {"Content": "New update is really bad was nothing wrong before crashes a lot dont get notifications when I should and need to bring back manual secure shreds asap!!", "Numbers": "82", "Date": "September 2, 2017"}, {"Content": "Love The idea but after update keeps crashing making the app unusable. And also feel it can use more colours in ui", "Numbers": "83", "Date": "August 22, 2017"}, {"Content": "App worked great until new update, now keeps crashing... hopefully another update to fix this soon or will be losing a lot of downloads", "Numbers": "84", "Date": "August 16, 2017"}, {"Content": "This app was good for private messaging. Now I don't know what to think with the new crash date", "Numbers": "85", "Date": "August 16, 2017"}, {"Content": "No longer works. Crashes shortly after opening", "Numbers": "86", "Date": "August 17, 2017"}, {"Content": "After the update, app just crashes after two seconds of use. Old version was much more stable and from the sounds of it had better features. If its not broken dont fix it Wikr, I would do a roll back because this version needs more testing", "Numbers": "87", "Date": "August 14, 2017"}, {"Content": "Used to be a good app prior to this update. Less control, harder to use, more annoying and crashing more often equal drop the app unless rectified soon. Don't really want to leave the app but this update is so bad I am seriously considering alternatives . Some things I could live with for the benefits but at present benefits are out weighed by the problems", "Numbers": "88", "Date": "August 14, 2017"}, {"Content": "Crashes all the time. Redphone app by snowden is alot better but its not free. Msgs take forever to send and recieve. Might as well just use whatsapp", "Numbers": "89", "Date": "August 15, 2017"}, {"Content": "Update has ruined it. Can no longer communicate with my contacts as they haven't updated. I've had all sort of password issues, and if keeps crashing. Shame, it was good. No longer.", "Numbers": "90", "Date": "August 14, 2017"}, {"Content": "Useless! Constantly crashing. This new version is completely useless. And there is no way to get info to or from Wickr so I'm SOL. It was buggy before, now it is complete trash.", "Numbers": "91", "Date": "August 15, 2017"}, {"Content": "Love the update. Previous version kept crashing on my S8+. Finally have a stable build. And now we can attach memes. My group loves it. Thanks for finally making this worthy of using.", "Numbers": "92", "Date": "August 16, 2017"}, {"Content": "App completely useless since updates.Crashes almost instantly. Please fix!!!", "Numbers": "93", "Date": "August 15, 2017"}, {"Content": "This update crashes more than it did even before. On top of that I can only message one individual at a time and not in groups. Going to try Signal or Telegram now and bring my team of 20 with me.", "Numbers": "94", "Date": "August 15, 2017"}, {"Content": "Crashed after update to v4.0 ...cleans and reinstall doesn't help. Android 4.1", "Numbers": "95", "Date": "August 13, 2017"}, {"Content": "This app keeps crashes before the update amd crashes even more after the update", "Numbers": "96", "Date": "August 14, 2017"}, {"Content": "Update ruined the app, crashes heaps old features were better, doesn't feel like it's as secure as the old version, I recommended this to everyone I know now I wouldn't recommend it to anybody.", "Numbers": "97", "Date": "August 14, 2017"}, {"Content": "This App was Amazing 3 Versions ago\nApp doesn't Crash as much as the last update but am constantly having to re-install now because it doesn't decrypt incoming messages or even receive them about %10 of the time, I am reinstalling this thing to make it work properly at least twice a week. Support is almost never helpful since they take days to reply if they even reply at all.", "Numbers": "98", "Date": "December 15, 2016"}, {"Content": "False security, is not security at all. The developer has ignored the countless reports of bugs and exploits allowing access to a stored private key, and even interception of \"encrypted messages. Ever wondered why it crashes all the time? Most exploits involve crashing the client. This is NOT E2E encryption. I'll stick with open source, and auditable code.", "Numbers": "99", "Date": "June 8, 2017"}, {"Content": "Crashes when opening\nDidn't use to be this way but lately it crashes within seconds of opening. Cant even read a message. Hit the report button, seems to be about as effective as Microsoft error reporting... And yes I've u installed and reinstalled countless times which is a short term fix before the problem resurfaces. No I'm not rooted", "Numbers": "100", "Date": "August 18, 2016"}, {"Content": "Well it's free. And sometimes it works. Other times it crashes, or fails to send messages. It's not uncommon to have to resend your message multiple times before it goes through. Also I don't always get notifications when I receive a message....only sometimes. Fix the bugs and it could be a 4 star app.", "Numbers": "101", "Date": "February 17, 2017"}, {"Content": "App is amazing on apple, pc, everything excerpt android. It's too bad because it's use it on a day to day basis. Problems - can't open incoming messages at least once a day - once it stops decrypting messages it never works until I reinstall - need to reinstall at least once a day - crashes occasionally - no popup notifications on home screen although the do show on drop down menu (blackberry priv)", "Numbers": "102", "Date": "February 18, 2017"}, {"Content": "Only works sometimes. Very inconsistent.\nOlder versions worked better. Sometimes I receive messages and I cannot open them. Can't delete them either. Very frustrating. Sometimes I'll send a msg and check back later to discover it never sent. Also frustrating. They keep updating the UI but it really just needs an overhaul on the actual messaging stuff. Frills don't mean anything If the product is not reliable, and this is definitely not reliable. Oh yeah and it crashes CONSTANTLY....like 20x a day. Would type more but reached limit.", "Numbers": "103", "Date": "January 17, 2017"}, {"Content": "Great but doesn't work on Android The reason I gave 5 stars is because I have it on iOS and Linux desktop and know how great this app is, but it has never worked correctly on Android. I have tried for 2 months now and as soon as I login it crashes every time.", "Numbers": "104", "Date": "September 20, 2016"}, {"Content": "It's okay for a messaging app. Would like to have a read receipt though & a pin for logins so I don't have to type my password all the time. App has been crashing a lot lately too & not sending messages.", "Numbers": "105", "Date": "March 17, 2017"}, {"Content": "Crashes Worked great and now crashes frequently. I receive messages I am unable to open or read which makes a message app kinda useless. How did you destroy something that was working fine as it was? Very close to uninstalling as in current form completely useless.", "Numbers": "106", "Date": "June 2, 2016"}, {"Content": "Could do better. B-\nWhat should be a great app, is spoiled (for me) by a lack of working notifications. No pop ups, no tray notifications, no sound, no vibration. Also, there is a massive lag with message delivery and the messages have to be clicked manually to unlock. Finally, the frequent crashing doesn't help things. The iOS version is almost flawless in comparison.", "Numbers": "107", "Date": "December 15, 2016"}, {"Content": "Absolutely love this app, but I've been having major issues lately. Constantly crashing. Everytime i open it crashes then reopens normally. Also if I turn on ultra power saving. It won't notify me of any messages and I have to reinstall the app. Galaxy S6 edge+ is my phone I use. Hopefully these errors are fixed on the next update or I may have to switch to signal.", "Numbers": "108", "Date": "March 18, 2017"}, {"Content": "Keeps crashing Won't let me open it .. not happy with it... when it did work at times wouldn't let me open messages.. I have Uninstalled and reinstalled it but than lost my account..made new one worked for a few days and now crashes", "Numbers": "109", "Date": "September 14, 2016"}, {"Content": "Won't download properly I' v.e been using Wickr for a few years and have really liked it. I had to reinstall the app a couple days ago and After DL (4g and WiFi) then logging in it freezes...tried 4 times same result...please help", "Numbers": "110", "Date": "September 6, 2016"}, {"Content": "It was good. :-(\nLike others have mentioned this was once very good and reliable. Alas the latest versions have proven to be very crash prone and unreliable. :-( Instant Messaging is now often slow with as many as 8 or more messages suddenly arriving at one time. I still use it but wish they would correct the faults they have introduced.", "Numbers": "111", "Date": "January 3, 2017"}, {"Content": "This app has been great the past year or so. The new update has meant constant crashing if the app/network errors. Gonna see if uninstalling then reinstalling will work. Photos don't load wither which means I am now missing out on seeing photos.", "Numbers": "112", "Date": "August 17, 2017"}, {"Content": "When I works its great, but it tends to be feel buggy. And now, all of a sudden it is crashing constantly, can't add friends, can't send messages. Really, really annoying. Tried reinstalling, tried on different devices all for the same result. Please please fix asap", "Numbers": "113", "Date": "July 18, 2016"}, {"Content": "Mehh\nIf the claims the company makes are credible then it's certainly worth using it. However even with a good internet connection I have constant transmission problems and crashes. I used it over signal because I liked that you don't have to hand out your phone number but I've switched to signal now and it just works worlds better. I didn't want to switch but wickr just didn't work for me.", "Numbers": "114", "Date": "November 19, 2016"}, {"Content": "Wikr review I'm a new user of this application and I like the idea of it but it crashes everytime I open it now. I would like to keep it installed but until this bug is fixed I'll be deleting it. We should be allowed our privacy and you have given us that with this app. It just needs to work properly now.", "Numbers": "115", "Date": "January 17, 2017"}, {"Content": "Good: Secure infrastructure and good for privacy vs. more mainstream messaging apps with privacy or security limitations. Has a desktop version as well. Bad: App crashes frequently (several times per week) and often fails to send or receive messages without any warning or alert.", "Numbers": "116", "Date": "October 10, 2016"}, {"Content": "A great program but the bugs quickly becoming an overwhelming annoyance. Constant crashes, messages not sent or received, not recognizing a valid password at login. I love the app but it seems to become increasingly unstable within days of install. Edit: As I use it I'm growing increasingly frustrated with the increasing amount of crashes. Pretty much useless at this point.", "Numbers": "117", "Date": "February 11, 2017"}, {"Content": "if i could give no stars i would. This app never works well. It crashes all the time and now with the latest update it doesnt decrypt messages. Sort it out wikr because its an amazing concept but needs alot of work", "Numbers": "118", "Date": "February 3, 2017"}, {"Content": "Once Great, Now Abandoned\nThis app used to be awesome. It was smooth and flawless. I'm disappointed at what has happened to it. It's like the developers just packed up their bags and left without a word. Seriously, are they not going to fix messages not sending or receiving half the time? Are they not going to fix constant crashes? It is sad, really, that a once flawless and beautiful app was abandoned. It's been months and fixes haven't been issued. 3 stars because I still have a sliver of hope that the devs will listen and fix it.", "Numbers": "119", "Date": "December 25, 2016"}, {"Content": "Unreliable. Both the Android app and the Windows desktop app are clunky and crash often. Same errors on multiple Android & Win devices, so it's not the device's fault. Needs major stability work. Great concept, poor execution.", "Numbers": "120", "Date": "March 7, 2017"}, {"Content": "Will re-rate in future Great app for its intended use. Would like to see a few ui profiles (dark ui!) A little more stability (crashes, usually when closing). Other than that, great", "Numbers": "121", "Date": "October 17, 2016"}, {"Content": "This app used to be amazing. But now as of 1 hour ago it was fine and I logged in to have it tell me account has been suspended and to contact a system admin. This app is absolutely terrible. Glitches out like crazy every time I use it. Constant reloads and crashing.", "Numbers": "122", "Date": "September 8, 2017"}, {"Content": "I rename this app Crashy McCrash App. I even had a message sent a 01Jan1970. Great programming skill is needed to make something that crashes so much. Of course when you have programmers this bad doing encryption it likely means they are using ROT13, and then messing it up by running the XOR twice. Tox is better, and doesn't crash.", "Numbers": "123", "Date": "April 4, 2017"}, {"Content": "Used to be a lot better. Now, even after restarting phone (up to date Sony Z3C) and re-installing the program it keeps crashing for no reason whatsoever and insists on not notifying on new messages. The problems aren't big, but quite irritating for the end user; one star off for each.", "Numbers": "124", "Date": "July 26, 2017"}, {"Content": "This app constantly crashes. It will not allow me to open messages. I have yo Uninstall then re-install the app several times. Can someone please advise the issue with this.", "Numbers": "125", "Date": "May 2, 2017"}, {"Content": "What the hell?? (Issues fixed) Changed my profile. Now I can't log in 90% of the time. It crashes 9 times out of 10. I won't send my messages 4 times out of 5. I don't get notifications when I receive messages anymore. Had none of these issues before I changed my profile. (Sony Xperia Z3 Compact)", "Numbers": "126", "Date": "August 18, 2016"}, {"Content": "Cant use it. Crash after crash after crash. Uninstall, reinstall and mow it says the password i just made to sign up is incorrect!! I WANT MY USERNAME. and Account functionality", "Numbers": "127", "Date": "March 31, 2017"}, {"Content": "crashes constantly on note 6 edge. have to reinstall everytime it happens because it just won't stop crashing. it was a good app that's why i gave it 3 stars but it sure has problems atm", "Numbers": "128", "Date": "March 3, 2017"}, {"Content": "Android not as good as iOS & Crashes Wikr is a pretty good app, but it's better on iOS. Wikr on Android is missing the ability to check multiple messages if you are manually deleting them. Which means you have to one at a time delete messages. Since the latest Android update the App now crashes when you try to login. Totally unuseable.", "Numbers": "129", "Date": "November 1, 2016"}, {"Content": "I love the idea but it's now an embarrassment Crashing more than ever. Must be ramping up for the corporate version which won't be free. I used to recommend to everyone. I can't even open messages half the time. New phone, fresh updates/downloads and installs. Still behaving very poorly", "Numbers": "130", "Date": "May 8, 2016"}, {"Content": "Great app but requires some updating. I've had multiple crashes and problems with infinite load times logging in which is currently happening. Would very much appreciate an update to try and resolve these issues. Other than that its all around excellent", "Numbers": "131", "Date": "December 9, 2016"}, {"Content": "This is a terrible, buggy, unstable app, literally the worst IM app I've ever used. It loses messages, doesn't notify you when messages arrive, indicates you have messages when there are none, won't let you decrypt messages when they arrive, requires a dozen retries to send out a single message, crashes a lot, it's like something written by a student learning to program as their first ever app. At the moment I'm communicating with friends who have Wickr via SMS, it's that bad. It's actually worse than useless because I have to use unprotected, government-monitored communications because Wickr is so unusable. Avoid this mess and go with something that works like WhatsApp or Signal.", "Numbers": "132", "Date": "June 12, 2017"}, {"Content": "Overall the app is great. It just crashes a lot for me and my friend. Whenever we try to invite each other (add wickr id), it crashes. Awkward.", "Numbers": "133", "Date": "May 25, 2017"}, {"Content": "Im reinstalling this almost daily. It doesnt notify me of messages, sometimes it doesnt send them, or sends them but immediately dissapears on my phone so i dont even know if it sent. Or i cant open something ive recieved. Its crashing daily also. It wasnt to bad in the start but now its getting worse. I love the features just wish i could use it properly", "Numbers": "134", "Date": "March 15, 2017"}, {"Content": "Great app but crash's sometimes on Kali Nethunter Android. Also why no dark theme or night mode so it's easier on the eyes. Or am I just missing where that option is?", "Numbers": "135", "Date": "October 20, 2016"}, {"Content": "Has Started Crashing Nonstop! It was working fine till just recently, and now I can't open it. It won't open at all. Not sure if it's between updates or what, but it doesn't work at this time!", "Numbers": "136", "Date": "October 14, 2016"}, {"Content": "App is completely rubbish!! Keeps on crashing, freezing and messages don't go through but disappear of your screen even after uninstalling and reinstalling several times over the last year or so!!", "Numbers": "137", "Date": "February 17, 2017"}, {"Content": "Horrible on my phone. No notifications, crashes all the time, and I have to manually back out of a chat to refresh it because for some reason it doesn't automatically fetch it. Seems to work fine for everyone else.", "Numbers": "138", "Date": "July 13, 2017"}, {"Content": "App is always crashing on kit kat. Everyone I know complains of constant crashing. Looking for better alternative since they never update.", "Numbers": "139", "Date": "May 3, 2017"}, {"Content": "It crashes all the time and messages fail to send or load, and sometimes end up with incorrect time stamps that put them at the top of the messages where I don't even see them. This was all annoying enough, but now I can't even log in! It says I have a network error and that's bull crap since my connection is fine. I've reinstalled and restarted my phone 1,000 times to no avail. Please fix this.", "Numbers": "140", "Date": "March 8, 2017"}, {"Content": "Wickr used to be good. But not any longer!\nThis app used to work flawlessly. But it just reached the point that it was constant battle of the app crashing, not sending messages, not working correctly. I just reinstalled it today after about a 2 month break and it's crashed at least 10 times, it failed to send at least 5 messages. The worst part is that you don't learn that the message wasn't sent until you log back into the app. I sincerely hope they can get this figured out but it doesn't work well for my Samsung S5.", "Numbers": "141", "Date": "December 17, 2016"}, {"Content": "Great when i can use it but crashes CONSTANTLY! Android platform crashes, that bad its been happenimg for 3 months now to use it i must uninstall then re install", "Numbers": "142", "Date": "October 4, 2016"}, {"Content": "The best Sometimes messages delays, sometimes crashes if I open messages on more then 3 devices at once. But other then that cross platform support and true encryption it's the best.", "Numbers": "143", "Date": "May 12, 2016"}, {"Content": "A good im client but with issues Right now the one issue is the crashing on my phone, heck it \"swolled\" 2 messages and its refusing to bring those back", "Numbers": "144", "Date": "July 19, 2016"}, {"Content": "Good potential, have only been using for a short while but sometimes you have to open and close the app a couple of times so you can view an incoming message. Crashed once so far.", "Numbers": "145", "Date": "January 19, 2017"}, {"Content": "This app crashes as soon as I start it. I've reinstalled several times, then my account got locked when I tried to get in, but I know all the info I typed was correct. Good stuff..", "Numbers": "146", "Date": "July 27, 2017"}, {"Content": "Crashes CONSTANTLY, all day long now. Not only does it crash constantly, messages wont open now. Was a great app in previous versions, but not anymore. Extremely disappointed.", "Numbers": "147", "Date": "March 5, 2017"}, {"Content": "New update worked briefly then stopped. Reset phone and made new account but still gives errors. The previous version also had a lot of bugs that made it crash and otherwise nonfunctional...I don't remember anything like this when I first started", "Numbers": "148", "Date": "September 12, 2017"}, {"Content": "Great app!! Only 4 star because it is crashing 4 times out of 5 on Samsung Galaxy Note 3, phone old a bit but it is still reliable, could you look into the matter pls? Thank you", "Numbers": "149", "Date": "February 12, 2017"}, {"Content": "Crashing Constantly crashes. Everytime I open it on my Samsung s7. No dramas on my iPad though.", "Numbers": "150", "Date": "September 27, 2016"}, {"Content": "Lots of crashing. Also sometimes doesn't send messages, despite of having reliable connection ... And sometimes sends messages with date of Dec 31, 1969. It also needs tablet support. It doesn't work on landscape for tablets like the Pixel C, which is a shame.", "Numbers": "151", "Date": "March 2, 2017"}, {"Content": "Crashes all the time now Still, the best messaging app around! FIX ME!!!", "Numbers": "152", "Date": "December 9, 2016"}, {"Content": "Application keeps crashing and msgs fail to send, you have to kill the app then sign back in to get the msgs sent. It doesn't showing LED notifications either. Keep trying to get an answer but wickr staff never reply. Will change rating when they fix the app.", "Numbers": "153", "Date": "March 11, 2017"}, {"Content": "Simply doesn't work. Crashes on every launch. Unexplained suspensions etc. Avoid.", "Numbers": "154", "Date": "September 8, 2017"}, {"Content": "The app keeps crashing i cant sign in. It says it has stopped working gives me report button but even if i hit it, it just closes the box and doesnt open anything", "Numbers": "155", "Date": "March 19, 2017"}, {"Content": "Definitely would not recommend, app constantly crashes, doesn't allow you to stay signed in (even when I've selected the option for it) and a lot of messages either would not send, or did not get received. If I could give this app 0 stars, I would.", "Numbers": "156", "Date": "April 1, 2017"}, {"Content": "Was good up until a couple updates ago, since then push notifications stopped working, msgs take ages to decrypt/open & the app constantly crashes.", "Numbers": "157", "Date": "February 8, 2017"}, {"Content": "I loved this app, until... Constant crashes and inability to login or get past the ID loading page for email and phone.", "Numbers": "158", "Date": "December 9, 2016"}, {"Content": "Crashes all the time while logging in, now can't open messages, make a proper app or just go do something else", "Numbers": "159", "Date": "July 16, 2017"}, {"Content": "Keeps crashing Used to work great now won't let me activate my account, keeps crashing and can't send messages", "Numbers": "160", "Date": "December 9, 2016"}, {"Content": "Just crashes Can't do anything. Every time I try to add a user, update my info it just crashes or gives me an error", "Numbers": "161", "Date": "November 22, 2016"}, {"Content": "I like the app, but it keeps crashing on me.....not sure why... it didn't use to. Can't even open it today. Using android based BlackBerry.... Please fix! Thx", "Numbers": "162", "Date": "May 28, 2017"}, {"Content": "Good idea sounding. But will not open for me just keeps crashing. I'll come back to it. It does spindle like one I want", "Numbers": "163", "Date": "May 25, 2016"}, {"Content": "Constantly crashing After update the app crashes all the time. I did as suggested... uninstalled, reboot phone and reinstall 2 times. Still crashes on opening.", "Numbers": "164", "Date": "December 9, 2016"}, {"Content": "Stopped alerting me of new messages almost immediately. When I open it it crashes most of the time and I have to open it again.", "Numbers": "165", "Date": "March 4, 2017"}, {"Content": "This app sucks!! Crashes all the time and many message do not get sent. This is a joke. Installed in a brand new Android phone", "Numbers": "166", "Date": "July 21, 2017"}, {"Content": "Some bugs, now with improved constant closing and crashing\nDuring a chat I wasn't able to unlock any locks and we had to stop the chat. Also if you have 2 devices logged in, the other will pickup all incoming text unless you blog in/out. This has been an issue from day 1. UPDATE: Now constantly crashing with errors and shows dates way back. And signing me off constantly.", "Numbers": "167", "Date": "October 21, 2016"}, {"Content": "App crashes every single time I search for a user; have not been able to send one message yet.", "Numbers": "168", "Date": "July 9, 2017"}, {"Content": "Gee lets see: its gone to hell, management doesn't update or improve it, buggy as the Amazon, crashes constantly. Yep. Soup kitchen Special: hot as hell.", "Numbers": "169", "Date": "February 6, 2017"}, {"Content": "Constant crashes, wont send messages, i cant even log in anymore due to \"network errors\". This app sucks now", "Numbers": "170", "Date": "March 9, 2017"}, {"Content": "When will you guys fix this app for Android platform users? All it does is crash after every message.", "Numbers": "171", "Date": "July 13, 2017"}, {"Content": "Won't even open.! Since the last update the app won't even open. Keeps crashing. Love the app so please fix this problem", "Numbers": "172", "Date": "September 25, 2016"}, {"Content": "Unusable. Crashes constantly and when it doesn't I recieve messages with day long delay", "Numbers": "173", "Date": "January 19, 2017"}, {"Content": "On my Samsung Note 5 running Android 7.0 (Nougat) this app is CONSTANTLY crashing; even more than ever before on earlier versions of Android. In an attempt to fix it, I uninstalled the app, cleared the device cache via Android's Recovery Menu, and then reinstalled the app. Unfortunately, now I cannot add back my known Wickr contacts because the app crashes EVERY time it starts to search for any of them. Thus, rendering this app useless. I emailed support so we'll see what happens. I don't have high expectations since this app does not get many updates from the development team :-(", "Numbers": "174", "Date": "April 27, 2017"}, {"Content": "This app continuously crashes and so really can't use it more than 1-2 texts if that", "Numbers": "175", "Date": "February 17, 2017"}, {"Content": "App was great, but it's starting to crash and malfunction far more often now. I wish that it was still being actively developed.", "Numbers": "176", "Date": "April 14, 2017"}, {"Content": "App constantly crashes and I don't get notifications when new messages arrive. I guess I'll still to wire", "Numbers": "177", "Date": "August 13, 2017"}, {"Content": "You broke a great app Constant crashing?. Now worthless", "Numbers": "178", "Date": "December 16, 2016"}, {"Content": "Video not working on main cam When trying to record video with main camera app freezes and crashes. Further to the above no updates since March clearly they are not monitoring feedback from the play store.", "Numbers": "179", "Date": "November 23, 2016"}, {"Content": "Keeps Crashing It keeps crashing again & again when you open it. Hardly stays 20 sec open", "Numbers": "180", "Date": "July 19, 2016"}, {"Content": "Been using wickr for years, however, it has been crashing alot more than usual, ive has to Uninstall it and reinstall the app about 4 or 5 times now since the update, can you please revert back to the old versions please 👌", "Numbers": "181", "Date": "March 9, 2017"}, {"Content": "This app used to be flawless, now it just constantly crashes. I no longer recommend", "Numbers": "182", "Date": "February 11, 2017"}, {"Content": "I've never gotten push notifications in the 8 months that I've been using this. Now the app constantly crashes and does not keep me logged in when I changed the settings to remember me for 1 day.", "Numbers": "183", "Date": "March 23, 2017"}, {"Content": "Crashes a lot. Oneplus One.. Several crashes just before signing on, crashes at email input, crashes at contacts import", "Numbers": "184", "Date": "April 22, 2017"}, {"Content": "Works fine on my LG g4 but on my note 4 crashes every time I try to add someone or view account info...I love app but these issues are making me hate it.", "Numbers": "185", "Date": "May 24, 2017"}, {"Content": "It only works part of the time. 10% of my messages are never sent. No idea how many I'm not receiving. Also logged me out and was very difficult getting back in. Crashes frequently.", "Numbers": "186", "Date": "July 23, 2017"}, {"Content": "Was OK at one point Messages constantly not being sent as of latest update. Need to close app, re open then tap resend. Crashing like a coked out drunk in Daytona 500. Not what u want to see in an app whereas security is priority. Bugs = exploits", "Numbers": "187", "Date": "December 20, 2016"}, {"Content": "The latest version doesn't give me a notification when I receive a message. It randomly crashes even when I don't have it open in the background or haven't opened it in days.", "Numbers": "188", "Date": "March 17, 2017"}, {"Content": "Good app. But lags crashes and sucks", "Numbers": "189", "Date": "March 18, 2017"}, {"Content": "The app can be as secure as carving the message into a stone slab using ancient Assyrian glyphs, but it still crashes constantly. Bye.", "Numbers": "190", "Date": "March 8, 2017"}, {"Content": "Wickr has gotten worse and worse with every new release, to the point to where it's virtually unusable. It constantly crashes, randomly closes down, and it's not on app I can depend on anymore.", "Numbers": "191", "Date": "March 8, 2017"}, {"Content": "It keeps crashing. Not even worth it anymore. What's the point if it doesn't work. Been with them sense day one but now a serious android update is needed.", "Numbers": "192", "Date": "April 29, 2017"}, {"Content": "Crashes since I have downloaded again doesn't notify of new message and troubles opening, please fix !", "Numbers": "193", "Date": "February 16, 2017"}, {"Content": "Had this app for a while, but now i can't send, recieve or even log in. It worked great about a year ago, but there are a lot of bugs with it crashing every day and the above issues", "Numbers": "194", "Date": "March 29, 2017"}, {"Content": "Crashing I installed aand reinstaled the app after I log in it crashes'and also it crashes my phone and i need to restart it.wicker suporrt not working.", "Numbers": "195", "Date": "November 13, 2016"}, {"Content": "App keeps crashing. Heavy users will face 20+ crashes a day", "Numbers": "196", "Date": "February 7, 2017"}, {"Content": "Always crashing now I can't login with my original account and I can't make a new one because it tells me I'm not connected to the internet. Fix this please.", "Numbers": "197", "Date": "December 9, 2016"}, {"Content": "Good secure app. Some built in smiley would be great. Some built in smiley would be great. Sometimes crashing and not able to send messages", "Numbers": "198", "Date": "July 18, 2016"}, {"Content": "Fix app The app constantly crashes when reloading chat and after two days i got a error saying it cant get transmissions.", "Numbers": "199", "Date": "January 18, 2017"}, {"Content": "Crashing constantly/can't view messages The app crashes about every hour and now I can't unlock any messages.", "Numbers": "200", "Date": "October 8, 2016"}, {"Content": "Cool idea, but it's slow and crashes constantly. Fix it and I'd give it 5 stars.", "Numbers": "201", "Date": "January 26, 2017"}, {"Content": "Crashing too often, even during login. Android 7.1.1 on Nexus 5X", "Numbers": "202", "Date": "January 30, 2017"}, {"Content": "Why there is no new updates form so many months app keep crashing in every 1-2 min did developers forgot they have a app name wickr", "Numbers": "203", "Date": "March 10, 2017"}, {"Content": "Works consistently well. Crashes every now and then. Great app, thats all", "Numbers": "204", "Date": "January 19, 2017"}, {"Content": "Works but sudden xrsshrs Kyocera metro phone. When I take a pic if freezes phone sometimes", "Numbers": "205", "Date": "July 30, 2016"}, {"Content": "Crashes everytime Can't even send messages sometimes. What a waste of space it has become on my phone.", "Numbers": "206", "Date": "December 23, 2016"}, {"Content": "Doesn't work well on my android phone. Freezes my phone a lot. Not happy with it.", "Numbers": "207", "Date": "June 22, 2017"}, {"Content": "Crashes Too many crashes and unexpected errors,please fix it,after i will give 5 stars.", "Numbers": "208", "Date": "November 10, 2016"}, {"Content": "Does nothing but crash, but some paranoid people insist on using it", "Numbers": "209", "Date": "July 17, 2017"}, {"Content": "Disgustingly buggy and unstable Constant crashes, often takes forever to update messages. Just unreliable", "Numbers": "210", "Date": "December 9, 2016"}, {"Content": "great concept, was an excellent app at 1st ....has been crashing a few times a day now, plus I have numbers next to several names saying I have messages that hv not been opened?? (this has been like that for months) I've tried everything to fix including re installing with no luck!!?!", "Numbers": "211", "Date": "April 13, 2017"}, {"Content": "It crashes constantly. Need a fix otherwise great App.", "Numbers": "212", "Date": "January 31, 2017"}, {"Content": "I cant even open it anymore. Its just constantly crashing.", "Numbers": "213", "Date": "July 4, 2017"}, {"Content": "Crashes constantly for no apparent reason. Couldn't find a fix. Google Pixel XL/android 7.1.2", "Numbers": "214", "Date": "May 27, 2017"}, {"Content": "It crashes at signup and login on two new phone. Never once has this all worked for me.", "Numbers": "215", "Date": "June 1, 2017"}, {"Content": "App crashes all the time, it basically doesn't work", "Numbers": "216", "Date": "March 16, 2017"}, {"Content": "Crashing App keeps crashing as soon as I log in 😕", "Numbers": "217", "Date": "June 6, 2016"}, {"Content": "Man sometimes it crashes. Rest all is awesome.", "Numbers": "218", "Date": "April 15, 2017"}, {"Content": "Like the app. But crashes too much App crashes way too much.. Very annoying", "Numbers": "219", "Date": "November 3, 2016"}, {"Content": "Keeps crashing and logging me out after 5 secs ....Very poor app", "Numbers": "220", "Date": "January 28, 2017"}, {"Content": "Wickr is CONSTANTLY crashing and misbehaving, using it is a constant battle, terrible app", "Numbers": "221", "Date": "March 28, 2017"}, {"Content": "It's crashing all the time. I used to like this app!", "Numbers": "222", "Date": "March 31, 2017"}, {"Content": "It does NOT notify me when I receive a msg and after todays update, the app crashes before even opening. Running on Galaxy Note 2.", "Numbers": "223", "Date": "May 23, 2018"}, {"Content": "Keeps crashing EVERY time I open it!", "Numbers": "224", "Date": "May 7, 2017"}, {"Content": "It keeps crashing man..seriously fix this problem for higher rating!!!", "Numbers": "225", "Date": "January 13, 2017"}, {"Content": "Can't even add a contact without the app crashing.", "Numbers": "226", "Date": "March 22, 2017"}, {"Content": "crashed about 50 times in 10 minutes (not kidding)", "Numbers": "227", "Date": "January 12, 2017"}, {"Content": "Keeps crashing. No notifications about new messages. Unstable.", "Numbers": "228", "Date": "June 13, 2017"}, {"Content": "Crashes about half the time but good enough for what is needed from it.", "Numbers": "229", "Date": "April 21, 2017"}, {"Content": "Not showing me notifications and crashed all the time.", "Numbers": "230", "Date": "July 7, 2017"}, {"Content": "Crashes, doesn't notify new messages, always an issue", "Numbers": "231", "Date": "October 11, 2016"}, {"Content": "Crashed again Have to uninstall and reinstall during conversation", "Numbers": "232", "Date": "November 5, 2016"}, {"Content": "Cant send audio clips without it crashing Keeps crashing", "Numbers": "233", "Date": "October 30, 2016"}, {"Content": "Crashing Great app but now it's crashing every time I open it. Nothing works.", "Numbers": "234", "Date": "November 28, 2016"}, {"Content": "Can't find people without the app crashing", "Numbers": "235", "Date": "June 30, 2017"}, {"Content": "It keeps crashing and doesn't open msgs", "Numbers": "236", "Date": "May 12, 2017"}, {"Content": "Waste of time. App just crashes constantly", "Numbers": "237", "Date": "April 11, 2017"}, {"Content": "cant add anyone with out it crashing useless", "Numbers": "238", "Date": "March 10, 2017"}, {"Content": "I want to like it but it is constantly crashing!!", "Numbers": "239", "Date": "November 4, 2016"}, {"Content": "Always crashes, can't use it at all.", "Numbers": "240", "Date": "June 27, 2017"}, {"Content": "Down goes Wikr! Down goes Wikr! Fix the crashes & bugs.", "Numbers": "241", "Date": "March 9, 2017"}, {"Content": "This crashed whenever I add a contact", "Numbers": "242", "Date": "May 21, 2017"}, {"Content": "worst app ever crash in every second", "Numbers": "243", "Date": "November 29, 2016"}, {"Content": "Crashes all the time. Makes it useless.", "Numbers": "244", "Date": "March 2, 2017"}, {"Content": "Crashing Why dies it continuously crash", "Numbers": "245", "Date": "September 22, 2016"}, {"Content": "App crashes too much... Aggravating", "Numbers": "246", "Date": "February 21, 2017"}, {"Content": "crashes never got to use it because it crashes all the time", "Numbers": "247", "Date": "December 3, 2016"}, {"Content": "Great, does crash sometimes but that's mainly due to failed data delivery not a bug", "Numbers": "248", "Date": "January 28, 2017"}, {"Content": "Too many crashes since update", "Numbers": "249", "Date": "August 15, 2017"}, {"Content": "Keeps crashing. Cant even use it.", "Numbers": "250", "Date": "August 5, 2017"}, {"Content": "Used to be good, now it crashes all the time. #wasteoftime", "Numbers": "251", "Date": "May 20, 2017"}, {"Content": "Great for getting in touch with friends but unfortunately doe's crash a lot.", "Numbers": "252", "Date": "May 24, 2017"}, {"Content": "App kept crashing repeatedly", "Numbers": "253", "Date": "July 27, 2017"}, {"Content": "Crashes on Android 6 x86", "Numbers": "254", "Date": "January 6, 2017"}, {"Content": "It just crashes constantly", "Numbers": "255", "Date": "January 8, 2017"}, {"Content": "App constantly crashes.", "Numbers": "256", "Date": "August 4, 2017"}, {"Content": "Always crashing and messing up", "Numbers": "257", "Date": "January 17, 2017"}, {"Content": "Good app but crashes once a month and requires reinstall.", "Numbers": "258", "Date": "September 25, 2018"}, {"Content": "Buggy software Love the features but crashes too often", "Numbers": "259", "Date": "December 9, 2016"}, {"Content": "Latest update makes it crash pretty much every day", "Numbers": "260", "Date": "March 8, 2017"}, {"Content": "Was good, update causes crash and no notifications", "Numbers": "261", "Date": "June 8, 2017"}, {"Content": "This app hasn't been updated in a year. Messages frequently aren't sent and it crashes on the reg.", "Numbers": "262", "Date": "March 28, 2017"}, {"Content": "crashes all the time", "Numbers": "263", "Date": "July 19, 2017"}, {"Content": "Always crashes hate it", "Numbers": "264", "Date": "February 28, 2017"}, {"Content": "Keeps crashing suddenly", "Numbers": "265", "Date": "March 4, 2017"}, {"Content": "Crashes constantly.", "Numbers": "266", "Date": "January 18, 2017"}, {"Content": "Great app loves a crash thou", "Numbers": "267", "Date": "October 29, 2016"}, {"Content": "crashing consistently", "Numbers": "268", "Date": "March 9, 2017"}, {"Content": "Always crashing", "Numbers": "269", "Date": "March 8, 2017"}, {"Content": "Constantly crashing", "Numbers": "270", "Date": "March 8, 2017"}, {"Content": "Crashes a lot", "Numbers": "271", "Date": "August 14, 2017"}, {"Content": "No screenshots and crashes a lot", "Numbers": "272", "Date": "March 8, 2017"}, {"Content": "Crashes continuously I had high hopes for this app. But it crashes more often then not. It tells me I have a message and I can't open it. Maybe in a year or so it might be worth having an other shot", "Numbers": "273", "Date": "March 28, 2016"}, {"Content": "The Point is why its great Sure it crashes sometimes, it a complex application I'm sure. but the ability to have private messaging in a time where everything we do on our phones is recorded is one of the greatest things. Thanks to the Wickr team for giving us more freedom!", "Numbers": "274", "Date": "January 11, 2016"}, {"Content": "Great app for those of us who want some confidentiality. Love the idea and promise of the developers of true privacy and confidentiality of data involved in the use of this app! The app crashes 80% of the time I open it so 4 stars for that. I can always restart the app and retrieve my messages immediately thereafter. Hopefully this gets fixed. Note5.", "Numbers": "275", "Date": "February 1, 2016"}, {"Content": "I give up: UNINSTALLED\nUpdate: I give up. The most basic programming task is to build an app that doesn't crash. Over a year of daily use I haven't seen that you guys have done even that. So why should I be assured that you're capable of doing harder things, like crypto. I haven't seen the kind of progressive improvements to the basics that would justify my assuming you're doing the other stuff right. [Update 5/8/2016] Notifications have now stopped altogether. Are you guys tanking this service on purpose now that the boss left?", "Numbers": "276", "Date": "June 3, 2016"}, {"Content": "Great, but.. Having a bad time with notifications not appearing, app silently crashing, general not receiving of messages until I close and reopen app. Lastest update made it way worse.", "Numbers": "277", "Date": "January 4, 2016"}, {"Content": "WELL... It's great, when it works! I've had no end of issues lately. Messages don't arrive, then 10 will come at once. The app crashes often, and the skin will change to black text on a black background, can't do anything, need to restart. Please fix? I was using the Samsung Galaxy s4", "Numbers": "278", "Date": "November 23, 2015"}, {"Content": "Love it but... Crashed every once in a while but now having trouble with notifications not coming through. Still, they'll fix it im sure so still gets 5 stars, you need this ap!", "Numbers": "279", "Date": "August 30, 2016"}, {"Content": "What's wrong I used to love it. Even freezes a lot. Since middle of November I can't even open it. I've uninstalled 3 times. Today I tried again and is not opening. Shows the stop message.", "Numbers": "280", "Date": "December 10, 2015"}, {"Content": "Error When Logging in This app used to be great, although how private can your messages really be? But now all it does is crash with an error message, this app is now deleted from my phone.", "Numbers": "281", "Date": "November 25, 2015"}, {"Content": "Great app, crashes infrequently Great application just found it crashes randomly which can be frustrating", "Numbers": "282", "Date": "December 27, 2015"}, {"Content": "Go figure won't download on new phone Can't even download on s7, app crashes and fails to message constantly.", "Numbers": "283", "Date": "April 27, 2016"}, {"Content": "Best of a bad bunch Crashes constantly. Unreliable. Often doesn't say when you have messages waiting. To mix things up, also tells you there are messages when there aren't. I've emailed support, but no fixes. I can't wait for a reliable alternative, that's just as secure.", "Numbers": "284", "Date": "September 16, 2015"}, {"Content": "Evaluation grade to C minus.Regret to Report and concur the application crashes. Results and status are uninstallation of the app on Android . wickr. was a superior product. Example is James Bond self destructing nature of the messages.", "Numbers": "285", "Date": "February 11, 2017"}, {"Content": "Free for a reason Have always had problems with constant bugs and crashes. Now with the last update my password won't work so I get to start a new account....love this app!", "Numbers": "286", "Date": "October 21, 2015"}, {"Content": "Really want to give 5 stars I like this app allot. Needs maintained better. I'd pay! Crashes continuously and is very unreliable. Used on various devices with same results.", "Numbers": "287", "Date": "October 29, 2015"}, {"Content": "Crash and bugs Crashed immediately on the first run and list of contracts was a big mess with each contact repeated many times. Tried this app long time ago and it didn't improve anything. Still very bad.", "Numbers": "288", "Date": "November 6, 2015"}, {"Content": "Can be frustrating, but still 4 🌟 The app will 'freeze up'from time to time, and messages received are unable to be downloaded. The logo just keeps coming up. In this instance, one can only delete the app and reinstall. Very frustrating.", "Numbers": "289", "Date": "November 14, 2015"}, {"Content": "Crashes often Great, but not stable on android or mac book.", "Numbers": "290", "Date": "November 20, 2015"}, {"Content": "Shame Crashes regularly and does weird things. Not reliable at all!", "Numbers": "291", "Date": "September 7, 2015"}, {"Content": "God app but.. Crashes all the time. Hangs. And you can't turn off all notifications.", "Numbers": "292", "Date": "September 6, 2015"}, {"Content": "Used to work great Nice one guys nothing like an update to ruin a good thing now it crashes my whole phone everytime genius move chaps samsung note 4", "Numbers": "293", "Date": "August 11, 2015"}, {"Content": "Poor This app is terrible, at least on Android. Messages often fail to send followed by the app freezing and crashing. Often get message saying Wickr has stopped working or Wickr has stopped responding. Tried re-instaling but made it worse.", "Numbers": "294", "Date": "August 25, 2015"}, {"Content": "Useless This app had gotten worse and worse with each successive update. It now freezes and crashes every single time I open it to view a message. It is slow and fails to give notifications. I will absolutely be looking for an alternative.", "Numbers": "295", "Date": "August 7, 2015"}, {"Content": "Was a great app. The recent \"update\" made it so I can't get notifications even when I want to. And it crashes 50% of the time during login. Please fix.", "Numbers": "296", "Date": "July 27, 2015"}, {"Content": "Crashes Keyboard Enabled Phones Crashes on keyboard phones upon opening the keyboard, consistently.", "Numbers": "297", "Date": "August 5, 2015"}, {"Content": "this has worsen previously it was good but after updates it crashes a lot...has worsen..", "Numbers": "298", "Date": "August 8, 2015"}, {"Content": "Crashes frequently, notification bugs, lags phone", "Numbers": "299", "Date": "June 20, 2015"}, {"Content": "So far so good. Been doing what it says. Haven't had a crash or a hung message yet. Voice messages are cool just don't use the google keyboard. Well test more may get five stars. Got to research it some more too. Just noticed one, where is the document feature that is described?", "Numbers": "300", "Date": "May 2, 2015"}, {"Content": "Poor quality app\n1. Extremely buggy. Crashes, delayed messages, undelivered messages, bugged notifications. So the code quality is very poor - how can anyone say the rest is secure with that little attention to details. 2. \"Undelivered\" messages will stay in your history forever unless you remember to manually delete them. 3. Can't even change your password. For an that has \"secret\" in it's name it's just preposterous. Totally and absolutely unacceptable. So it's basically unusable at the moment.", "Numbers": "301", "Date": "May 5, 2015"}, {"Content": "This app sucks! Keeps crashing. its closed source so we don't even know its actually encrypted like they say it is. I cant make encrypted calls with it. Signal is way better.", "Numbers": "302", "Date": "December 9, 2016"}, {"Content": "Needs some tweaks Messages freeze, are out of order,or not recieved at all. Would like to know when the message is read.", "Numbers": "303", "Date": "May 1, 2015"}, {"Content": "Good concept, very poor execution\nWickr offers military grade encryption with memory shredding, which are key to true software security. I am not an expert, just an advanced amateur, but the security level of Wickr is impressive. I also liked the idea how the Wickr Team designed the technical background, it suggests good professional practice. On the other hand, the implementation and user experience are terrible. Messages are often lost, not synchronized among devices, there are regular hickups with connection, etc. (with a reliable, high speed European service provider). Opened messages are still stuck as unopened (red lock). The linux desktop client (v2.2.2) crashes 2 times out of 3 runs, but there are regular crashes and hangups with the Android app too (v.2.4+). All these issues were reported to the Wickr Team months ago. The constant sync problems, the crashes and the really bad user experience render the app almost unusable. Just to illustrate my point: there are only 2 of us left from a group of 7, and noone is really convinced that we should continue using the app. Would I recommend? Only if you are a masochist or has no other alternative (which I am looking for).", "Numbers": "304", "Date": "May 10, 2015"}, {"Content": "Android version keeps crashing Note 3 keeps crashing. Please fix", "Numbers": "305", "Date": "May 8, 2015"}, {"Content": "Freezes too much Constantly freezes and have to close reopen", "Numbers": "306", "Date": "May 17, 2015"}, {"Content": "Not good\nApp black screens a lot. Then Then have to Force Stop the application, which causes me to have to log back in; even though I saved my password. Lots of crashes too, which also makes me lose my session, then I have to log in again. Don't like how it has to refresh to post new messages in my private/group chats. Also I don't like having to click a message to decrypt it. Why can't the app do so automatically. I think TextSecure is way better for an app that uses data and is encrypted", "Numbers": "307", "Date": "March 25, 2015"}, {"Content": "Good app but unstable Love the app. Its a little basic or lacking a nice interface however it does everything it says it does. Works well most of the time with an occasional crash / freeze. Nothing serious but stability could be improved.", "Numbers": "308", "Date": "April 18, 2015"}, {"Content": "Crashy This app seems to lock up and/ot crash daily. I like being able to change time settings but wish it was more reliable. Sometimes it says there is a message but nothing appears :-/", "Numbers": "309", "Date": "April 14, 2015"}, {"Content": "How about giving a app that doesnt crash every 2 mins Thos is a fu@×ing joke. And u tell me its secure. Yeah right", "Numbers": "310", "Date": "March 27, 2015"}, {"Content": "When it works its good Constant crashes and issues. Sometimes I have to restart the whole phone for it to clear the problem. I'll continue to use it but I hope they work on the stability", "Numbers": "311", "Date": "March 23, 2015"}, {"Content": "Minor bugs but great Works great! But when I try to take a picture in-app it crashes. Nexus 5 Android 5.0.1 rooted stock ROM", "Numbers": "312", "Date": "March 1, 2015"}, {"Content": "Works most the time, but.... Other times it will crash or tell me i have messages and then when i go into the contact to view the message there's nothing there. Needs improvements!", "Numbers": "313", "Date": "March 20, 2015"}, {"Content": "It crashes. When i click on any contact or when i close the dialog box for that contact. Please fix. I really need this app to improve.", "Numbers": "314", "Date": "March 14, 2015"}, {"Content": "Needs Windows Phone version. Slow. Crashes all the time.", "Numbers": "315", "Date": "March 12, 2015"}, {"Content": "Self Destructs Alright.... This guy just keeps crashing on my Verizon Samsung S4. Once messages get too long it'll bog down as well as loose internet connectivity. Crashing whenever I try to access it after a session times out. I want to use your app guys, but seriously..the struggle is real.", "Numbers": "316", "Date": "December 25, 2014"}, {"Content": "Keep on crashing I've downloaded this 15 minutes and it has crashed 3 times", "Numbers": "317", "Date": "December 28, 2014"}, {"Content": "Don't always get notifications. Currently the app crashes every time I open it.", "Numbers": "318", "Date": "December 12, 2014"}, {"Content": "Great app but... After the update when im sending a message with emoji the app crashes.", "Numbers": "319", "Date": "December 5, 2014"}, {"Content": "So many bug and crash You cant get video from other person or you cant send. When you try app crashes", "Numbers": "320", "Date": "November 6, 2014"}, {"Content": "Crashes Multiple times daily", "Numbers": "321", "Date": "October 29, 2014"}, {"Content": "Crashes a bit with my S5, but awesome", "Numbers": "322", "Date": "October 3, 2014"}, {"Content": "Too many erros Great app but wayy to may errors. It freezes up and locks me out at least 25-35 times a day. Super annoying!", "Numbers": "323", "Date": "September 19, 2014"}, {"Content": "Love it Secure, self-destructing messages. No problems with app, ever. It's never do much as crashed on me.", "Numbers": "324", "Date": "September 22, 2014"}, {"Content": "Crashes when returning from lockscreen The interface is ok could use a tidy up. Would like the option to set notification as a led flash and not just a vibrate. Been having numerous app crashes. 10 in 4 days. My phone is even suggesting to remove the app because of instabilities and battery consumption. On a Galaxy S6", "Numbers": "325", "Date": "September 16, 2015"}, {"Content": "Good messaging app if you want things private. Unfortunately it tends to crash a lot and many messages wont send. Logging in usually doesnt work which is really annoying. I recommend this app only for legal reasons or if you are in fear of being watched. This app is far too annoying to deal with for anything else.", "Numbers": "326", "Date": "April 16, 2015"}, {"Content": "This is by far the buggiest app I've ever used. You can't do anything on it without it crashing. It is extremely unreliable and therefore extremely frustrating to use. If they fixed some of the bugs it would be a decent app.", "Numbers": "327", "Date": "July 14, 2017"}, {"Content": "This app was perfect up until it became \"Wickr Me\". Does anyone know of a quality alternative ? Its actually gotten to the point where Wickr has become un-useable (too many crashes, message failures, notifications failures, every single use).", "Numbers": "328", "Date": "July 3, 2018"}, {"Content": "Cool Everything has been working great, untill today. Crashes, force closes, no contacts, back to back . If i even get past the sign in menu . Each time it quits, its like signing in for first time", "Numbers": "329", "Date": "December 9, 2016"}, {"Content": "Unstable and crashing constantly now, error messages for every option. Uninstalled for good. Pointless as I cant receive incoming messages", "Numbers": "330", "Date": "March 17, 2017"}, {"Content": "Recent upgrade has turned s great app into a joke. Crashes constantly and in andriod message field obscurred by the pop up keyboard. Plus theyve removed ability to record and send sound file. Poor now", "Numbers": "331", "Date": "August 14, 2017"}, {"Content": "App is unusable on my alcatel tablet after the update. I'm able to sign in but then the app crashes every couple of seconds. Have tried uninstalling and reinstalling and rebooting device and many other steps but have been unable to get it to work at all. App won't even stay open long enough to view contacts, open settings, view message or anything before it crashes. Tried contacting support but it's been 5 days with no response. Before update this app worked flawlessly for me now I'm forced to use something else.", "Numbers": "332", "Date": "August 24, 2017"}, {"Content": "Registration was cumbersome. Tried the app for a few weeks, crashed on open really often. Signal is far more stable.", "Numbers": "333", "Date": "September 9, 2017"}, {"Content": "Buggy Constant crashes, not getting notifications and then it keeps telling me my password is wrong! I know it's not unless it allows you to log in with multiple passwords because that one works on my pc", "Numbers": "334", "Date": "May 17, 2016"}, {"Content": "Worked flawlessly for a couple of days but then started to crash every time I opened it. Developer team should really look into the issue.", "Numbers": "335", "Date": "February 14, 2018"}, {"Content": "This app is shockingly bad. It crashes constantly and now I can't click on anything at all the screen might as well be a photo. Terrible", "Numbers": "336", "Date": "February 6, 2018"}, {"Content": "Keeps Crashing! All in all a great app, but on the odd occasion that I need to use it, it just keeps crashing?", "Numbers": "337", "Date": "October 29, 2016"}, {"Content": "After coming new message in my phone the software crashes instead of loading the message.... Please do fix these problem without this its a great app u have made... Thank you", "Numbers": "338", "Date": "October 12, 2015"}, {"Content": "Keeps crashing. Won't open messages. I've uninstalled, restarted, reinstalled numerous times & it will work for a couple of messages then same problem! The messages that I couldn't open are no longer there when I get back in. Really frustrating since you say the problems have been fixed. Far From!!", "Numbers": "339", "Date": "April 3, 2017"}, {"Content": "Have installed and uninstalled app 5 times. Crashes every time with error messages. Rubbish...", "Numbers": "340", "Date": "August 26, 2017"}, {"Content": "The app is totally useless after the update. It crashes 99% of the time now.", "Numbers": "341", "Date": "July 19, 2016"}, {"Content": "FIX THE BUGS App constantly crashing; messages don't open; fix by uninstall and reinstall app... Please fix the bugs already!", "Numbers": "342", "Date": "July 23, 2016"}, {"Content": "Not at all working on nexus 5 Not syncing the messages properly. Does not show the message. Too much slow. Crashes frequently. Worst app.", "Numbers": "343", "Date": "March 25, 2015"}, {"Content": "Was good until last update from provider Crashes on the constant... :(", "Numbers": "344", "Date": "November 29, 2016"}, {"Content": "Crashes all time and hangs also please resolve these problems other wise nice app", "Numbers": "345", "Date": "September 15, 2015"}, {"Content": "It keeps crashing on both Android 6 Phone (Nexus) and Windows PC.", "Numbers": "346", "Date": "September 19, 2016"}, {"Content": "Always Crashing Had to uninstall and reinstall several times.", "Numbers": "347", "Date": "February 22, 2016"}, {"Content": "Won't let me unlock messages. Crashes often", "Numbers": "348", "Date": "May 26, 2016"}, {"Content": "A pile of trash of a user experience. All its good for is crashing.", "Numbers": "349", "Date": "January 29, 2017"}, {"Content": "Used to be great. Now it crashes continuously", "Numbers": "350", "Date": "October 30, 2017"}, {"Content": "Shredder crashed my rooted phone.", "Numbers": "351", "Date": "December 28, 2016"}, {"Content": "Great app. Freezes every now and then but privacy is great.", "Numbers": "352", "Date": "November 7, 2017"}, {"Content": "Crashes flat out !!! V annoying", "Numbers": "353", "Date": "May 26, 2017"}, {"Content": "Liked it at first..now it crashes daily..sometimes don't get the messages", "Numbers": "354", "Date": "October 6, 2016"}, {"Content": "Its good but it crashed alot", "Numbers": "355", "Date": "October 13, 2017"}, {"Content": "Crashes under marshmallow", "Numbers": "356", "Date": "February 22, 2017"}, {"Content": "Full of bugs Doesn't stop crashing and constantly cannot open messages", "Numbers": "357", "Date": "December 9, 2016"}]