[{"Content": "Great app! You have tons of flexibility especially if you go for the paid version. Very good features and it works without any crashes or slow downs", "Numbers": "1", "Date": "December 14, 2018"}, {"Content": "crash in samsung j6", "Numbers": "2", "Date": "January 25, 2019"}, {"Content": "Using this app for 2 months. Now try to have the option to restore it from existing backup but it did not worked out. Every time app crashed with this feature", "Numbers": "3", "Date": "June 18, 2018"}, {"Content": "Great UI. Smooth functioning. Does not crash. I am satisfied with the app. Good job developers.", "Numbers": "4", "Date": "May 22, 2018"}, {"Content": "Excellent for simple day to day expense tracking and budgeting. I'm a student with a part time job so this is very helpful to me. Functionality is 10/10 -- works perfectly, never crashed or had any ad pop-ups that I can remember of, and any tool I needed it had :)", "Numbers": "5", "Date": "March 15, 2018"}, {"Content": "Error when exporting to file. Crash report send to support. Never replied! Fustrated and switched to different app. Get this fixed so I can migrate my data.", "Numbers": "6", "Date": "November 25, 2017"}, {"Content": "I backed-up my files in old device but whenever I try to restore the back up, the app would crash and cannot restore the backup. Help! :(", "Numbers": "7", "Date": "December 1, 2017"}, {"Content": "When I'm trying to restore my data the app crashes.", "Numbers": "8", "Date": "December 6, 2017"}, {"Content": "HORRIBLE! I paid for the app and after I paid, it crashed every time I try to open it! I have tried to get my money back from Google and they tell me to contact the programmer. I try to contact thr programmer and get automatically directed back to the page to download the app! I am so angry! I want my money back for this waste of my time !! Found a much better app instead", "Numbers": "9", "Date": "October 27, 2017"}, {"Content": "Idea of program is very good but it is badly maintained. It crashes often and after upgrading to android 8 it now always crashes while exporting to file. I sent report of crash multiple times and nothing happened. Downgrading my rating to 2 stars.", "Numbers": "10", "Date": "October 28, 2017"}, {"Content": "I bought the premium version of this app and it keeps crashing. When I re open the app after a while the numbers are all reset to 0.00. I'm very disappointed as I did like how it worked. I just wish I could get a refund :(", "Numbers": "11", "Date": "September 24, 2017"}, {"Content": "App crashes when exporting tot file", "Numbers": "12", "Date": "October 3, 2017"}, {"Content": "It ia an amazing app. It never crashed on my device and it is very stable. I never purchased Monify pro because I never needed it.", "Numbers": "13", "Date": "October 7, 2017"}, {"Content": "App is getting crashed suddenly When I clicked on a category the app is getting crashed.", "Numbers": "14", "Date": "December 29, 2016"}, {"Content": "Love it Been using this app for months. Very reliable. Hasn't crashed. Easy to use.", "Numbers": "15", "Date": "January 10, 2017"}, {"Content": "CRASHES WHEN IMPORTING DATA! WORST APP ON THE APP STORE. DO NOT DOWNLOAD. YOU WILL LOSE ALL YOUR DATA AND IMPORT DOESNT WORK. AUTHOR SUPPORT IS NON EXISTENT!!!", "Numbers": "16", "Date": "August 23, 2016"}, {"Content": "Loved it I have tried many others apps but this is the very best for me. Never crashes, always smooth. It's awesome. Keep the good work!", "Numbers": "17", "Date": "September 24, 2016"}, {"Content": "Useful app, but crashes often", "Numbers": "18", "Date": "September 4, 2016"}, {"Content": "It's good but current version crashes Ive been using this and i like the colorful interface which makes a tedious chore cheerful. But current version keeps crashing and I can't input anything for past few days. Please fix.", "Numbers": "19", "Date": "April 16, 2016"}, {"Content": "Back-Up not working Would be okay, but I cannot restore my things from the backup! When I try to the app crashes :(", "Numbers": "20", "Date": "May 13, 2016"}, {"Content": "App crashed for month of feb when I set starting date of the cycle to 30th. Please fix this. Lost all the data.", "Numbers": "21", "Date": "February 28, 2017"}, {"Content": "Gr8 app but need help for data trf frm old device to new Gr8 app.. I switched to new mobile and want to get all the old data to new device. All data backup and restore option failed. Moreover monefy crashed in new device...!!", "Numbers": "22", "Date": "April 12, 2016"}, {"Content": "Good App with Neat UI Crashes some times, and full screen ads annoying. Other than these love it. Need an option to group expenses, say for a trip.", "Numbers": "23", "Date": "April 12, 2016"}, {"Content": "Love it\nI really love the app.. HOWEVER I have one problem at the moment, how do I delete an account? I tried the 'manage accounts' section but there's nothing there about deleting an account. Please get back to me on how to do it cause it's killing me! Okay I just rated this app and now I can't open it. Keep saying app crashed and prompting me to send report - which I did. Help! I'm lost without my accounts! :(", "Numbers": "24", "Date": "February 29, 2016"}, {"Content": "Application crashed - Runtime exception App is not opening . seeing exception when I launch the program", "Numbers": "25", "Date": "March 1, 2016"}, {"Content": "Lacks features, pretty but confusing interface\nMain page buries what you need to know - under a mess of what you don't. (Get rid of giant category icons here please. Graphs of where your money went is for the END of the month not every day!) Account balances is tiny text - make THAT a chart please! How much you have left is important! No re-occurring income/expenses = time wasted. No sub categories means you never truly can track your spending, know where $ goes, or set a budget for each category - so important for planning. App crashes a lot.", "Numbers": "26", "Date": "February 5, 2016"}, {"Content": "Update After previous 2 updates it crashes on my GS7. I reported it but still crashes", "Numbers": "27", "Date": "April 14, 2016"}, {"Content": "As promised Nice apps. Fast response on crash. Recommended.", "Numbers": "28", "Date": "December 12, 2015"}, {"Content": "Dear developer, After Updating (or not I forget), when I open the app, it gives me an Error Log (staktrace), instead of just crash the whole app. I tried to send the log by email but with the address given below, I can't send it. Pleas fix immedietely", "Numbers": "29", "Date": "December 11, 2015"}, {"Content": "App has crashed and it appears months of data has been lost. Help! It crashed AFTER it updated automatically!", "Numbers": "30", "Date": "December 10, 2015"}, {"Content": "Getting crashed I'm using one Plus two and it's getting crashed every time I open it", "Numbers": "31", "Date": "November 30, 2015"}, {"Content": "Best budget management Very easy to use. The best budget management apps i have tried sp far. No complain no crash and easy to export out to view in excel.", "Numbers": "32", "Date": "November 11, 2015"}, {"Content": "Really nice and intuitive app. Super easy to use, user friednly. I have only one problem - Htc M8 is crashing when operations like change the category for an expense is done and the ads are coming in. I dont mind the ads but they crash the app really often on my phone.", "Numbers": "33", "Date": "September 22, 2015"}, {"Content": "Attempting to restore from file crashes app I like this app quite a lot but I switched phones and am attempting to restore from a file. However, each time I try, the app crashes. Please fix.", "Numbers": "34", "Date": "September 14, 2015"}, {"Content": "It keeps crashing on my galaxy s3 And I almost paid for the pro", "Numbers": "35", "Date": "August 20, 2015"}, {"Content": "Problem restoring from backup I take backup to sd card, copy the file to cloud. Then access the file from cloud on another phone. When try to restore, the app crashes and when I open again, nothing has been imported.👿", "Numbers": "36", "Date": "October 7, 2016"}, {"Content": "Keeps deleting my data, restore crashes! Useless", "Numbers": "37", "Date": "April 2, 2018"}, {"Content": "App crash when try to restore data from the backup file", "Numbers": "38", "Date": "September 25, 2017"}, {"Content": "final update crashed my records!", "Numbers": "39", "Date": "January 11, 2018"}]