[{"Content": "This was an excellent app but now it crashes every non and then and is unable to make stats.. Please fix that bug", "Numbers": "1", "Date": "September 2, 2018"}, {"Content": "The app has been crashing a lot since the last update. It was very reliable, but something in this new update does not work well with pixel phones apparently.", "Numbers": "2", "Date": "January 31, 2018"}, {"Content": "App works well, love everything about it especially simplicity. I definitely recommend it. Crashes stopped after restarting my tablet.", "Numbers": "3", "Date": "February 8, 2018"}, {"Content": "Please fix the timer! I just take a second to go browse something and the app crashes, i paid for this!", "Numbers": "4", "Date": "October 1, 2017"}, {"Content": "The app keeps crashing when it's minimised or the phone is locked", "Numbers": "5", "Date": "October 21, 2017"}, {"Content": "Really good app... just a little problem. The app is way to inefficient. Makes my bluetooth crash, my Oneplus 2 gets all buggy. Had to uninstall... hope later on this problem gets fixed.", "Numbers": "6", "Date": "December 21, 2016"}, {"Content": "Need improvements need to keep the screen active all the time otherwise it crashes(i assume it crashes because the app closes). Update. I was unable to report because it closes in the background. I have a huawei p8 lite. I will change rating once fixed. Cheers", "Numbers": "7", "Date": "November 13, 2016"}, {"Content": "Good app, helps focus\nI really appreciate all the features built into the app, like the ability to micromanage sound, that really take it beyond simple time keeping. Its never crashed on me, and the only suggestion I would offer is to replace to time \"slider bars\" with a \"Rolodex style\" time selection (such as in iOS) because the bars are sometimes hard to choose what you want in one try. regardless, a very well made and useful app.", "Numbers": "8", "Date": "September 3, 2016"}, {"Content": "Current version crashes on start-up The app crashes as soon as a fire it up. Je suis le sad :(", "Numbers": "9", "Date": "September 6, 2016"}, {"Content": "No statistics! Crashes every time I open stats. Please fix it. Otherwise it's an amazing tool.", "Numbers": "10", "Date": "February 7, 2016"}, {"Content": "Simple, Easy to use\nI find the persistent notification helpful and the buttons on it useful. I find the UI in the app to be attractively simple. Stats farther out than a day would be helpful but just nice to have. (Weekly totals are OK, but I'd like to see daily stats for 7 days back). (Also, reinstalling the app fixed the crashes it was experiencing on startup.)", "Numbers": "11", "Date": "December 21, 2015"}, {"Content": "Garbage, Can't even run, App is not starting, Crashes, something prevent app from starting!.", "Numbers": "12", "Date": "February 26, 2017"}, {"Content": "It would be useful if it won't crash that often", "Numbers": "13", "Date": "January 13, 2019"}]