[{"Content": "I like this app very much. Great interface but... Widget is a real problem. It freezes. I set this app to autostart but whenever i clear the memory of running apps widget stops working. I want to point out there are many countdowns on Google store but i only having problems with this one.", "Numbers": "1", "Date": "July 9, 2018"}, {"Content": "Would be 5 stars if the widget worked properly. Widget freezes a lot. When trying to delete and reput the widget on, it sometimes turns completely blue with all the numbers at 11. Widget seriously needs some work on it, the rest is great.", "Numbers": "2", "Date": "March 17, 2018"}, {"Content": "Excellent app. for those who are facing trouble with app getting freezed when they clear memory - Try locking the app from getting killed in recent apps window. It can be a work around. Although it will be good if developer address this issue in next updates.", "Numbers": "3", "Date": "July 20, 2018"}, {"Content": "Nice app, but doesn't work properly on tablet devices such as Pixel C or Galaxy Tab S3. Upon trying to open the Settings, it just crashes. This prevents me from restoring my purchase to disable the ads. Hope this is being fixed soon. Also, the app frequently enforces portrait mode while the device is held in landscape mode. Totally annoying!", "Numbers": "4", "Date": "November 27, 2017"}, {"Content": "Great app but when i open the settings menu it crashes", "Numbers": "5", "Date": "January 1, 2018"}, {"Content": "I paid to upgrade and add my own pictures. Now the app won't open. It just crashes over and over. What a waste of $1.99... *Update* I uninstalled and reinstalled. It works, but now it wants me to pay again for premium access. I already paid once!!! *Update* Reinstalled purchase. Now it started crashing again. Totally useless. Where is my refund?!?!?!?!? Please do not ask me to email support. I already did and am waiting for a reply.......", "Numbers": "6", "Date": "February 9, 2017"}, {"Content": "I love the app, but for some unknown reason it started to crash immediately when I open it, and the widget doesn't work.",

  "Numbers": "7", "Date": "February 18, 2017"}, {"Content": "Nice graphics, crash issue It's a decent countdown app with good background art, but whenever you try to share the image, the app just crashes.", "Numbers": "8", "Date": "June 11, 2016"}, {"Content": "It is really good. Has a lot of potential. It crashes each time I want to share tho and would like to see option to add own or more choice of images for each countdown.", "Numbers": "9", "Date": "April 11, 2016"}]