[{"Content": "I love this app and it had been a while since I since I used it. Even got the the subscription service. When I tried it last evening though it kept crashing for me. 8.1 with January security update on Pixel XL here. Tried reinstalling and resetting all permissions, randomly crashes at different points. Couldn't even get the nap session to start. What is happening? It worked perfectly on 8.0...", "Numbers": "1", "Date": "April 27, 2018"}, {"Content": "Consistent problems trying to download, had to install 4 times before even getting it to fully download on my phone. Crashed my phone each time I tried to\"delete apps\" to make room even though I had plenty of space available. Maybe I'll change this review once I get it to work.", "Numbers": "2", "Date": "May 7, 2018"}, {"Content": "The best sleep assist I've ever used, nap time is efficient and feel refreshed. Nighttime I crash before 5 mins is out.", "Numbers": "3", "Date": "April 8, 2018"}, {"Content": "Crashes everytime I try to open it!", "Numbers": "4", "Date": "April 5, 2018"}, {"Content": "Raised my rating because upgrading to a Motorola Z2 Force fixed the crackling issue. Nevertheless, I have noticed a couple of other bugs with the latest version of the app: 1) The first time I hit play after firing up the app for the night, Pzizz inevitably freezes, crashes, and returns to the Sleep/Nap/Focus screen. It works fine if I hit then play again. 2) If I change an option in, say, the Dreamscapes menu and then hit the Android back button (or Moto swipe gesture) instead of the app's built-in back-arrow button, the chosen option does not register in the Settings menu. Also, the shuffle option does not appear to be persistent: it must be reselected every time a dreamscape is started.", "Numbers": "5", "Date": "November 26, 2017"}, {"Content": "Long time user. Recently, it began crashing. Not sure if it was the update or what. Otherwise, it's awesome.", "Numbers": "6", "Date": "September 8, 2017"}, {"Content": "Love it when it works, but It keeps crashing. It's the opposite of relaxing to turn it on and have to keep turning it back on again and again, hoping it will actually stay on and not crash.", "Numbers": "7", "Date": "January 10, 2017"}, {"Content": "Sleep audio stops, crashing whole app\nWhen I first started using pzizz, I noticed the audio drop out for long periods of time in the sleep module, and the sudden silence would actually wake me up! Then, last night, whatever makes the audio cut out completely crashed the app, so that the alarm didn't go off. Unfortunately there was no opportunity to send a crash report, but this issue seems to have been around for a while.", "Numbers": "8", "Date": "October 16, 2016"}, {"Content": "Just tried this out for a snooze and the app crashed on waking, at least I assume that is what it was. There was a continuous peeping like a fledgling had fallen out of its next. Using this on Lenovo Yoga2", "Numbers": "9", "Date": "December 16, 2016"}, {"Content": "Good but.. Crashes my Oneplus 2 when it gets to the alarm.", "Numbers": "10", "Date": "October 28, 2016"}, {"Content": "Keeps crashing after 10 minutes and ends up being more of a distraction", "Numbers": "11", "Date": "February 23, 2017"}, {"Content": "It isn't working, appears to have crashed. Uninstalled and reinstalled - still stopped working", "Numbers": "12", "Date": "April 16, 2016"}, {"Content": "Hang in generating sound and then crashed", "Numbers": "13", "Date": "April 15, 2016"}, {"Content": "Works for me I have 10 min power nap every lunch time, 20 min when have more time (usually fall asleep then). Changing duration is simple and I like the voice. It focuses your mind to easily relax. But when using the sleep mode either phone (samsung) or the app crashed", "Numbers": "14", "Date": "September 24, 2015"}, {"Content": "It's great don't get me wrong But there are massive gaps between sections of music/sound effects that make me think the app has crashed or something, not what I wanna be thinking about while trying to clear my mind haha", "Numbers": "15", "Date": "January 7, 2016"}, {"Content": "Wonderfully, Subtly Different Every Time\nI tried this out on the recommendation of an author that I follow on social media. I was skeptical in the beginning, but after several uses, I've been able to see the little differences that show up in the soundtracks the app generates for the different sleeps. I've even been able to salvage a five AM crash and get a decent rest using the app. Sometimes, I'll be there wondering at how nice the music is just before I'm out like a light...", "Numbers": "16", "Date": "February 8, 2016"}, {"Content": "Stopped Working I'm running a Galaxy S6 on Sprint. Tried clearing app data, removing and reinstalling, but the app still crashes when selecting a listening mode. I liked it when it did work. Please fix.", "Numbers": "17", "Date": "August 19, 2015"}, {"Content": "I just downloaded this yesterday Every time I open it. It crashes.", "Numbers": "18", "Date": "August 10, 2015"}, {"Content": "Crashes on my Nexus 7 before opening", "Numbers": "19", "Date": "November 5, 2017"}, {"Content": "So happy for this! I use this app for lil naps when I'm working overnight so I won't crash during the day.", "Numbers": "20", "Date": "August 18, 2015"}]