[{"Content": "Hello Developer. This app is the best novel creator I've seen so far. It's very simple and it has everything I need. However, once I compile my novel through EPUB3, the output itself crashes when imported into an ebook reader. It creates a note on the topmost page of my novel and it says \"This page contains the following errors:error on line 254 at column 303: Entity 'nbsp' not defined Below is a rendering of the page up to the first error\". I could have given you a rate of 5 stars if it didn't happen. Above all, I love your app☺", "Numbers": "1", "Date": "December 14, 2018"}, {"Content": "I'm sure this app would be great if I could open it, but every time I try it crashes.", "Numbers": "2", "Date": "May 25, 2018"}, {"Content": "Thank you for this app, I love it! It's easy to use and navigate. I also loved exploring the options behind the controls because there's more to it beneath the surface! The metadata is a great feature as well as the tabs you can customize.I just love how I can fill it in without being choked by rigid templates and options that give me writer's block. May I just recommend that can you please put a note or something that tells the exact size for the cover photo? Though I already had figured the size out by trial and error in editing my pictures; the ratio is about 3:4 of Pinterest pictures if I remember correctly. I just want that small dialogue to be added for other users' benefit. Overall the app is great and there's a lot more to explore in the Outline and Organize section which I have scarcely checked out yet. The app is working smooth and I had never encountered lags or crashes. I just had problems when losing newly added texts in the metadata, but that's entirely my fault as I always forget to click save. Thank you so much for this app! It's a big help to a broke student like me who can't pay for app purchases. God bless you always and keep up the good work!", "Numbers": "3", "Date": "May 6, 2018"}, {"Content": "An extremely nice app for writers. Crash problem is very common. So pls solve it.", "Numbers": "4", "Date": "February 8, 2018"}, {"Content": "Worse than a game that alaways crashes", "Numbers": "5", "Date": "May 1, 2018"}]