[{"Content": "Works like advertised. Except keeps crashing when I scroll down the list to exclude apps.", "Numbers": "1", "Date": "December 29, 2018"}, {"Content": "I bought the pro version of this thinking it would perform as good or better than the built-in Google tool (Digital Wellbeing) and it's not. It doesn't track accurately, and doesn't refresh the stats until I go into one of the menus and then back abain, and when I scroll the list of apps to omit from tracking, it crashes the app. I'm only giving it 2 stars because I see the potential and want it to be better.", "Numbers": "2", "Date": "October 12, 2018"}, {"Content": "Love the concept, and the app generally works as intended, but it crashes every time I try to exclude apps. This means that navigation and music streaming apps count against my phone usage, which makes this app far less useful.", "Numbers": "3", "Date": "October 8, 2018"}, {"Content": "Great potential and a fine app but I've found it quite buggy - crashing and/or it not tracking time properly. Would also be great to have a clock to have a widget on lock screen to clearly show usage over the day.", "Numbers": "4", "Date": "September 1, 2018"}, {"Content": "This is a great concept! But the app kept crashing in the Exclude apps menu every time I scrolled passed the apps starting with an I. Reinstalling the app didn't fix the issue. This glitch makes you have inaccurate statistics.", "Numbers": "5", "Date": "August 11, 2018"}, {"Content": "This app interrupt every 10mins while I m on another app. This causes the opened app to either crash or freeze for some time.", "Numbers": "6", "Date": "March 12, 2018"}, {"Content": "A good app does what everything it says but pease ** RESPOND TO THIS ** Because when i try to turn on focus mode my app crashes -i am using a Samsung Galaxy Tab 3 lite- -Happened when i tried to turn on focus mode and the tablet responded with a crash message- And please i want to get it fixed right away ** RESPOND**", "Numbers": "7", "Date": "February 19, 2018"}, {"Content": "When it works right, it's wonderful. I've cut my wasteful use down from over 4 hours/day to under 1.5 in just days. That said, it still has a lot of problems. The widget must be removed and replaced each day, the app often crashes when paused, and achievements don't stick. I look forward to the updates.", "Numbers": "8", "Date": "October 24, 2017"}, {"Content": "Super Very nice interface. Though something it's crashing but very rare. Otherwise it's a perfect application to get rid of from phone addiction.", "Numbers": "9", "Date": "October 4, 2017"}, {"Content": "AWESOME It did everything I needed it to and it never crashed.", "Numbers": "10", "Date": "November 30, 2015"}, {"Content": "Must for everyone :) Very good app to monitor your mobile usage... Accurate nd timely reminders helps me to curtail my time spent.. Makes me think twice before using anything useless.. Doesn't slow me phone nd no crashes ...", "Numbers": "11", "Date": "June 16, 2015"}, {"Content": "Makes you think about your usage Definitely caused me to think about the number of times I pick up my phone. App seems unintrusive and runs fine: no crashes or problems.", "Numbers": "12", "Date": "June 16, 2015"}, {"Content": "After update app keep crashing", "Numbers": "13", "Date": "July 1, 2014"}, {"Content": "Crashes Galore Love the concept but it crashes all the time and resets your stats. Havent made it two days in a row without the app failing and resetting.", "Numbers": "14", "Date": "July 22, 2014"}, {"Content": "Really wanted to like this app but found that it tracked my behaviour without actually impacting it. AppDetox is closer to the more heavy-handed approach I need but had its own issues. As did apps that showed a floating timer but didn't do much either. May revisit the app a year from now but, for now, it Additional notes: the app crashes anytime I tried to open the whitelist. Additionally, the use of 'settings' pages mixed with cogs, wrenches, side menu and subpages made the app needlessly complex. Devs really need to sit down and figure out what they actually want the app to do, the mechanisms to do so, and, once they have a more coherent vision, build an app experience around that.", "Numbers": "15", "Date": "December 6, 2018"}, {"Content": "Crashes every single time I try to add apps to the \"exclude\" list so it doesn't count usage of things like my GPS while I'm driving. Without this function, the app is pretty useless.", "Numbers": "16", "Date": "January 15, 2019"}, {"Content": "Crashy slo poke Good in concept, but made my phone slow and crashy.", "Numbers": "17", "Date": "April 4, 2015"}, {"Content": "If you use maps or music in your car while driving better buy premium if you don't want to crash while dissmis this app notification in not an appropriate time", "Numbers": "18", "Date": "July 26, 2018"}]