[{"Content": "The google drive feature doesn't work on my phone. It crashes when I try to connect my google drive.", "Numbers": "1", "Date": "December 8, 2018"}, {"Content": "First, don't be fooled into thinking this app is saving everything as you go along. It isn't like Word. It crashed on me and I lost about three paragraphs. Not the end of the world but a serious nuisance nevertheless. I like iA writer, especially its simplicity, but my work should be retrievable if it crashes. Like others, I would be happy to pay for a more professional and secure writing environment which protects everything I have written in the event of a crash.", "Numbers": "2", "Date": "July 31, 2018"}, {"Content": "I've been consistently writing in the Android version of iA Writer on a Chromebook for the past two months, and I've been really, really pleased with its performance. Like, drop-dead impressed. It's a \"full\" iA Writer experience right here on the Chromebook. It looks great, feels great, works great. I'd previously been a devotee of iA Writer for Mac and iOS, but I drifted away once I started also using a PC. When I realized how great iA Writer is on Android, I immediately sought out and purchased the slick PC version as well. Thanks to the excellent Dropbox support, I can now switch between iOS, Mac, PC, and Chromebook with ease (and, knocking on wood now, with zero crashes or other tragic \"accidents\"/losses). I'm really grateful to find true \"platform agnoticism,\" even as the software still maintains the elegant \"Apple-minded design\" it first became so known for. There's no clutter here. It's still the best, most serene writing environment, superficially simple but with enough deep features (word count, \"focus mode,\" markup, etc) that any diarist or blogger won't be left wanting.", "Numbers": "3", "Date": "August 6, 2018"}, {"Content": "Keeps on crashing on me, for no reason at all. All my notes and stuff are here, and now I can't even view anything!", "Numbers": "4", "Date": "February 27, 2018"}, {"Content": "App crashes... I'm assuming it's related to the file size limit - app couldn't load a large markdown file. I would not recommend this app due to this limitation. It tells me the app isn't meant for serious work, even though it's marketed as such.", "Numbers": "5", "Date": "October 21, 2017"}, {"Content": "No letter-by-letter auto-saving? A beautiful app that is a joy to use. But for that during one session it abruptly crashed. When reopened, hours of my typing had been lost w/o chance of recovery. Occasional crashes would be acceptable if there were a constant auto-saving feature, or if such were functioning properly. But despite how nice the app is, the stress of not knowing when I'll lose hours worth of writing, or of the obsessive saving needed to allay that fear, defeats the idea of \"focused writing\".", "Numbers": "6", "Date": "March 25, 2017"}, {"Content": "Crashed five minutes into use, nothing was saved, bit too much of a trust issue to keep using if I have to ctrl-S between every sentence.", "Numbers": "7", "Date": "May 1, 2017"}, {"Content": "Very unstable It crashes frequently, which deletes unsaved writing. It spams me with notifications of it crashing multiple times a day, even when it's closed and i haven't opened it in days. I'll change my rating back to 5 stars when it's fixed.", "Numbers": "8", "Date": "December 3, 2016"}, {"Content": "You should make sure that the files get saved in a folder internally so that if the apps crashes or say the phone's read ahead doesn't work, the files don't get lost or something. I can't seem to find the folder at all, if at all you've incorporated it...", "Numbers": "9", "Date": "February 20, 2017"}, {"Content": "Renamed a folder and now my app crash-loops.", "Numbers": "10", "Date": "January 26, 2017"}, {"Content": "Copy paste... Crashes the application. You should add fonts too...", "Numbers": "11", "Date": "July 15, 2016"}, {"Content": "One Star for NO WAY TO SAVE FILE! If there was a way, it is not showing. Only to export the file. Something like this that is not that intuitive and lacks a great WYSIWYG mode, is not for me. Also crashes a lot with Google Drive. Unable to read Google Docs documents.", "Numbers": "12", "Date": "October 10, 2018"}]