[{"Content": "Really love this app. I've been using it for over a year and it's a great way to remind yourself to take pills and complete routine tasks throughout the day. It's a very stable and reliable app. No crashes, no bugs, no ads. Wish all apps worked this well. Thanks Habit Tracker.", "Numbers": "1", "Date": "January 27, 2019"}, {"Content": "Been using it for a few week now, your app is an excellent helper to improve my laziness ^^ cant wait for u to develop for ios and would to have sync up account....last update got app crashed problem", "Numbers": "2", "Date": "September 11, 2018"}, {"Content": "Not working since last update. Crashes and widgets dont work. Literally unusable.", "Numbers": "3", "Date": "February 21, 2019"}, {"Content": "PROS- Practical without the pimped-out pointless fluff. PULL- Additional widget features give it the edge over the competition. CONS- A few crashes with the widgets on home screen (unable to disable habit) Nothing too detrimental , usually a phone restart fixes it.", "Numbers": "4", "Date": "July 18, 2018"}, {"Content": "Hey , Unfortunately it crashes in mi redmi note 4. Pls can you fix this. Or provide me a soln", "Numbers": "5", "Date": "January 2, 2018"}, {"Content": "I imported my Rewire data and then it just crashes on me. Can't use it at all.", "Numbers": "6", "Date": "February 7, 2018"}, {"Content": "Good design but crashes constantly", "Numbers": "7", "Date": "January 7, 2018"}, {"Content": "So many goofld & helpful This is very good app on Android device and so much helpful because of charts and diagrams...but some crash accure in my phone (htc one E8)... Pleads fix it", "Numbers": "8", "Date": "October 19, 2016"}, {"Content": "SUGGESTION - STREAK FREEZE There's this feature on the language app Duolingo called a Streak Freeze. It's a feature that has been heavily been the reason why I have been learning for over 300 days. I would strongly recommend you look into it and try to find a way to implement it.", "Numbers": "9", "Date": "July 31, 2016"}, {"Content": "Probably the most important app on my phone This app makes it so simple to figure out if you are doing the things you want to be doing. Do I wish it had a web interface to match? Sure, but it's not strictly necessary. The app has never crashed and does the job well. I love the statistics for each habit.", "Numbers": "10", "Date": "January 16, 2017"}, {"Content": "Loving it. Just keep crashing lately, need help", "Numbers": "11", "Date": "May 21, 2017"}, {"Content": "Great App but keep crashing", "Numbers": "12", "Date": "February 12, 2017"}, {"Content": "Love it Crash was fixed extremely promptly! I'd still like an option for the old plain checkmark widgets, but hey. Utterly wonderful app.", "Numbers": "13", "Date": "August 16, 2016"}, {"Content": "Very handy for habit tracking, straight to the point & never crashes", "Numbers": "14", "Date": "September 3, 2016"}]