[{"Content": "When it was working (three weeks ago) kiwix was a delight. Then it changed its own configuration on the fly. It tried to move 60 GB of data into 7 GB of storage, and crashed in the process. The data disappeared. Trying to download it again failed - there are several bugs in download, including unexpected changes from the download page to the home page, with no way back. The second bug is in synching a restarted download to the partial, interrupted data files. The app has no navigation to the previous page, from the home page.", "Numbers": "1", "Date": "August 26, 2018"}, {"Content": "When Kiwix updated to version 2.4, Kiwix immediately lost the ability to open the Wikipedia zim file and just crashes. I have encountered this problem before, and it is always because the new version (since 2.3) tries to auto detect the SD card folder and fails. I have reverted back to version 1.96 as this version allows the SD card folder to be explicitly specified. 5 stars for the old version of Kiwix (1.96). 0 stars for the new version (2.4).", "Numbers": "2", "Date": "September 19, 2018"}, {"Content": "Getting Kiwix to a usable point is time consuming and troublesome. I dug through the list and set it to download several wikis. The app seems to need to be in focus to download, downloads keep pausing, the app keeps crashing, and after three days in I finally only gotten one wiki - meanwhile it's constantly harassing new to rate the app. The app doesn't seem to take me to a list of wikis when I start it, it just dumps me into the first one I downloaded, and I have to dig into a menu to find the others. Not at all intuitive. Maybe it'll be different when I finally get a second wiki on here. It's an awesome premise! I can read and research when I'm in a dead zone, the internet is down or at camp. However, getting to that point drinking is a pain!", "Numbers": "3", "Date": "October 29, 2018"}, {"Content": "Used for over a year with no problem until now. Reset phone and trying to reinstall. Download over wifi only is not working on a s5 neo. Lost 2gb of data. After a week of trying i still cannot download wiki. It keeps aborting and starting again. App also crashes regulary.", "Numbers": "4", "Date": "October 20, 2018"}, {"Content": "I love this app! It allows me to view Wikipedia when I don't have net access. However, just last night, it keeps crashing immediately after opening. I have tried to reinstall it and it loads the logo and asks for permission to access the storage. The app crashed regardless of the choice and results in an empty logcat.txt", "Numbers": "5", "Date": "December 30, 2018"}, {"Content": "I carry a world in my pocket with this app. I'm proud of not my phone but of this great app. NOTE: Recently, this app has started given me a lot of problems. When I try to get content (which I have already downloaded on SD) it tries to show them but after a few seconds it gets crashed. I tried various ways to solve this problem but to no avail. Pls, do something about it asap. Update may fix the problem. Thank you very much. My Device: Gionee M7 power (Android) Ram: 4GB, SD card: 128 GB", "Numbers": "6", "Date": "August 17, 2018"}, {"Content": "Don't know what's wrong with this app, but it started crashing suddenly on Att a am sung galaxy J3. Can we get it working? I will be using XOWA for now.", "Numbers": "7", "Date": "December 14, 2018"}, {"Content": "Good, but the bookmarks stopped working in the latest version. it just crashes the app.", "Numbers": "8", "Date": "August 14, 2018"}, {"Content": "Can't download the full version without the app crashing, need to do no pictures instead", "Numbers": "9", "Date": "October 4, 2018"}, {"Content": "Content downloads are non functional and do not proceed. Cancelling frozen downloads crashes the app.", "Numbers": "10", "Date": "December 14, 2018"}, {"Content": "Unusable, will not download in app and when download is canceled, it crashes app. Tried multiple times with same result.", "Numbers": "11", "Date": "October 17, 2018"}, {"Content": "Please my app use to crash, i don't know why", "Numbers": "12", "Date": "January 2, 2019"}]