[{"Content": "Horrible ADs, the app contains full screen video ads. Had to uninstall the ADs were crashing my brand new pixel 2", "Numbers": "1", "Date": "May 14, 2018"}, {"Content": "This app is really good. However, there are some flaws which really bother me. First of all, I've already rated the app yet it still asks me to rate it. Another thing is that I don't see any new life hacks around, yet you said you'll have 100 new life hacks every week starting from the end of May. Thanks for your patience. EDIT: I can see the new life hacks, they're just at the bottom and the older ones stay at the top which is kind of annoying, but thanks anyway. The app stopped crashing, thanks for fixing. I wish you good luck! :)", "Numbers": "2", "Date": "February 21, 2018"}, {"Content": "Hate the new update, it always crashes. Never let's me use the app. Loved this before the update /:", "Numbers": "3", "Date": "January 30, 2018"}, {"Content": "Fun but crashes when changing categories.", "Numbers": "4", "Date": "December 16, 2017"}, {"Content": "It crashes", "Numbers": "5", "Date": "June 2, 2017"}, {"Content": "Lifehack is untrue Feedback section is unavailable and crashes the app. Lifehack 1163 is false, the squares are markers for the machine processing the tube-shaped packaging to cut the material. They vary for different models of cutting machine. Not dependant on size.", "Numbers": "6", "Date": "October 5, 2016"}, {"Content": "Lots of bull, no feedback A whole lot of the so-called hacks are baloney, and there is no way to submit corrections. Feedback gets you a crashed app.", "Numbers": "7", "Date": "December 14, 2016"}, {"Content": "Nice app There's a lot of cool and nice Life Hacks on here to improve anyones life :) It crashes sometimes for me but still, nice app.", "Numbers": "8", "Date": "February 5, 2017"}, {"Content": "Pathetic. This app sucks. App is crashing whenever net goes off in between. Idiots. Don't try this people.", "Numbers": "9", "Date": "August 29, 2016"}, {"Content": "Crashes Couldn't open it, please try to fix it.", "Numbers": "10", "Date": "May 11, 2016"}]